{"pageProps":{"article":{"id":"23ae98b0-438a-4cfb-a73a-5019c375c914","date":"May 5, 2022","author":"Alfred Bright","title":"Stephen Amell Reflects on Arrow’s Legacy","excerpt":"Would Stephen Amell ever reprise his role as Green Arrow?","keywords":"Stephen Amell Arrow, Stephen Amell Oliver Queen Arrow","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52051833833_b239ed7e3e_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The 10th anniversary of the debut of Arrow, the superhero TV series that launched one of the most important corners of superhero media history, will be celebrated in October. It is not an exaggeration to say this. Arrow lasted eight seasons and inspired over a half-dozen spinoffs, several of which are still on the air today. Years before its major competition in the shared universe sweepstakes, the MCU, even considered the potential of the multiverse, it addressed the most ambitious comic book plot of all time in real action. It also made Stephen Amell, the starring actor, a star.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Heels, a Starz drama about the ups and downs of an indie professional wrestling promotion, stars Amell. As the program was wrapping up its first season back in September 2021, the issue of Arrow came up. While we haven't officially celebrated ten years of Arrow on television, it has been ten years since Amell was cast as Oliver Queen. DC was honoring the 80th anniversary of Green Arrow.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”In the pilot episode when I threaten Adam Hunt and I tell him to transfer something to Starling City Bank…it was bank account 1141. That is November 1941, in honor of [the first comic book appearance of] Green Arrow…10 years, that’s 1/8 of the time that this character has been around. So I think of myself as a I’m an ambassador for the character. I got to wear the hat with the feather, so to speak, but not done the goatee for a short period of time, and that makes me very proud.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52050754007_1f93e5e6b1_b.jpg\" alt=\"Stephen Amell Arrow, Stephen Amell Oliver Queen Arrow\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Not only did Amell portray Oliver Queen for eight seasons of Arrow, plus a few guest appearances, but he also got to achieve something that only a few superhero actors have ever done: he got to end his character's tale. And in a suitably heroic manner, no less. The Green Arrow's narrative culminated with Crisis on Infinite Earths, and the individual who began it all turned out to be the key to preserving the multiverse.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”What means a great deal to me is we did get to control the ending. That happens so rarely. To have that conversation with Greg Berlanti during the sixth season, and to decide that seven and then a truncated version of the eighth season would wrap up the story, it’s just such a blessing, because we got to do it the right way. We got to say goodbye to people in the right way. In my opinion, the way it should end for any superhero without superpowers is in the ground. Although I think Oliver just turned into energy. So you know, never say never.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When he was asked if he could ever picture himself picking up Oliver's bow again after that “never say never” comment.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”Oh, sure. I owe so much to the people of DC, The CW, and Warner Bros. Television. I love the character so much and only love it more now that it’s coming up on two years since we wrapped the show….But having a little space now, I saw that I miss it. I do look back very, very, very fondly on it….Listen, I’m the namesake. So if I can ever be of any any help, if I can be of service to the Arrowverse in any way, shape or form, or better still take it to a new place, which I think would be the more interesting route to go, be that in a limited capacity or on a different platform, maybe one where we could show blood, that’d be really cool.”</p>\n                </div>\n                "]},"reco":[{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"},{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."}]},"__N_SSG":true}