{"pageProps":{"article":{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more.","keywords":"Stranger Things Season 5, upside down, netflix","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to Matt Duffer, the show's co-creator, Stranger Things season 5 will leave viewers wanting more. Netflix's famous supernatural series is expected to return to the streaming site next month with a season 4 divided into two volumes, following a nearly three-year break due to pandemic-related delays. The first four episodes will air on May 27, with the final five episodes following on July 1. Season 4 will start up six months after the Battle of Starcourt, and will be written and directed mostly by the Duffer Brothers.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Billy had sacrificed himself to defend Eleven, Mike, and Max from the Mind Flayer in 2019, while Hopper battled and killed Grigori before being presumably dissolved when Joyce triggered an explosion to lock the portal to the Upside Down. Season 4 will pick up in the aftermath, as the show's core buddy group is forced to negotiate the hardships of high school for the first time, while a new otherworldly menace lurks in the Upside Down. Stranger Things will be renewed for a fifth and final season, so it won't be the end of the show just yet.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Duffer Brothers gave one of the first big hints for Stranger Things season 5 during an interview with SFX magazine (via GamesRadar). Matt claims that the final season will leave viewers \"wish[ing] for more,\" and that, while this may make fans feel like Stranger Things is ending too soon, it \"felt right\" to him.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Even with five it’s going to feel like it’s ending a little early. We’re going to feel like we still have a lot more gas left in the tank. But I think that it’s better to end there with us wanting more. That’s why ending at five felt like the right move.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52019386044_f161a745d4_h.jpg\" alt=\"Stranger Things Season 5, upside down, netflix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While die-hard Stranger Things fans may be unhappy to learn that the show will end with a lot of gas still in the tank, the Duffer Brothers' choice to stop the program after five seasons is fully warranted, and their reasoning is valid. It's usually preferable for a program to end on a high note rather than overstaying its welcome, as some of the most celebrated shows have done, such as The Office or Dexter, which both arguably experienced quality drops in their final seasons.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Mad Men and Breaking Bad, for example, ended at the perfect moment, with the latter finishing after five seasons, which is considered a sweet spot for dramas. More isn't necessarily better, as several programs have demonstrated. The Duffer Brothers should be able to maintain the show's heritage and leave fans wanting more with a solid final season, which they may receive. Stranger Things will always have the option to expand the franchise and tell new tales through Netflix spinoffs, something the Duffers are open to.</p>\n                </div>\n                ","\n                <div class='ArticleBody_relatedNext__4ybLJ'>\n                <p class='ArticleBody_relatedCap__07hkO'>READ NEXT:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='6d8df57f-04ce-496f-b891-06c8208020ec'>Season 4 Of Stranger Things Is Similar To Game Of Thrones, According To The Creators</a>\n                </div>\n                "]},"reco":[{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"},{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."}]},"__N_SSG":true}