{"pageProps":{"article":{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero.","keywords":"zac efron mcu, zac efron marvel, zac efron fantastic four, zac efron human torch","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If the perfect job came along, Zac Efron says he would leap at the chance to join the Marvel Cinematic Universe. Efron's career was launched with his portrayal as Troy Bolton in the famous Disney Channel original High School Musical. He's gone on to feature in big-budget comedies like Neighbors and Hugh Jackman's musical The Greatest Showman, as well as independent dramas like Lee Daniels' The Paperboy and Netflix's Ted Bundy picture Extremely Wicked, Shockingly Evil, and Vile.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Disney and Marvel Studios continue to hire top-tier talent, from Oscar Isaac and Florence Pugh to filmmakers like Chloé Zhao, as the MCU grows across all platforms (Eternals). Given the MCU's unmatched profit margins and certified-fresh track record on Rotten Tomatoes, just about everyone in Hollywood would at least contemplate joining its world. Efron has recently become a favorite fan cast for characters like as Nova, Adam Warlock, and the Human Torch, and it appears that he'd want to play a superhero/villain in the MCU.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52048048182_1c9914dcd9_b.jpg\" alt=\"zac efron mcu, zac efron marvel, zac efron fantastic four, zac efron human torch\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Efron discussed joining the MCU in a recent interview with Extra TV. When questioned about his fancasting, the former High School Musical actor was asked if he would ever consider portraying a superhero.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"I love the Marvel universe. I've been a fan of Marvel since I started walking. If the right character comes along, and they want me to jump in, I would jump at the opportunity.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Efron has made a concentrated attempt to escape his High School Musical beautiful boy image, similar to Robert Pattinson's path from Twilight to the newest Caped Crusader. It's no surprise that Efron, as one of the greatest actors on the globe who also happens to have a business connection with Disney, had a close call with a comic book part. Adam Warlock was cast by Marvel Studios for Guardians of the Galaxy Vol. 3. It was said that they were on the lookout for someone who met Efron's description, which led them to Will Poulter. To say the least, the studio already regards the Baywatch star as a clichéd superhero. It is only a matter of time before he plays one or portrays a villain that defies expectations.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Marvel Studios now owns Deadpool, the Fantastic Four, and the X-Men, thanks to Disney's acquisition of Fox in 2019. Mutants like Cyclops or even the hyper-muscular Wolverine might be the perfect fit for Efron when films like Doctor Strange in the Multiverse of Madness expand the MCU's reach and flood its universe with even more people. In the meanwhile, Efron may be seen in the newest adaption of Stephen King's Firestarter on May 13 before appearing in a Disney+ version of Three Men and a Baby.</p>\n                </div>\n                "]},"reco":[{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"},{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."}]},"__N_SSG":true}