{"pageProps":{"article":{"id":"746d1140-6058-4fe4-aefe-d9cf8ac88dd1","date":"Apr 24, 2022","author":"Kohei Watanabe","title":"Naruto x Jordan Collaboration Is Teased by Nike","excerpt":"In a forthcoming partnership, the legendary shonen franchise Naruto joins forces with Nike's Jordan Brand and Zion Williamson of the New Orleans Pelicans.","keywords":"anime, nike naruto collaboration, zion naruto, nike jordan naruto collaboration","tags":"anime news","thumbnail":"https://live.staticflickr.com/65535/52025741233_bd8d20eef0_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A new Naruto partnership will bring together ninjas and basketball players.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nike's Jordan Brand and the renowned shnen series will reportedly cooperate on a new collection of Naruto-inspired footwear, as announced on Twitter. While no information regarding the nature of the partnership have been released, it has been announced that New Orleans Pelicans power forward Zion Williamson will be involved. On Twitter, Williamson stated, \"Excited to share our tale with the world. The [Jordan] Zion 1 x Naruto Collection is inspired by our parallel paths of conquering hardship. Stay tuned!\"</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Shinobi Way.<br><br>Stay tuned. 👀<a href=\"https://twitter.com/Naruto_Anime_EN?ref_src=twsrc^tfw\">@Naruto_Anime_EN</a> <a href=\"https://twitter.com/Zionwilliamson?ref_src=twsrc^tfw\">@Zionwilliamson</a> <a href=\"https://t.co/gDOqE4EHTw\">pic.twitter.com/gDOqE4EHTw</a></p>— Jordan (@Jumpman23) <a href=\"https://twitter.com/Jumpman23/status/1517647051466575872?ref_src=twsrc^tfw\">April 22, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Williamson's post and Jordan Brand's official Twitter both tweeted a photo of the Jumpman emblem and Naruto Uzumaki making a slam dunk, with Jordans labeling the photo, \"The Shinobi Way.\" According to Williamson's tweet, the future collection will feature the athlete's Zion 1 sneaker.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Excited to share this story with the world. The <a href=\"https://twitter.com/Jumpman23?ref_src=twsrc^tfw\">@Jumpman23</a> Zion 1 x Naruto Collection is inspired by our parallel paths of overcoming adversity. Stay tuned! <a href=\"https://twitter.com/hashtag/BelieveIt?src=hash&amp;ref_src=twsrc^tfw\">#BelieveIt</a> <a href=\"https://t.co/e4QnbeEpAT\">pic.twitter.com/e4QnbeEpAT</a></p>— Zion Williamson (@Zionwilliamson) <a href=\"https://twitter.com/Zionwilliamson/status/1517658407536312323?ref_src=twsrc^tfw\">April 23, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Masashi Kishimoto's Naruto manga series was serialized in Shueisha's Weekly Shnen Jump from 1999 to 2014, resulting in 72 volumes. It is one of the best-selling manga series of all time, with classics such as Eiichiro Oda's One Piece, Gosho Aoyama's Detective Conan, and Akira Toriyama's Dragon Ball, with over 250 million copies sold worldwide. Naruto, which aired from 2002 to 2007 and covered the first half of the plot, and Naruto: Shippuden, which aired from 2007 to 2017 and covered the post-time jump section of the story, were two anime series adapted from the manga by Studio Pierrot and Aniplex. There are approximately 700 episodes between the two.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52025706216_1bf12ab1e5_b.jpg\" alt=\"anime, nike naruto collaboration, zion naruto, nike jordan naruto collaboration\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Naruto franchise's new deal with Jordan Brand isn't the only recent cooperation. Hello Kitty and Chococat costumed as Naruto Uzumaki and his nemesis Sasuke Uchiha, respectively, were recently published by Sanrio as part of a unique collection of vinyl figures. Pre-orders are presently being taken for the figurines, which are priced at $94.99 apiece. In 2021, Mister SFC debuted a new line of rings, necklaces, pendants, earrings, and pendants inspired on Naruto's legendary weapons, like as Zabuza's sword and Asuma's chakra swords.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nike isn't the only shoe company to release a Naruto-inspired collection. Mizuno, a Japanese sportswear brand, teamed with Naruto on a line of sneakers inspired by the anime's three major characters, Naruto Uzumaki, Sakura Haruno, and Sasuke Uchiha, in January of this year. Mizuno's \"Contender\" collection, unlike the anticipated Jordan Brand collaboration, is exclusively available at select Japanese shops or on the company's website.</p>\n                </div>\n                "]},"reco":[{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"},{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."}]},"__N_SSG":true}