{"pageProps":{"article":{"id":"932dada0-caaa-4647-9b04-9959a41d8da6","date":"Apr 18, 2022","author":"Alfred Bright","title":"Moon Knight Has Been Active In The MCU For Longer Than Spider-Man, According To Marvel","excerpt":"Marc Spector has been active in the MCU for even longer than known heroes like Spider-Man, according to a throwaway phrase in Moon Knight episode 3.","keywords":"marvel, mcu, moon knight, spider man, peter parker","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52013114754_bf9a552339_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Moon Knight episode 3 teases that his hero has been a part of the Marvel Cinematic Universe for longer than Spider-Man. The genesis narrative for Marvel's Moon Knight Disney+ TV series has been told in a unique way. It effectively exploits Moon Knight's DID as a story device, with the first two episodes told through the perspective of Steven Grant, an alter who has no idea he's also a superhero powered by the ancient Egyptian deity Khonshu.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This implies that, for the most part, spectators only know a bit more about Steven Grant than he does. Indeed, thus far, Moon Knight has only hinted at the superhero's backstory, in which Marc Spector was rescued from death by Khonshu and thereafter became his avatar. There's no way to tell how all of this fits into the main timeframe. Marc Spector's passport was reportedly granted during the Blip, indicating that he was not a victim of Thanos' snap, but that's the only clue as to where Moon Knight falls into the main MCU chronology so far.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52013390475_f9b062a7df_h.jpg\" alt=\"marvel, mcu, moon knight, spider man, peter parker\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, Moon Knight episode 3 does provide a slight hint, showing that Layla Abdallah El-Faouly fled Egypt 10 years ago under unexplained circumstances involving her father's murder, with Marc Spector allegedly implicated. Layla is undoubtedly influenced by a woman named Marlene from the comics, whose father sadly perished during Moon Knight's origin narrative. Given this, it's safe to assume Spector has been Moon Knight for at least a decade. According to the Disney+ timeline, the Moon Knight TV short takes place in early 2025 in the Marvel Cinematic Universe, which means Spector has been serving Khonshu for ten years and has been a vigilante for longer than even Spider-Man.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's worth noting that Spector's Moon Knight has been active during a particularly trying moment in the superhero world. In Captain America: Civil War, set in 2016, the Sokovia Accords separated the Avengers, resulting in no official band of Avengers - maybe a good thing, since they might have easily been dispatched to hunt down this unknown, ruthless vigilante. Moon Knight survived Thanos' snap in 2018, and was very certainly kept very busy in the ensuing global catastrophe; presumably, this also explains why no one noticed his activities, considering the magnitude of the problem.</p>\n                </div>\n                "]},"reco":[{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"},{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."}]},"__N_SSG":true}