{"pageProps":{"article":{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens.","keywords":"from season 2, from renewed for another season","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The smash new series From, the spooky invention of Crater's John Griffin, has been renewed by EPIX, MGM's premium satellite and cable network. Set in a secret village that confines everyone who enters — think Lost, which is also produced by series creators Jack Bender and Jeff Pinkner — the show has become one of the network's most popular original programs, with a 94 percent Rotten Tomatoes score. The series has also been well received by audiences, with an overall score of 87 percent based on over one hundred individual ratings.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"In Season 2, hidden truths about the nature and terrifying origins of the town begin to emerge, even as life for its residents is plunged into chaos by the arrival of mysterious newcomers,\" according to a press statement. According to the press announcement, filming will begin this summer in Halifax, Nova Scotia, with an air date set for 2023. Fans will undoubtedly be anxious to return to the action as soon as possible, given that the renewal news comes only two weeks after the Season 1 conclusion.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to the press release, \"current performance metrics suggest that the entire series is on course to be EPIX's second most-watched original after Emmy-winning series Godfather of Harlem, executive produced by and starring Forest Whitaker.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”The first season of From mystified, enthralled, and terrified fans and critics alike with its haunting world, vivid characters and thrilling scares. We have been delighted by the social conversation generated by the From community and can't wait to unravel more of this mysterious story with our passionate fans in season two” -Michael Wright, president of EPIX</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52036525522_a3ca2f73c0_o.jpg\" alt=\"from season 2, from renewed for another season\">\n                </div>","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"On behalf of the producers, writers, our insanely talented cast and crew,we are thrilled and grateful to both EPIX and our audience for the opportunity to continue exploring the world of From.\" -Jeff Pinkner, executive producer</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>EPIX Studios and MGM International Television Productions collaborated on From. Josh Appelbaum, André Nemec, Scott Rosenberg from Midnight Radio, Anthony & Joe Russo, Mike Larocca from AGBO, and Lindsay Dunn serve as executive producers with Pinkner, Griffin, and Bender.\nAdrienne Erickson of Midnight Radio acts as co-executive producer.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}