{"pageProps":{"article":{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero.","keywords":"zac efron mcu, zac efron marvel, zac efron fantastic four, zac efron human torch","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If the perfect job came along, Zac Efron says he would leap at the chance to join the Marvel Cinematic Universe. Efron's career was launched with his portrayal as Troy Bolton in the famous Disney Channel original High School Musical. He's gone on to feature in big-budget comedies like Neighbors and Hugh Jackman's musical The Greatest Showman, as well as independent dramas like Lee Daniels' The Paperboy and Netflix's Ted Bundy picture Extremely Wicked, Shockingly Evil, and Vile.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Disney and Marvel Studios continue to hire top-tier talent, from Oscar Isaac and Florence Pugh to filmmakers like Chloé Zhao, as the MCU grows across all platforms (Eternals). Given the MCU's unmatched profit margins and certified-fresh track record on Rotten Tomatoes, just about everyone in Hollywood would at least contemplate joining its world. Efron has recently become a favorite fan cast for characters like as Nova, Adam Warlock, and the Human Torch, and it appears that he'd want to play a superhero/villain in the MCU.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52048048182_1c9914dcd9_b.jpg\" alt=\"zac efron mcu, zac efron marvel, zac efron fantastic four, zac efron human torch\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Efron discussed joining the MCU in a recent interview with Extra TV. When questioned about his fancasting, the former High School Musical actor was asked if he would ever consider portraying a superhero.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"I love the Marvel universe. I've been a fan of Marvel since I started walking. If the right character comes along, and they want me to jump in, I would jump at the opportunity.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Efron has made a concentrated attempt to escape his High School Musical beautiful boy image, similar to Robert Pattinson's path from Twilight to the newest Caped Crusader. It's no surprise that Efron, as one of the greatest actors on the globe who also happens to have a business connection with Disney, had a close call with a comic book part. Adam Warlock was cast by Marvel Studios for Guardians of the Galaxy Vol. 3. It was said that they were on the lookout for someone who met Efron's description, which led them to Will Poulter. To say the least, the studio already regards the Baywatch star as a clichéd superhero. It is only a matter of time before he plays one or portrays a villain that defies expectations.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Marvel Studios now owns Deadpool, the Fantastic Four, and the X-Men, thanks to Disney's acquisition of Fox in 2019. Mutants like Cyclops or even the hyper-muscular Wolverine might be the perfect fit for Efron when films like Doctor Strange in the Multiverse of Madness expand the MCU's reach and flood its universe with even more people. In the meanwhile, Efron may be seen in the newest adaption of Stephen King's Firestarter on May 13 before appearing in a Disney+ version of Three Men and a Baby.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}