{"pageProps":{"article":{"id":"6d8df57f-04ce-496f-b891-06c8208020ec","date":"Apr 11, 2022","author":"Wallace Bell","title":"Season 4 Of Stranger Things Is Similar To Game Of Thrones, According To The Creators","excerpt":"While discussing Stranger Things season 4, the Duffer Brothers make a comparison between the Netflix series and Game of Thrones.","keywords":"stranger things, game of thrones, netflix, hbo","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51997038444_e1d6e422c3_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to creators Matt and Ross Duffer, Stranger Things season 4 is similar to Game of Thrones. When season 1 of Stranger Things premiered in 2016, it quickly became one of Netflix's most popular series. Seasons 2 and 3 of the fantasy/horror series were just as successful, and the first half of season 4 will premiere on Netflix on May 27. On July 1, the second half of Stranger Things Season 4 will air.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Netflix has given people a pretty clear picture of what the tale will involve based on the teasers for Stranger Things season 4. This time, the primary cast will be split up, with Hopper going to Russia, Eleven and the Byers family going to California, and the remainder staying in Hawkins, Indiana. The Mind Flayer will almost certainly play a role in the show's narrative, but Victor Creel's (Robert Englund) tale appears to be linked to the Upside Down, with Dustin, Lucas, Nancy, Steve, Max, and Robin examining the abandoned Creel House in one of Stranger Things season 4's teasers.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Matt Duffer: ”We kind of jokingly call it our Game of Thrones season because it’s so spread out, so I think that’s what’s unique or most unique about the season. Joyce and Byers family to have left at the end of Season 3. They are in California – we’ve always wanted to have that like ‘E.T’.-esque suburb aesthetic, which we finally got to do this year in the desert; and then we have Hopper in Russia; and then of course we have a group remaining in Hawkins. So we have these three storylines, are all connected and kind of interwoven together, but it’s just very different tones.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Ross Duffer: ”[but] we didn’t know how big the season was going to get, and we didn’t even realize until we were about halfway through, just in terms of how much story that we wanted to tell this season. Game of Thrones is one thing we’ve referenced, but also for us really what it’s about is revelations, in that we really wanted to start giving the audience some answers.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51995761087_b89985595e_b.jpg\" alt=\"stranger things, game of thrones, netflix, hbo\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Because Stranger Things' popularity rises with each season, Netflix has regularly made each season greater than the last. In terms of plot and production, Game of Thrones was a genuinely big show, so the Duffer Bros analogy really speaks to the scope of season 4. Stranger Things must, however, retain its fascinating story rather than relying solely on CGI-heavy action set pieces. Game of Thrones was known for its thrilling battles and action, but subsequent seasons prioritized it above the show's core plot.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}