{"pageProps":{"article":{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake.","keywords":"Tom Cruise The Mummy director, tom cruise monster universe","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Universal-backed adventure tentpole starred Tom Cruise and was designed to jumpstart the studio's Dark Universe, a franchise of interconnected films based on classic Universal monster movies. Alex Kurtzman has called his 2017 directorial effort \"The Mummy\" the \"biggest failure of my life, both personally and professionally.\" The Mummy received widespread acclaim from reviewers and made $410 million worldwide, ultimately putting the studio's franchise dreams to rest.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I tend to subscribe to the point of view that you learn nothing from your successes, and you learn everything from your failures. And [‘The Mummy’] was probably the biggest failure of my life, both personally and professionally.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52035758044_80df9a5f6a_b.jpg\" alt=\"Tom Cruise The Mummy director, tom cruise monster universe\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Kurtzman said that \"The Mummy\" provided him \"a million things I regret,\" he also stated that it gave him so many gifts that are inexpressibly magnificent.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”I didn’t become a director until I made that movie, and it wasn’t because it was well-directed – it was because it wasn’t. I am very grateful for the opportunity to make those mistakes because it rebuilt me into a tougher person, and it also rebuilt me into a clearer filmmaker. That has been a real gift, and I feel those gifts all the time because I’m very clear now when I have a feeling that doesn’t feel right,” Kurtzman added. “I am not quiet about it anymore. I will literally not proceed when I feel that feeling. It’s not worth it to me. And you can’t get to that place of gratitude until you’ve had that kind of experience.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Universal's Dark Universe was supposed to contain a sequel to Cruise's \"The Mummy,\" as well as a Dr. Jekyll film starring Russell Crowe and a \"Bride of Frankenstein\" film starring Javier Bardem. After \"The Mummy\" flopped with reviewers and at the box office, none of these films were developed. Cruise bounced back a year later with \"Mission: Impossible – Fallout,\" which grossed $791 million worldwide and became the highest-grossing \"Mission\" film to date.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}