{"pageProps":{"article":{"id":"8ef2fc57-dad6-4a5e-9cd1-c9cf61c4931d","date":"Aug 9, 2022","author":"Brian Martin","title":"Does Moon Knight Deserve a Second Season?","excerpt":"According to a social media post, The Fist of Khonshu will return for a second season. Is that, however, a good thing?","keywords":"Moon Knight Season 2","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52272473257_8eaa597711_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The query from Oscar Isaac and director Mohamed Diab in a popular TikTok video raised expectations that a new Moon Knight season was in the works. Since the first season's run concluded in May, there hasn't been a clear indication of what Marc Spector, Steven Grant, and Jake Lockley's future in the Marvel Cinematic Universe would entail.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many people questioned if the series would ever return due to its unclear relationship to the rest of the MCU and Isaac's one-season contract. However, despite the fact that there has been no official announcement, the video — and Diab's choice to upload it with the header \"Moonknight season 2? \" — appears to imply that Marc Spector and his many personalities could indeed make a comeback on television.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Is that, however, a good thing? Despite the show's high viewership throughout its time on Disney+, reviews were distinctly unfavorable. Even I, the strongest supporter of the show on Marvel Standom, had to concede that the final episode fell short of expectations after the weekly evaluations voiced dissatisfaction. Can The Fist of Khonshu overcome the issues of the first season and fulfill the promise of the idea if a second season is granted?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even the most ardent Moon Knight haters must concede that the show has a lot going for it, starting with lead Oscar Isaac, one of the greatest performers currently on the scene. However, May Calamawy, who played Spector's estranged wife Layla El-Faouly, truly won over the audience with her engaging performance. Marlene Alraune, Layla's comic book inspiration, seldom goes above \"damsel-in-distress level,\" but Calamawy made the character into a nuanced and compelling hero in her own right.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Egyptian filmmaker Diab directed numerous episodes in addition to renowned horror filmmakers Justin Benson and Aaron Moorhead, adding a certain cultural uniqueness to the series. Throughout Spector's experiences in Cairo, Diab would pause to depict native food and wedding ceremonies, which are uncommon in Western television programs. Moon Knight stood apart from other MCU films, which far too frequently took place in either space or New York due to this attention to detail.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nevertheless, the sitcom got off to a bad start by emphasizing on the Steven Grant personality, who was here recast as a clueless English museum employee. The storytelling choice also made Marc Spector a supporting character in his own plot, relegating Isaac's more action-oriented identity to the background and subjecting spectators to his dubious accent. Additionally, because the creators chose to accentuate the change in identities by cutting to black, important action sequences, such as the pivotal battle in the finale, took place off-screen.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Moon Knight has many of the same issues as many Marvel series in that it ran longer than a movie yet did not devote enough episodes to adequately convey the tale. Because of this, Moon Knight sometimes came across as careless, taking its time to let viewers see Steven stumble while hurrying through the last two episodes to get to the important character development.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/b21195fa-f5aa-476d-9b96-1b88d1231aed'>The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite these serious problems, Marvel would have an opportunity to make amends and profit on the premise in Moon Knight's second season. Marc and Steven create a sort of balance as the first season comes to a conclusion, which removes the necessity for the producers to undervalue the former and elevate the latter. Furthermore, Layla may play a more active role in the narrative without having to answer to Spector and Grant now that she is going by the name of the Scarlet Scarab.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Several of the basic plotlines from the first season have been resolved, but others are left open. The post-credits sequence was particularly significant since it exposed the presence of a third personality—the aggressive Jake Lockley—who is still working for Khonshu. A buddy comedy in which Marc and Jake work together to thwart Jake and finally rescue themselves from Khonshu may be the format for the second season.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If Lockley joins the Thunderbolts, the shadowy Avengers that Contessa Valentina Allegra de la Fontaine (Julia Louis-Dreyfus) has been building during Phase 4, that storyline would be exceptionally interesting. Although there had been some thought to incorporating Gorr the God-Butcher from Thor: Love and Thunder or Dane Whitman the Black Knight from Eternals into Moon Knight, the series mostly maintained independent from the rest of the MCU. However, if Moon Knight's comic book exploits are any indicator, it would be entertaining to see how other heroes (or the Thunderbolts' villains) handle Marc and Steven. If Marvel decides to take the live-action version in this manner, Moon Knight season 2 may concentrate on introducing the character to the MCU as a whole.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Finally, there is the issue of bad guys. No one believes that Arthur Harrow is the biggest foe of Moon Knight, despite the fact that Ethan Hawke was cast in the role. The character actually only made an appearance in one comic book issue, and it was in a totally different form. There are still many more illustrious Moon Knight foes to discover on screen.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The main foe of Moon Knight, in addition to the Sun King and the dream demon Morpheus (who should not be confused with the Sandman over at DC), is Raoul Bushman, Marc's former mercenary leader. Bushman undoubtedly makes use of a number of cultural tropes. However, as seen by the Mandarin in Shang Chi, Marvel is skilled in reshaping characters that have a troubled history.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/f604210e-6a8c-4508-9669-4745d39bf7c0'>How the Marvel Cinematic Universe was influenced by The Dark Knight</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Although there are many opportunities for a second season, the question of whether Moon Knight should return is still open. Some would disagree, claiming that \"superhero weariness\" is already beginning to set in, in part due to the numerous films and television series Marvel produces each year. That weariness could only get worse with a new Moon Knight season. However, even Disney can only invest so much money in the MCU, so a second season of the Moon Knight may deprive another character of the resources they need to have their moment in the limelight.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While I do think the MCU should include more obscure Marvel characters like Wonder Man and the Great Lakes Avengers, I believe Moon Knight has too much promise to be overlooked. Putting aside the fact that Moon Knight is portrayed by Oscar Isaac, he presents a rare chance to look at mental health from a superhero perspective. Marc Spector has developed into a figure who discovers how to not just flourish and accomplish good while having a peculiar mental state. Moon Knight demonstrates that being different is not the same as being damaged and may really be heroic, in contrast to the way that too many superhero stories present various mental states as necessarily bad (looking at you, Doctor Strange in the Multiverse of Madness).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It will be interesting to see if Diab and the other Moon Knight creators can translate those ideas into a television show. But it would be unfortunate if Disney didn't even try given the opportunity to do something different.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}