{"pageProps":{"article":{"id":"b94d8c73-15cf-4437-aa16-4ae8334e3208","date":"May 18, 2022","author":"Brian Martin","title":"The Forgotten Pre-Marvel Action Film of Robert Downey Jr.","excerpt":"Interest in the United States is surging like a relic from the past. Marshals is a neglected (and substandard) sequel to Harrison Ford's masterpiece The Fugitive, released in 1998. And there's a reason for it: Robert Downey Jr.'s baby face.","keywords":"Robert Downey Jr. classic movie","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52081976178_3f0b96e7ac_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nobody saw this coming: the United States. In 2022, Marshals, a 1998 sequel/spinoff of 1993's The Fugitive, soared to the top of Netflix's movie chart. Given the film's age and how, simply, irrelevant it has become since its release, this is a curious development. However, its comeback to some level of cultural awareness—perhaps more than when it was first released two decades ago—is intriguing. What caused this to happen?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Robert Downey Jr., who portrays hot-shot secret agent John Royce, who joins the U.S. Secret Service, is the most probable needle mover here. Marshal Sam Gerard (Tommy Lee Jones, reprising his Oscar-winning role from The Fugitive) and his former crew are on the hunt for Sheridan, a highly trained escaped prisoner (Wesley Snipes). Sheridan has been charged with the assassination of two of Royce's fellow covert operatives.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In many respects, the accompanying chase drama is a disaster, but let's maintain the emphasis on Downey for a while. The experience of seeing RDJ as a 31-year-old, pre-Tony Stark, emerging actor in the 1990s is enough to justify viewing this mainly forgettable film on a leisurely afternoon. All of the qualities we adore about him—his confident stride, his endlessly emotional eyes, his unique capacity to be both charming and crazy at the same time—are all present, if only in glimmers.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52082452775_5ea634d477_b.jpg\" alt=\"Robert Downey Jr. classic movie\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Individual elements of the film aren't all that horrible. Early in the film, an aircraft carrying prisoners plummets from the sky (a derivation of The Fugitive's stunning and non-CGI bus accident), and Sheridan's death-defying leap from the roof of a building to a speeding train, all to narrowly elude arrest. A true Spider-Man stunt once more. Throughout the film, there are several well-executed foot chases, and the violence is properly visceral and methodically timed, unlike in many other action films of the era.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When Sheridan surrenders and tells Gerard that he's tired of running and is \"going back to bed,\" it's almost as if the movie is challenging you to do the same. For the most part, director Stuart Baird (Stark Trek: Nemesis) keeps the story going, but unlike The Fugitive, which had numerous climax sequences, including a now legendary dam scenario in which Harrison Ford's Dr. Richard Kimbel takes the final leap of faith, this film never gets into high gear.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's worth remembering that the United States Marshals is one of Downey's final films before he was notably arrested several times over the course of several years for offences related to his drug and alcohol addiction. It's depressing to see the raw talent he had and almost squandered on full display. When you consider the tremendous work he's done since being clean in 2003, it's difficult not to be grateful for the brilliant actor the world came perilously close to losing.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}