{"pageProps":{"article":{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium.","keywords":"james gunn, peacemaker, dc, dcu","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A videotape of the Peacemaker introduction dance routine being replicated for a high school talent event has prompted director James Gunn to respond. The series, which stars John Cena as the titular hero/antihero, is a direct spinoff from James Gunn's The Suicide Group, and follows the vicious mercenary as he is recruited by Amanda Waller's A.R.G.U.S. to join another black ops squad. They've been tasked with dealing with an extraterrestrial menace in the shape of parasitic butterfly-like organisms who've taken up residence in human bodies.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn established the tone for his series with an exhilarating, choreographed introduction dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" Gunn set the tone for his series with an exhilarating, choreographed introductory dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" \"No kidding, we shot the actual opening in a school auditorium not so different from that,\" Gunn said to a tweet showing the sequence being reproduced for a high-school talent competition.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No kidding, we shot the actual opening in a school auditorium not so different from that. <a href=\"https://twitter.com/hashtag/Peacemaker?src=hash&amp;ref_src=twsrc^tfw\">#Peacemaker</a> <a href=\"https://t.co/S9IsLv8ReU\">https://t.co/S9IsLv8ReU</a></p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1507732545470971905?ref_src=twsrc^tfw\">March 26, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker has already been renewed for a second season, so fans will be interested to see what happens with the beginning dance sequence as fresh episodes air. Given that several of the characters from the original scene are no longer alive, such as Annie Chang's Detective Sophie Song and Robert Patrick's Auggie Smith, the sequence is likely to be re-choreographed and re-filmed. The launch date for Peacemaker season 2 has yet to be revealed, so fans may have to wait a while to watch more of John Cena's dance moves.</p>\n                </div>\n                "]},"reco":[{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","title":"Movie Review: The Big Short","tags":"movie news","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged."},{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."}]},"__N_SSG":true}