{"pageProps":{"article":{"id":"2e221ef6-4c78-468f-a2fc-868f6d1e6c5a","date":"Mar 21, 2022","author":"Nick Carver","title":"Gilgamesh from The Eternals, Approves of His MCU Action Figure","excerpt":"Don Lee, who plays Gilgamesh in Marvel's The Eternals, is seen approving of Hot Toys' action figurines based on his role.","keywords":"marvel, mcu, eternals, gilgamesh","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51952772020_5f22a80914_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Don Lee, actor of The Eternals, has been photographed endorsing the Hot Toys action figures based on his Marvel character Gilgamesh. In Chloé Zhao's 2022 Marvel epic, the actor played the immortal hero. Gemma Chan, Richard Madden, Angelina Jolie, Barry Keoghan, Lauren Ridloff, Kumail Nanjiani, Bryan Tyree Henry, Lia McHugh, and Salma Hayek co-starred with Lee in the film.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lee's Gilgamesh is the most powerful of the Eternals and the most powerful of the Celestial-created defenders of the Earth, able to employ his energy manipulation powers to create a powerful exoskeleton that he uses to fight the Deviants. When Thena (Jolie) develops Mahd Wy'ry and inadvertently assaults her fellow Eternals, Gilgamesh exiles her so that her condition does not endanger the team and he can care for her in a more secure environment. While Gilgamesh's function changed from previous drafts, his and Thena's friendship became one of the Eternals' most well-known features, making them likeable characters. Many fans, including Lee himself, were ecstatic to see the character depicted on products, as he disclosed in a recent post.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/78514777-2903-45c3-baff-d78b1abad317'>Actor who played Gilgamesh in the Eternals is said to be returning for a new MCU film or show</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lee was spotted reacting to two recently released pieces of Eternals memorabilia starring Gilgamesh, as shared by the Eternals Update Twitter fan account. Lee may be seen holding two Hot Toys pieces in the images. He has a Cosbaby Gilgamesh figure inspired by chibi art, as well as a high-end Hot Toys Sixth Scale figure Gilgamesh, who will join the already announced Thena Sixth Scale figure as the second character in the Eternals series. Lee is smiling in the photo, holding each of the two things and giving them a thumbs up in appreciation.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://pbs.twimg.com/media/FOAsvkFXEAMuT2u?format=jpg&name=900x900\" alt=\"marvel, mcu, eternals, gilgamesh\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Hasbro has previously created figures based on the Eternals, as well as their Deviant nemesis Kro (Bill Skarsgard), in their Marvel Legends series of 6-inch action figures. However, unlike Lee, one of his co-stars, Salma Hayek, has spoken out about troubles she's had with her Marvel Legends Ajak action figure. Hayek said her action figure's look was \"scary\" on a televised appearance with Nanjiani to promote the film, after which she jokingly duplicated the figure's image. The figure, according to Nanjiani, had a \"E.T head.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Gilgamesh sacrificed himself to stop Kro in Eternals, the character's concern for Thena and Lee's performance struck a chord with viewers. As a result, many fans are looking forward to items featuring his character. Hot Toys is well-known for making high-quality figures of Marvel heroes, which have a long history of being highly detailed and accurate. Collectors may be able to look forward to future products depicting the Eternals' toughest combatant, with Lee speculated to return for a future MCU project.</p>\n                </div>\n                "]},"reco":[{"id":"554a196c-b8fb-4e35-996c-c4cf278880c4","date":"Oct 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52434788479_04e82a9daa_o.png","title":"Movie Directors Who Could Direct Marvel Studios’ Blade Reboot","tags":"movie news","excerpt":"We have a few ideas for the next Blade MCU adaptation's director, which Marvel needs."},{"id":"b09096a6-98ee-4d01-9efb-174cf2d788b4","date":"Oct 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52401112067_bb1a1c6efc_o.png","title":"Why the King Kong speech from Training Day is one of the greatest movie monologues ever","tags":"movie news","excerpt":"In Training Day's King Kong announcement, Denzel Washington improvised the key sentence, but it was crucial."},{"id":"5fd80d5c-3cf0-4561-9756-1b3dcde0256e","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365853308_682f751031_o.png","title":"List of Best Evan Peters Movies and Tv Shows That You Should Watch","tags":"movie news","excerpt":"Over the course of his acting career, Evan Peters has portrayed a wide range of roles. Here is a ranking of his top performances."},{"id":"38c66650-6d87-421f-ae1e-c703aad6d1fa","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365798648_c3c2c64775_o.png","title":"When Denzel Washington Redefined Mob Rule in American Gangster","tags":"movie news","excerpt":"Denzel Washington's performance in Ridley Scott's American Gangster is absolutely outstanding."}]},"__N_SSG":true}