{"pageProps":{"article":{"id":"49632934-8cbe-4f4d-9f73-5eb1611a773b","date":"Sep 13, 2022","author":"Brian Martin","title":"Movie Review: The Big Short","excerpt":"Adam McKay's critique of the 2008 financial catastrophe, The Big Short, starring Christian Bale and Steve Carell, will make you enraged.","keywords":"The Big Short movie review","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52354395338_a8d6e17e50_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>You might want to pass over The Big Short in favor of, say, Creed if you want to watch something upbeat and motivational over the Christmas season. Also consider The Revenant. In fact, Krampus may offer you greater holiday happiness. The Big Short is undoubtedly McKay's most sophisticated and nuanced picture to date. It is humorous and sharp, if sometimes. However, you'll still feel a little down or a little furious after it, and you'll be left wondering why you're feeling that way in the first place.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Big Short, which is based on the best-selling book by Moneyball author Michael Lewis, mostly sticks to the facts while changing a few names: for a while, Wall Street firms were marketing financial \"products\" that were actually collections of subpar home loans, numbering in the thousands. When eccentric analyst Michael Burry realized in 2005 that those loans were certain to default within a few years, he invented a product called the \"credit default swap,\" an instrument that would \"short\" the housing market and essentially allow Burry and others to make outrageous sums of money even as that market - and then the global economy - came crashing down.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Don't worry if you're not sure you understand the text above; I wrote it and I'm not sure I understand what it means either. These financial \"products\" are purposefully made ambiguous to keep the truth about what they are from being completely exposed, at least to the public and maybe even some of the players involved, McKay takes care to underline in the script he co-wrote with Charles Randolph. Every now and then, McKay interrupts the action to have a famous person provide some context: Look at Margot Robbie relaxing in a Jacuzzi! Selena Gomez is shown here playing blackjack! Even if they don't always adequately explain things, it's a humorous (and eventually tiresome) approach to make a statement about how little anybody actually knows.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Except Burry, possibly. Mark Baum (Steve Carell), a skeptic hedge fund manager who has been decrying Wall Street tactics for years, finds himself almost helpless to stop his own company from sticking their noses into the trough created by Burry's \"products,\" is led down the path of depravity by Christian Bale's off-center money manager and heavy metal fan. Baum is led down the path of depravity by Burry.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52354395308_819e366c14_b.jpg\" alt=\"The Big Short movie review\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>All three performers do a good job; Bale's Burry is analytical and emotionally disconnected until late in the game when he realizes what he has done and you can sense the horror coming from him. Gosling plays a devil in a blue suit, while Carell plays a character who simultaneously loves and hates his job. Carell's character has possibly the most complicated character. A world-weary Brad Pitt returns to the game one final time to help two young brokers earn a place at the table in the third narrative, which is perhaps the least detailed of the five. However, his reasons are at best hazy.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Outside of movies like Talladega Nights and Anchorman, McKay has always had a social conscience in his work, and it's obvious that The Big Short is maybe more significant to him than anything else he's done. Congratulations to him for that as well as for convincing a studio to produce a film on the madness, irrationality, and greed that still characterize our banking industry today and make another crisis nearly seem imminent. But even while this is light years apart from the typically childish (though funny) antics of his prior movies, McKay can't quite make everything come together in this one.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>First of all, he fails to solve the problem of explaining all this economic voodoo to those watching in a theater, and there are occasions when the spectator won't understand what the cast is saying. More crucially, by depicting the 2008 disaster as both an absurdist comedy and the tragedy it actually was, he wants to have his cake and eat it too (just like the men he's criticizing). When the movie veers into all-dark terrain during the third act, it lacks the seriousness and effect you would think the filmmaker truly meant it to have since the many plotlines and shifting tone never quite gel.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Sincerely, McKay deserves praise for tackling this subject matter, the significance of which cannot be overstated. He comically undersells his point by overcrowding this bustling motion picture with celebrity cameos, one-liners, blackouts, and other comedic devices.</p>\n                </div>\n                "]},"reco":[{"id":"554a196c-b8fb-4e35-996c-c4cf278880c4","date":"Oct 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52434788479_04e82a9daa_o.png","title":"Movie Directors Who Could Direct Marvel Studios’ Blade Reboot","tags":"movie news","excerpt":"We have a few ideas for the next Blade MCU adaptation's director, which Marvel needs."},{"id":"b09096a6-98ee-4d01-9efb-174cf2d788b4","date":"Oct 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52401112067_bb1a1c6efc_o.png","title":"Why the King Kong speech from Training Day is one of the greatest movie monologues ever","tags":"movie news","excerpt":"In Training Day's King Kong announcement, Denzel Washington improvised the key sentence, but it was crucial."},{"id":"5fd80d5c-3cf0-4561-9756-1b3dcde0256e","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365853308_682f751031_o.png","title":"List of Best Evan Peters Movies and Tv Shows That You Should Watch","tags":"movie news","excerpt":"Over the course of his acting career, Evan Peters has portrayed a wide range of roles. Here is a ranking of his top performances."},{"id":"38c66650-6d87-421f-ae1e-c703aad6d1fa","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365798648_c3c2c64775_o.png","title":"When Denzel Washington Redefined Mob Rule in American Gangster","tags":"movie news","excerpt":"Denzel Washington's performance in Ridley Scott's American Gangster is absolutely outstanding."}]},"__N_SSG":true}