{"pageProps":{"article":{"id":"ef7ea597-5bb4-41d0-a8e0-596a0ca03ee2","date":"Jul 30, 2022","author":"Brian Martin","title":"11 Great Alien Invasion Movies That You Should Watch","excerpt":"In movies, aliens from other planets typically signify invasion. Here are a few of the more effective instances of us passing out on the big screen.","keywords":"Alien Invasion movies, Alien movies","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52251188664_cd036baea8_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If you are the picky, ruin-everyone-else's-fun type of science fiction fan, the majority of alien invasion storylines present a little bit of a challenge: If you can construct spaceships capable of carrying a military force large enough to subdue a planet and transporting that force the vast interstellar distances between habitable worlds, well, you probably don't really need to invade anywhere.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many alien invasion films choose to disregard this issue, but some of them provide some very unique and fascinating solutions. Here are our top 11 favorite films about extraterrestrial invasions in light of that.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">A Quiet Place (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251403725_daaea1f4bb_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this suspenseful account of an alien invasion featuring monsters who almost entirely rely on sound to accomplish their kills, John Krasinski created a name for himself as a director. A Quiet Place, which stars Krasinski and his real-life wife Emily Blunt, combines masterful sound design to frighten viewers and delivers an emotional punch when it comes to horrific extraterrestrial encounters. Additionally, it does a fantastic job of centering its story on a close-knit family who are trying to survive the end of the world. A sequel from 2021 that was equally thrilling would come after it.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Cloverfield (2008)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52249930462_ece72e558b_o.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In the early 2000s, found footage was all the rage, but none used the method as well as Matt Reeves' action-packed Cloverfield. The story revolves around a group of partygoers who find themselves unexpectedly battling for their life when a huge extraterrestrial creature arrives and starts besieging New York. Even if the third act doesn't have the same impact as the first hour, there is still much to love.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even though its own alien invasion scenario is very different from the one in Reeves' movie, 10 Cloverfield Lane functions as a quasi-sequel if you desire a more in-depth character study set in the same world.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Edge of Tomorrow (2014)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52249930482_c935f62fc7_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This Groundhog Day-inspired thriller/comedy, starring Tom Cruise and Emily Blunt, is about Earth's last-ditch attempt to prevent an extraterrestrial invasion from eradicating civilization. When Cruise's character, a stuck-up (and even cowardly) Public Relations officer, is sent into battle, he unexpectedly has the ability to repeatedly experience the same day. He joins forces with Emily Blunt's strong sergeant to use his newly acquired abilities to figure out how to defeat their apparently unbeatable adversaries. It's both hilarious and exciting.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">War of the Worlds (2005 film)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251404005_719541f9f2_o.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's a shame that the sci-fi epic War of the Worlds entirely loses its way in the last act because so much of Steven Spielberg's film succeeds. War of the Worlds, starring Tom Cruise, Dakota Fanning, Justin Chatwin, and Tim Robbins, features some breathtaking action sequences (notably the scene in which a tripod emerges from beneath a city street and uses its lasers to vaporize a crowd of spectators) and a straightforward plot that revolves around one family's struggle for survival. While Spielberg uses footage from 9/11 to fully portray the horror of the event, Cruise is in excellent form. A nearly flawless movie with a lackluster conclusion.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Mars Attacks! (1996)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251403845_877fef7a29_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Mars Attacks! by Tim Burton is undoubtedly not for everyone, but those who get the joke will appreciate the absurd comedy for what it is – a parody of the old 1950s alien invasion films with big-name actors, awful effects, and lots of ham-fisted extravaganza. Mars Attacks!, starring a young Jack Black, Glenn Close, Annette Bening, Pierce Brosnan, Danny DeVito, Martin Short, Michael J. Fox, and Jack Nicholson (in several roles), is perhaps the film on our list with the most A-level talent. Despite the fact that Burton periodically loses control of the enormous production, there is still enough sardonic comedy, ludicrous special effects, and nods to earlier sci-fi blockbusters to keep you entertained for a few hours.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Signs (2002)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52250915898_203ef92fc6_o.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even after all these years, people are still divided about M. Night Shyamalan's epic tale of an extraterrestrial invasion. Signs, starring Mel Gibson, Joaquin Phoenix, Rory Culkin, Cherry Jones, and Abigail Breslin, goes above and beyond to add weight and significance to its rather simple concept without compromising on suspense or shocks. Overall, it's a respectably well-made thriller.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Independence Day (1996)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251403855_a698650269_o.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Independence Day, directed by Roland Emmerich, is a patriotic tour de force that generally succeeds despite a ludicrous final act that nearly falls apart under the enormous weight of its enormous production. It helps to having a personable Will Smith on standby who can provide quick one-liners and a collection of Oscar-winning visual effects that (mostly) still look good today. This 1990s blockbuster is filled with rip-roaring excitement and lots of cheese.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Men in Black (1997)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52250903371_de79acf822_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Men in Black isn't a particularly good film, but the chemistry between Will Smith and Tommy Lee Jones makes you chuckle more often than you lament the shoddy writing and formulaic plotline. The concept behind this story is original: a government organization created to find and destroy extraterrestrial life employs the fresh face on the block (Smith) to assist an experienced agent (Jones) in preventing an approaching invasion. While the finished product is a mixed bag of pleasures, Barry Sonnenfeld draws inspiration from everything from Ghostbusters to Bill and Ted's Excellent Adventure. However, the wicked duo of Smith and Jones never fails to amuse. Just stay away from the two terrible sequels.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Annihilation (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251403750_3b0c16b7ed_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Annihilation, the most difficult and artistic film on this list, doesn't really entertain as much as it instills fear in its viewers. The film's strong ensemble cast—Natalie Portman, Tessa Thompson, Jennifer Jason Leigh, and Oscar Isaac—does wonders with Alex Garland's unsettling, perplexing script, and its distinctive visuals perfectly convey the strangeness and atmosphere of the story's mysterious extraterrestrials. This movie will leave many people (including me) puzzled, but it's also a bold science fiction effort that merits a lot more praise.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The World's End (2013)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52251188519_5c4dfc5a89_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The World's End is a fun comedy with a unique idea, inventive action, and lots of heart. It isn't the greatest of Edgar Wright's Three Flavours Cornetto trilogy; that distinction belongs to Hot Fuzz. When Simon Pegg's character, Gary King, joins his buddies for a journey through Newton Haven's \"Golden Mile,\" a cluster of bars, they wind up getting more than they bargained for when the city is invaded by aliens. Without even mentioning its outstanding ensemble, which includes Nick Frost, Martin Freeman, Paddy Considine, Eddie Marsan, and Rosamund Pike, this is one of the finest alien invasion movies to have ever appeared on the big screen because to its snappy storyline and consistently vicious direction by Wright.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">District 9 (2009)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52250915953_d79a952508_b.jpg\" alt=\"Alien Invasion movies, Alien movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A new perspective on South African apartheid is provided by District 9. The narrative, which is deserving of accolades, centers on a government agent working in South Africa to assist in the removal of a scruffy extraterrestrial race from the District 9 slums. He contracts their biotechnology throughout this procedure, and as a result, his body and way of life undergo significant change. Only two \"prawn\" buddies on separate missions can aid him now that the government agency he worked for is after him. A District 9 sequel was necessary given its movie office success and four Oscar nominations, and we can't wait for the recently announced District 10!</p>\n                </div>\n                "]},"reco":[{"id":"554a196c-b8fb-4e35-996c-c4cf278880c4","date":"Oct 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52434788479_04e82a9daa_o.png","title":"Movie Directors Who Could Direct Marvel Studios’ Blade Reboot","tags":"movie news","excerpt":"We have a few ideas for the next Blade MCU adaptation's director, which Marvel needs."},{"id":"b09096a6-98ee-4d01-9efb-174cf2d788b4","date":"Oct 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52401112067_bb1a1c6efc_o.png","title":"Why the King Kong speech from Training Day is one of the greatest movie monologues ever","tags":"movie news","excerpt":"In Training Day's King Kong announcement, Denzel Washington improvised the key sentence, but it was crucial."},{"id":"5fd80d5c-3cf0-4561-9756-1b3dcde0256e","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365853308_682f751031_o.png","title":"List of Best Evan Peters Movies and Tv Shows That You Should Watch","tags":"movie news","excerpt":"Over the course of his acting career, Evan Peters has portrayed a wide range of roles. Here is a ranking of his top performances."},{"id":"38c66650-6d87-421f-ae1e-c703aad6d1fa","date":"Sep 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52365798648_c3c2c64775_o.png","title":"When Denzel Washington Redefined Mob Rule in American Gangster","tags":"movie news","excerpt":"Denzel Washington's performance in Ridley Scott's American Gangster is absolutely outstanding."}]},"__N_SSG":true}