{"pageProps":{"article":{"id":"7f9dfde0-5d4a-43f6-a1c4-b0f626ef7dab","date":"May 15, 2022","author":"Brian Martin","title":"Christopher Walken Is The Excellent Choice for a God Emperor","excerpt":"In Dune: Part Two, Christopher Walken has been cast as Padishah Emperor Shaddam IV of House Corrino!","keywords":"Dune part 2,  Dune god emperor Christopher Walken","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52074724140_d604f27001_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The newcomers to the Dune: Part Two ensemble cast have been nothing but heavy hitters: Florence Pugh as Princess Irulan; rising star Austin Butler as Feyd-Rautha (allegedly); and now the Grand Poobah of them all, Christopher Walken as Shaddam IV, head of House Corrino and Padishah Emperor of the Imperium!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The news, which comes from Deadline ahead of the film's fall start date for principal photography, fits into a universe that already has a lot of familiar faces after the first film. Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Jason Momoa, Josh Brolin, and Stellan Skarsgrd starred alongside Timothée Chalamet in that 2021 film. Even Zendaya, a Gen-Z favorite, agreed to appear for a 10-minute cameo. Nonetheless, Walken's casting in this role feels like a one-of-a-kind coup for the franchise and the growing mystique surrounding Dune in popular culture.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Long known as much for his eccentric career choices as for his talent, Walken broke into the mainstream by stealing scenes in Annie Hall (1977) as Diane Keaton's mentally unstable brother, and then winning a Best Supporting Oscar for his role as the mentally unstable Vietnam vet Nick in The Deer Hunter (1978). There's quite a selection! And he showed it again with a succession of radically disparate casting choices ranging from David Cronenberg's icy Stephen King adaption, The Dead Zone (1983), to an all-time high, scenery-chewing portrayal as a yuppie supervillain in Roger Moore's vintage James Bond film, A View to a Kill (1985).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Unfortunately, many younger moviegoers are unlikely to know about those roles, or anything else he accomplished over a career that stretched Batman Returns (1992) to The Country Bears (2002), with a cameo in Pulp Fiction (1994). Now in his eighties, Walken is perhaps best remembered to a generation for the memes spawned by his iconic hosting performances on Saturday Night Live and the crazy dance moves in that one Fatboy Slim song video from 20 years ago. So now is the ideal opportunity for Walken to remind everyone that, like in True Romance (1993), he can exude charm and terror in a single scene, which is exactly what the Padishah Emperor demands.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52074471029_7646861cb7_z.jpg\" alt=\"Dune part 2,  Dune god emperor Christopher Walken\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Shaddam IV, the emperor of the future cosmic cosmos, is a decadent and proudly strong character who received a dishonor in David Lynch's 1984 Dune film. He isn't quite as malevolent as Emperor Palpatine in Return of the Jedi, despite his title (which the Dune novel clearly inspired). Shaddam IV, on the other hand, is the culmination of countless centuries of entitled entitlement. This should be a small but hefty part for an actor to emit a specific form of bizarre malevolence, as immensely arrogant as Skarsgrd's Baron Vladimir Harkonnen is hideous. When given the correct material, few acting performances can be as bizarre as Walken's.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Princess Irulan (Pugh), the Bene Gesserit-trained royal heir to the Padishah Emperor and accomplished courtier and historian with her own purposes, will be played by Walken in the film.\nChalamet's Paul considered demanding a royal marriage with Irulan in the first Dune film to connect his house to the emperor's Corrino line. When he encounters the emperor and his daughter in person, though, he may face a new set of problems. Keep in mind that the Baron Harkonnen aspires to be as powerful as the Emperor, not least by pursuing a marriage contract with Irulan.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There's a lot of anticipation and enthusiasm for Dune: Part Two, which is the largest non-sequel of 2021 and a major cultural phenomenon despite airing concurrently on HBO Max. Fans may have a fever, and Christopher Walken's sole prescription is more bells.</p>\n                </div>\n                "]},"reco":[{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."},{"id":"752f6e9c-cfc6-413b-af02-bbae594c1c78","date":"Jul 21, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52231320065_743420415e_o.png","title":"The Reason Why Game of Thrones Spinoff Bloodmoon Was Canceled","tags":"tv news","excerpt":"The original concept for a Game of Thrones spinoff from HBO was bold and unique but maybe too much."},{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","title":"Best Korean Horror Films That You Should Watch","tags":"movie news","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category."},{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","tags":"movie news","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”"}]},"__N_SSG":true}