{"pageProps":{"article":{"id":"23ae98b0-438a-4cfb-a73a-5019c375c914","date":"May 5, 2022","author":"Alfred Bright","title":"Stephen Amell Reflects on Arrow’s Legacy","excerpt":"Would Stephen Amell ever reprise his role as Green Arrow?","keywords":"Stephen Amell Arrow, Stephen Amell Oliver Queen Arrow","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52051833833_b239ed7e3e_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The 10th anniversary of the debut of Arrow, the superhero TV series that launched one of the most important corners of superhero media history, will be celebrated in October. It is not an exaggeration to say this. Arrow lasted eight seasons and inspired over a half-dozen spinoffs, several of which are still on the air today. Years before its major competition in the shared universe sweepstakes, the MCU, even considered the potential of the multiverse, it addressed the most ambitious comic book plot of all time in real action. It also made Stephen Amell, the starring actor, a star.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Heels, a Starz drama about the ups and downs of an indie professional wrestling promotion, stars Amell. As the program was wrapping up its first season back in September 2021, the issue of Arrow came up. While we haven't officially celebrated ten years of Arrow on television, it has been ten years since Amell was cast as Oliver Queen. DC was honoring the 80th anniversary of Green Arrow.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”In the pilot episode when I threaten Adam Hunt and I tell him to transfer something to Starling City Bank…it was bank account 1141. That is November 1941, in honor of [the first comic book appearance of] Green Arrow…10 years, that’s 1/8 of the time that this character has been around. So I think of myself as a I’m an ambassador for the character. I got to wear the hat with the feather, so to speak, but not done the goatee for a short period of time, and that makes me very proud.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52050754007_1f93e5e6b1_b.jpg\" alt=\"Stephen Amell Arrow, Stephen Amell Oliver Queen Arrow\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Not only did Amell portray Oliver Queen for eight seasons of Arrow, plus a few guest appearances, but he also got to achieve something that only a few superhero actors have ever done: he got to end his character's tale. And in a suitably heroic manner, no less. The Green Arrow's narrative culminated with Crisis on Infinite Earths, and the individual who began it all turned out to be the key to preserving the multiverse.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”What means a great deal to me is we did get to control the ending. That happens so rarely. To have that conversation with Greg Berlanti during the sixth season, and to decide that seven and then a truncated version of the eighth season would wrap up the story, it’s just such a blessing, because we got to do it the right way. We got to say goodbye to people in the right way. In my opinion, the way it should end for any superhero without superpowers is in the ground. Although I think Oliver just turned into energy. So you know, never say never.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When he was asked if he could ever picture himself picking up Oliver's bow again after that “never say never” comment.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”Oh, sure. I owe so much to the people of DC, The CW, and Warner Bros. Television. I love the character so much and only love it more now that it’s coming up on two years since we wrapped the show….But having a little space now, I saw that I miss it. I do look back very, very, very fondly on it….Listen, I’m the namesake. So if I can ever be of any any help, if I can be of service to the Arrowverse in any way, shape or form, or better still take it to a new place, which I think would be the more interesting route to go, be that in a limited capacity or on a different platform, maybe one where we could show blood, that’d be really cool.”</p>\n                </div>\n                "]},"reco":[{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","tags":"movie news","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero."},{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","tags":"tv news","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."}]},"__N_SSG":true}