{"pageProps":{"article":{"id":"0fa0e184-e22e-44dd-9976-2b19011c32f3","date":"Mar 31, 2022","author":"Nick Carver","title":"Director Joe Russo Explains Why Iron Man Died In Endgame But Captain America Did Not.","excerpt":"Joe Russo, co-director of Avengers: Endgame, discusses why they chose to complete Iron Man's MCU narrative by murdering him, but not Captain America.","keywords":"mcu, endgame, marvel, iron man, captain america, steve rogers, tony stark, avengers","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51972851656_7df343fe25_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Director Joe Russo discusses why Iron Man (Robert Downey Jr.) was chosen over Captain America to die in Avengers: Endgame (Chris Evans). Joe and his brother Anthony first appeared in the MCU in Phase 2 with Captain America: The Winter Soldier, a political thriller. Following the success of their second Marvel Studios collaboration, Captain America: Civil War, the duo was tapped to bring the Infinity Saga to a close with Avengers: Infinity War and Avengers: Endgame, which was no easy task. Fortunately, their efforts were rewarded, as both films were critical and commercial hits.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Apart from appropriately introducing Thanos (Josh Brolin) and subsequently concluding Marvel Studios' decade-long story, the Russos were also faced with figuring out how to send some of the MCU's founding heroes farewell. Tony Stark and Steve Rogers, the Avengers' co-leaders, were among them. The characters are now both departed from the franchise, despite the fact that their individual stories in Avengers: Endgame ended differently. To slay the Mad Titan, Iron Man sacrificed his life. Captain America, meanwhile, was given a second chance at life when he traveled back in time to meet Peggy Carter (Hayley Atwell) in the 1940s.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When asked how the Russos, along with writers Christopher Markus and Stephen McFeely, came to this conclusion, Joe explained that it all comes down to what they believe would be a more interesting story. The filmmaker stated to Deadline why Tony's death was more powerful than the idea of Steve's sacrifice when launching a new film festival named Sands International Film Festival of St. Andrews.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”If you think of Captain America as a character, you go 'Okay, Captain America dying is fairly obvious,' right? That is, you know, something he would do based on the character. You know, this is a guy who, you know, offered to be a guinea pig in a science experiment. He's intrinsically a hero. Like there's not a lot of complexity there. It might be emotionally impactful because you like him. You know he's a very likable character, but that's not necessarily the most compelling arc. Tony Stark is a character who was supposed to die. If you watch Iron Man, the first five minutes of that film, he should have died, but he didn't, he got captured and he has an ego, right? And that first movie's about the subjugation of his ego in order for him to be a hero. But that ego then fuels him, and at times it competes with this idea of him being a hero. That seems like a more interesting arc to us to take a character who had an ego because to die for others, you have to defeat the rights of that. It seemed like the more compelling arc to us that it would be Stark who died. So that it would be a richer more complex arc, and that's why we chose him.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://cdn.images.express.co.uk/img/dynamic/36/590x/Tony-Stark-Avengers-Endgame-death-scene-1227917.webp?r=1578950073653\" alt=\"mcu, endgame, marvel, iron man, captain america, steve rogers, tony stark, avengers\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fans have questioned Marvel Studios' decisions in both Avengers: Infinity War and Avengers: Endgame over the years. Even though it neatly wraps up Iron Man's story given that he began as a self-centered industrialist who couldn't be bothered by other people's issues, not everyone is a fan of his death. While his death was terrible, especially because he left behind his wife Pepper Potts (Gwyneth Paltrow) and their little daughter Morgan (Lexi Rabe), his sacrifice serves his personal arc in the long run. What will happen to Captain America in the end? The details of his ending are still a mystery to fans. Marvel Studios has avoided answering the questions for a long time, and it's uncertain if they'll ever reveal what happened to him at the end of the film. For the time being, Sam Wilson (Anthony Mackie) is the franchise's official Star-Spangled Avenger.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As Marvel Studios continues to develop Phase 4 and beyond, the MCU is moving away from the Infinity Saga. The franchise is still a long way from another concluding endeavor like Avengers: Endgame. In fact, it's possible it'll never be as daring and reckless as it was. Fans will always have a sweet spot for the original six Avengers, particularly Iron Man and Captain America, even as the series grows enormously with new characters.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}