{"pageProps":{"article":{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","title":"Best Barry Keoghan Movies That You Should Watch","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’","keywords":"Barry Keoghan movies, eternals Barry Keoghan","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's no minor feat to play the Clown Prince of Crime, despite being the third actor to do so in the last six years. Indeed, practically the whole online conversation following the release of The Batman last month was about the appearance in which Barry Keoghan appeared out of nowhere as an anonymous Arkham Asylum inmate, wearing extensive prosthetics. Someone who is unmistakably the Joker.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With his severely damaged face scars and green hair, he's a far cry from either Joaquin Phoenix's Oscar-winning Mistah J or Jared Leto's Suicide Squad character. He even bears no resemblance to the last Joker to make a prominent appearance in a Batman film, Heath Ledger. But it's obviously the Joker consoling Paul Dano's Riddler when his plot goes awry, and it's unmistakably Barry Keoghan giving the role a very Barry Keoghan-like twist. Something that became even more clear once Warner Bros. and director Matt Reeves published a second, deleted scene in which Keoghan's Joker confronts Robert Pattinson's Batman for the first time.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Keoghan has a long history of portraying oddballs and outcasts, and you've undoubtedly seen him in more than one film.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Killing of a Sacred Deer (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52029991117_12ebb00f7b_k.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Killing of a Sacred Deer, directed by Yorgos Lanthimos, is one of the most nerve-wracking films in recent memory. The story follows Steven Murphy (Colin Farrell), a brilliant professional surgeon who regrets his inability to save a family earlier in his career. Martin Lang (Keoghan), a small kid whom Steven had taken under his wing, was the family's solitary survivor. Anna (Nicole Kidman), Steven's wife, decides to ask Martin to join their family activities.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Martin begins to express amorous interest in Steven's daughter Kim, which makes Steven suspicious (Raffey Cassidy). Martin increasingly upsets the family relationships, integrating himself into their household under the pretence of coping with sorrow, which Keoghan finds disconcerting. Martin isn't your normal villain, as Lanthimos teases out his motives without explicitly informing the spectator. It demonstrated Keoghan's ability to work with complex material.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Dunkirk (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031068858_aee025864c_b.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In Christopher Nolan's World War II epic, Dunkirk, Keoghan portrays \"George\" in a really courageous and youthful role. George is the charming youngster who sails across the English Channel with his friend Peter (Tom Glynn-Carney) and his father Mr. Dawson (Mark Rylance) in the largest (and most desperate) naval evacuation in history. Hundreds of thousands of civilian boats and vessels came to the marine rescue of British forces stuck in France following the fall of Paris during this event.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Calm with Horses (2019)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031034291_c9bedd7c79.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Former boxer Douglas \"Arm\" Armstrong (Cosmo Jarvis) is engaged as an enforcer for an insidious criminal family in rural Ireland, divided between his loyalty to them and his desire to be a good father to his autistic child in Nick Rowland's directorial debut. Dymphna is a violent, spiky livewire who manipulates Arm, bouncing between camaraderie and using him like his own attack dog. Keoghan portrays Dymphna. Despite his little stature in contrast to Jarvis, Keoghan is terrifying. In an outstanding but stressful film about an eventual plunge into hell, he is charming but deadly.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">American Animals (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031285004_c64cedfbe0_b.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>American Animals is a unique heist thriller in that it focuses more on the anxiety that criminals experience both before and after their crimes than on the actual theft. The film is an intriguing blend of Hollywood dramatization and true-crime documentary, combining genuine interviews with recreations starring actors. Director Bart Layton makes it clear that not everything on screen is totally truthful, since the four individuals convicted of the major crime have conflicting narratives of what happened.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">'71 (2014)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031068963_f7d1d6184c_k.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>'71 is another tense thriller set in Keoghan's homeland, and it tells the narrative of one of the most contentious episodes in Irish history. Yann Demange's directorial debut is centered on the 1970s Belfast riots, and how anti-authoritarian emotions turned into all-out violence between police and local citizens. The tale is fabricated, although it is based on true historical accounts. As Gary Hook, a young British soldier who has been separated from his company, Jack O'Connell gives a standout performance.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Green Knight (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031068748_937b369912_k.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Another creeper from the Keoghan collection. In David Lowery's twisted Arthurian tale, the actor's unidentified \"Scavenger\" is a minor character, one of many that Dev Patel's psychologically broken Gawain meets on his apparently fatal mission to find the Green Knight's chapel. However, Keoghan's brief appearance in the film serves as the hero's first true test of character. When the man-who-would-be King Arthur's heir meets Keoghan in the aftermath of a battle, the rich nephew of a king puts on the airs of a knight, but is so uncharitable to the young serf who directs him that he has to be shamed into offering him recompense after allegedly losing a brother in the battle.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Eternals (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52031284964_5ab06c6bda_b.jpg\" alt=\"Barry Keoghan movies, eternals Barry Keoghan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Eternals is one of the Marvel Cinematic Universe's most ambitious ventures to date, but it's also one of the most contentious. While some viewers praised Chloe Zhao's integration of the godlike protagonists' mythology with global history, others found the picture emotionally bland and inert. Regardless of one's feelings on the picture as a whole, it's difficult to argue that Eternals wastes the skills of its stellar ensemble. Druig, played by Keoghan, has the ability to affect people' perceptions and read their thoughts, making him one of the most interesting characters in the film.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if the film's reviewers mostly focused on its lack of momentum, Druig's point of view is one that even the film's detractors may admire. He's become estranged from the rest of the crew, disapproving of their passivity and failure to prevent human misery. While he may appear emotionally detached, Keoghan demonstrates that Druig's displeasure stems entirely from his empathy. He feels powerless to prevent mankind from making the same mistakes it has made in the past.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}