{"pageProps":{"article":{"id":"c8d944af-1b0d-4791-9664-7109dd706711","date":"Mar 23, 2022","author":"Nick Carver","title":"'Drive My Car,' an Oscar-nominated film by Ryusuke Hamaguchi, has been added to the Criterion Collection","excerpt":"'Drive My Car' is the first Japanese film to receive an Oscar nomination for Best Picture.","keywords":"oscar, drive my car, criterion collection","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51956197919_10291798e9_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Drive My Car, a three-hour drama directed by Ryusuke Hamaguchi, will be added to the Criterion Collection. The film has four nominations going into Oscar weekend, including Best Picture and Best Director, as well as Best International Feature and Best Adapted Screenplay.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Drive My Car is based on a Haruki Murakami short tale about a bereaved stage actor and director who accepts an offer to helm an Uncle Vanya adaption in Hiroshima. He befriends a young woman who is assigned to chauffeur him in his beloved red Saab 900, and as a result, he heals old wounds and adjusts to his new reality.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/5cdc3a65-6dd2-45b1-bacd-81f8e31ae731'>The Oscar-nominated Director Of Drive My Car Doesn't Know How To Drive</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Criterion Collection has been publishing important classic and contemporary films \"in editions that offer the highest technical quality and award-winning, original supplement\" since 1984. At a time when many in the film community see the death of physical media as an alarming reality, the Criterion Collection continues to honor the best in international cinema with beautifully crafted physical editions.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Drive My Car, on the other hand, is unquestionably a modern classic. At the Gotham Awards, the Golden Globes, the Independent Spirit Awards, the Critics Choice Awards, and the BAFTAs, the film was nominated for Best International Film. Since Hiroshi Teshigahara in 1965 and Akira Kurosawa in 1985, it is the first Japanese film to be nominated for Best Picture, while Hamaguchi is the third Japanese director to be nominated for Best Director. It was also the first non-English language picture to win Best Picture from each of the three major American critics organizations (LAFCA, NYFCC, NSFC).</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51955902876_70fb1c2b9e_b.jpg\" alt=\"oscar, drive my car, criterion collection\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The official summary for the film can be found below:</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Two years after his wife’s unexpected death, Yusuke Kafuku (Hidetoshi Nishijima), a renowned stage actor and director, receives an offer to direct a production of Uncle Vanya at a theater festival in Hiroshima. There, he meets Misaki Watari (Toko Miura), a taciturn young woman assigned by the festival to chauffeur him in his beloved red Saab 900. As the production’s premiere approaches, tensions mount amongst the cast and crew, not least between Yusuke and Koshi Takatsuki, a handsome TV star who shares an unwelcome connection to Yusuke’s late wife. Forced to confront painful truths raised from his past, Yusuke begins - with the help of his driver – to face the haunting mysteries his wife left behind. Adapted from Haruki Murakami’s short story, Ryusuke Hamaguchi’s Drive My Car is a haunting road movie traveling a path of love, loss, acceptance, and peace.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Drive My Car, which stars Hidetoshi Nishijima, Toko Miura, Masaki Okada, and Reika Kirishima, opened at the Cannes Film Festival last year and won three awards, including Best Screenplay. Janus Films gave it a very limited theatrical distribution in New York City theaters in November, and it will be accessible to stream on MUBI in April in certain international countries.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}