{"pageProps":{"article":{"id":"d025cf6d-6367-4c10-ab6b-86af2aadca85","date":"May 12, 2022","author":"Brian Martin","title":"The Director of Terminator: Salvation Reflects on the Film's Failure","excerpt":"Director McG believes he knows why the 2009 picture is frequently ranked at the bottom of Terminator rankings.","keywords":"terminator salvation, terminator, john connor","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52067827583_cf2c8a5ff2_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When Terminator: Salvation was released in 2009, it had so much potential. Rather of continuing the tale of the T-800 or reversing the grim ending of Terminator 3: Rise of the Machines, Salvation introduced a fresh plot that finally gave us the heroic John Connor that had been promised since the first film in 1984. Salvation seemed to be the rare prequel that could effectively stand alongside the later films, with writing support from Jonathan Nolan and starring Christian Bale, both of whom had just made the mega-hit The Dark Knight, and co-starring Anton Yelchin as Kyle Reese, with then-up-and-coming Sam Worthington as cyborg Marcus Wright.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>What went wrong, then? While Bale may claim it has something to do with a lighting mishap caused by a production worker, Salvation director McG recently shared his opinions. McG told The Hollywood Reporter, \"We got so close to nailing that thing right. I got a lot right in that movie but didn’t quite stick the landing.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Connor is terminally wounded in a resistance strike that destroys Skynet's supply of weaponry, including the newly-designed T-800s, in the ending that they didn't keep to. Despite the resistance's suspicions, Wright sacrifices himself to save Connor's life, allowing them to continue their struggle. McG claims that if he could go back in time, he would have \"stuck with the dark ending that we photographed that got cut.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52068046004_e0f26d6289_b.jpg\" alt=\"terminator salvation, terminator, john connor\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Hollywood Reporter does not have access to the director's intended finale, although he has already stated it. McG discussed an alternate ending with EW in 2009, in which Connor dies and Marcus' sacrifice is handled differently. \"Marcus gives his physical body, so Connor's exterior is placed on top of his machine body.\" When the heroes subsequently see this version of Marcus, they mistake him for John Connor. \"Connor stands up and suddenly there's a brief flicker of red in his eyes and he shoots Kate, he shoots Kyle, he shoots everybody in the room,\" says a character at the end of the film.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While that conclusion differs from the one on screen, it's difficult to determine whether it would have enhanced Salvation's response. After all, similar narrative lines appeared in the films that followed, and they weren't exactly well-received. John Connor becomes the most sophisticated Terminator, the T-3000, in 2015's Terminator: Genisys, and a T-800 eventually completes its goal and kills young John Connor in front of his mother, Sarah, in 2019's Terminator: Dark Fate.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>But arguably the most important conclusion from these earlier flicks is that nothing in the Terminator universe is ever definitive. Despite devastating events that appear to herald the end of cherished characters, successive Terminator films find fresh ways to explore the franchise's fluid narrative, allowing viewers to endlessly revisit the man-machine conflict.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite these facts, McG is dissatisfied with the film's reception. \"I tried, Terminator faithful, I tried,\" he promises The Hollywood Reporter.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}