{"pageProps":{"article":{"id":"d3f3a202-4f55-4b37-b4c7-18311b645ee7","date":"Apr 12, 2022","author":"Nick Carver","title":"Karen Gillan Shares Her Funniest Avengers: Endgame Regret","excerpt":"Karen Gillan admits her one humorous Avengers: Endgame regret: she didn't take advantage of the opportunity to plug her other significant property.","keywords":"mcu, marvel, avengers endgame, guardians of the galaxy, Karen Gillan, nebula","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52000225410_b129da30c7_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Karen Gillan admits her one humorous Avengers: Endgame regret: she didn't take advantage of the opportunity to plug her other significant franchise. Thanos appears to have succeeded in wiping off half of the galaxy's inhabitants with the use of the Infinity Stones in the 2019 superhero epic, which served as the climax of the first three stages of the Marvel Cinematic Universe and the finale of The Infinity Saga. The Avengers' remaining members must get together and craft a time-traveling strategy in the hopes of undoing Thanos' destructive acts and rescuing the Earth once more.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Gillan, Gwyneth Paltrow, Bradley Cooper, and Josh Brolin all made cameo appearances in Avengers: Endgame. The film, directed by MCU veterans Anthony and Joe Russo and based on a script by Christopher Markus and Stephen McFeely, was a huge hit upon its release, with critics praising it for its emotional weight, action sequences, and performances from its cast, and grossing over $2.798 billion worldwide, breaking multiple box office records. Despite the fact that Avengers: Endgame was acclaimed for continuing and concluding several character storylines, one celebrity wishes the film had gone in a different direction.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>One fan recently turned to Twitter to express their dissatisfaction that Karen Gillan did not use a critical scene in Avengers: Endgame to mention Doctor Who. The actress reacted by saying that her failure to think about the show while filming the sequence \"haunts me,\" accompanied with a laughing emoji.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Honestly the fact I didn’t think of that while filming the scene haunts me 🤣 <a href=\"https://t.co/VwdTOU0Ggp\">https://t.co/VwdTOU0Ggp</a></p>— Karen Gillan (@karengillan) <a href=\"https://twitter.com/karengillan/status/1512811375474708483?ref_src=twsrc^tfw\">April 9, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gillan was best recognized for her role as Doctor Who companion Amy Pond a few years before breaking out in Hollywood as Nebula in James Gunn's Guardians of the Galaxy flicks. She first appeared as the character in season 5 of the long-running science fiction series, working alongside Matt Smith's celebrated Eleventh Doctor, before departing in season 7 and returning for the 2013 Christmas special \"The Time of the Doctor\" to play a role in Smith's departure from the franchise. The Avengers: Endgame sequence Gillan refers to in her humorous regret shows the crew debating different time travel methods and pointing to other media featuring time travel, which could've featured Doctor Who's TARDIS had Gillan been quicker on the gun.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Karen Gillan has regularly spoken out about her satisfaction working on Avengers: Endgame, in which she got to improvise the opening scene with Robert Downey Jr., however she may regret not slipping in a Doctor Who allusion for the picture. The actress has also stated her enthusiasm for the MCU's future, expressing her want to see the character rebuild her life following Thanos' death in Guardians of the Galaxy Vol. 2. 3 and to continue playing Nebula beyond the conclusion of Gunn's trilogy. While fans wait for her return to theaters in May 2023, they can watch Avengers: Endgame on Disney+ to relive her epic struggle with Thanos and a prior version of herself.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}