{"pageProps":{"article":{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium.","keywords":"james gunn, peacemaker, dc, dcu","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A videotape of the Peacemaker introduction dance routine being replicated for a high school talent event has prompted director James Gunn to respond. The series, which stars John Cena as the titular hero/antihero, is a direct spinoff from James Gunn's The Suicide Group, and follows the vicious mercenary as he is recruited by Amanda Waller's A.R.G.U.S. to join another black ops squad. They've been tasked with dealing with an extraterrestrial menace in the shape of parasitic butterfly-like organisms who've taken up residence in human bodies.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn established the tone for his series with an exhilarating, choreographed introduction dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" Gunn set the tone for his series with an exhilarating, choreographed introductory dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" \"No kidding, we shot the actual opening in a school auditorium not so different from that,\" Gunn said to a tweet showing the sequence being reproduced for a high-school talent competition.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No kidding, we shot the actual opening in a school auditorium not so different from that. <a href=\"https://twitter.com/hashtag/Peacemaker?src=hash&amp;ref_src=twsrc^tfw\">#Peacemaker</a> <a href=\"https://t.co/S9IsLv8ReU\">https://t.co/S9IsLv8ReU</a></p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1507732545470971905?ref_src=twsrc^tfw\">March 26, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker has already been renewed for a second season, so fans will be interested to see what happens with the beginning dance sequence as fresh episodes air. Given that several of the characters from the original scene are no longer alive, such as Annie Chang's Detective Sophie Song and Robert Patrick's Auggie Smith, the sequence is likely to be re-choreographed and re-filmed. The launch date for Peacemaker season 2 has yet to be revealed, so fans may have to wait a while to watch more of John Cena's dance moves.</p>\n                </div>\n                "]},"reco":[{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","title":"Why Is The Wire Still Relevant After 14 Years?","tags":"tv news","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later."},{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."}]},"__N_SSG":true}