{"pageProps":{"article":{"id":"9d75b092-f0ca-4e19-bcac-d69396ebc31e","date":"Mar 31, 2022","author":"Kohei Watanabe","title":"What Was Muzan's Motive for Killing Tanjiro's Family?","excerpt":"In Demon Slayer, Muzan Kibutsuji has done numerous horrific things, but his murder of Tanjiro's family is one of the most enigmatic.","keywords":"anime, demon slayer, muzan, tanjiro","tags":"anime news","thumbnail":"https://live.staticflickr.com/65535/51972942433_27efeb7344_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Demon Slayer: Kimetsu no Yaiba began like any good story should: with the gruesome massacre of an entire family, largely made up of children. When Tanjiro Kamado returned home to discover the majority of his family dead and his sister Nezuko transformed into a demon, he made it his life's quest to find the demon who had converted them all into demons. After joining the Demon Slayer Corps, Tanjiro ran across Muzan Kibutsuji when touring the city of Asakusa a few years later. Tanjiro was there when Muzan's scent verified that he was the demon who had massacred the Kamado family. But why did the Original, Progenitor, and King of Demons choose to slaughter a random mountain family?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that Muzan Kibutsuji is a terrible demon who has lived 1,000 years and slaughtered thousands of people, he has a rather sympathetic motivation: he doesn't want to die. Muzan was dying of disease when a doctor in Japan's Heian era utilized the enigmatic Blue Spider Lily to transform him into the world's first demon. Muzan immediately realized, however, that despite his great abilities, he would perish if exposed to sunlight. Muzan found having to stay indoors during the day humiliating, and he spent the rest of his long life trying to figure out how to become the perfect being impervious to death.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://cdn.realsport101.com/images/ncavvykf/epicstream/6935308ce55fdae9d0c18925bb14e98f6e9bc117-1992x1188.png?rect=0,33,1992,1121&w=700&h=394&dpr=2\" alt=\"anime, demon slayer, muzan, tanjiro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Muzan's greatest dread, aside from the sun, is Sun-Breathing, the first and most powerful Breathing Style utilized by Demon Slayers to combat demons. Muzan has been physically and psychologically wounded since Yoriichi Tsugikuni, the first swordsman to use Breathing Styles, nearly murdered him with Sun-Breathing. Muzan went to tremendous efforts to exterminate Sun-Breathing. Muzan and his most powerful demon journeyed around Japan with Kokushibo, Upper-Rank One of the Twelve Kizuki and Yoriichi's brother, slaying anybody who had even heard of Sun-Breathing. The only individuals they missed were Muzan's ancestors, the Kamados, who Muzan would slay at the start of Demon Slayer.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_binance__Z4f5r\">\n                <a class='ArticleBody_adsContainer__6XXMm' href='https://accounts.binance.com/en/register?ref=63184390' target='_blank'>\n                <img class='ArticleBody_adsImage__Rp6rW' src='https://pbs.twimg.com/media/FOl1uhuXoAE352F.jpg:large' />\n                </a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fans speculated for a time that Muzan killed the Kamados because he'd discovered they were passing down Sun-Breathing as the Hinokami Kagura. Tanjuro Kamado, Tanjiro's and Nezuko's father, had already passed away, which was fortunate for Muzan because Tanjuro was a great master of the Hinokami Kagura. However, in the manga's final arc, \"Sunrise Countdown,\" a flashback from Nezuko's point of view about the attack showed that Muzan's purpose for massacring the Kamado family was unconnected to Sun-Breathing and ultimately a successful stratagem.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://chasinganime.com/wp-content/uploads/2020/05/nezuko_ch196_pt2.png\" alt=\"anime, demon slayer, muzan, tanjiro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Muzan Kibutsuji despises demons because he is the one who made them all. Muzan's only motivation for continuing to create demons, despite his objections, was the hope that one of them would gain the capacity to endure sunlight. Muzan injected each of the Kamado family members with a big dosage of his blood, anticipating that the sheer power they'd receive from him would result in the birth of a demon capable of walking in the sun. Nezuko was the only one who survived the amount of blood Muzan gave them, and she did survive getting caught in the sun's death rays at the end of the manga's \"Swordsmith Village\" arc.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Muzan's choice of the Kamados was never explained in the Demon Slayer manga, thus it's possible that the eradication of Sun-Breathing was a two-birds-one-stone situation. Perhaps he figured no one would notice if the Kamados vanished, given his inclination for keeping a low profile in the first place. Muzan could earn the ability to endure exposure to the sun by producing a demon that could do so, and then consuming that demon. Muzan's experiment on Nezuko went exactly as planned, but he made the mistake of messing with the wrong family, as Tanjiro's joining the Demon Slayer Corps ultimately led to Muzan's defeat and death.</p>\n                </div>\n                "]},"reco":[{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","tags":"movie news","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”"},{"id":"752f193e-a990-4687-80d9-2b09f15e536b","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217253121_c911bcc830_o.png","title":"David Fincher’s Zodiac: 15 Years Later","tags":"movie news","excerpt":"Why the Zodiac Killer is still a ghostly presence in our lives years after David Fincher's masterpiece."},{"id":"f604210e-6a8c-4508-9669-4745d39bf7c0","date":"Jul 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52212039877_a813967c89_o.png","title":"How the Marvel Cinematic Universe was influenced by The Dark Knight","tags":"movie news","excerpt":"Although The Dark Knight is often regarded as the pinnacle of superhero movies, did it really have an influence on the more well-known Marvel Cinematic Universe?"},{"id":"52fb1f69-c802-4d2b-b1ef-6d650023ddd4","date":"Jul 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52211207270_90e58bd2f3_o.png","title":"Moon Knight Season 2: What To Expect","tags":"tv news","excerpt":"Although the MCU series' second season has not yet been announced, creator Jeremy Slater has ambitious intentions if Moon Knight is given a second chance."}]},"__N_SSG":true}