{"pageProps":{"article":{"id":"d01af9b7-84fe-4724-94b5-cfeacf781686","date":"Mar 28, 2022","author":"Wallace Bell","title":"Oscar Isaac Compares Joining The Marvel Cinematic Universe As Moon Knight To Star Wars And Dune","excerpt":"Oscar Isaac compares working on Star Wars and last year's Dune to joining the Marvel Cinematic Universe as Steven Grant in Moon Knight.","keywords":"mcu, oscar isaac, disney, dune , star wars, marvel, moon knight","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966817133_c39a87085b_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Oscar Isaac compares appearing in the Star Wars trilogy and Denis Villeneuve's Dune to entering the Marvel Cinematic Universe in Moon Knight. Following critically lauded roles in films such as the Coen brothers' Inside Llewyn Davis (2013) and A Most Violent Year (2014), Isaac starred as Poe Dameron in the Star Wars sequel trilogy, which began with Star Wars: The Force Awakens (2015). He's been in some of the most high-profile films in recent memory, including Denis Villeneuve's Dune adaption (2021).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There aren't many franchises as massive as the Marvel Cinematic Universe these days. The MCU is still going strong, with new movies and TV episodes being added all the time. Marvel is taking advantage of Disney+'s opportunity to experiment with various tones and genres. Early Moon Knight reviews commended the show for being a unique debut in the MCU, laying the groundwork for something new for viewers. Isaac contrasts his MCU debut to his prior high-profile endeavors as he prepares to make his MCU debut.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://www.indiewire.com/wp-content/uploads/2021/11/Screen-Shot-2021-11-12-at-12.12.52-PM.png?w=780\" alt=\"mcu, oscar isaac, disney, dune , star wars, marvel, moon knight\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Isaac was asked to compare entering the Marvel universe to working on projects like Star Wars and Dune during a press conference for Moon Knight ahead of the series' premiere, which Screen Rant attended. Moon Knight, he added, provided an opportunity to accomplish something radically different by focusing on the main character's internal battle.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I think that there was just -- when I looked at it and we talked -- Grant, and Kevin, and Mohamed, as well -- it just seemed like there was a real opportunity to do something completely different, particularly in the MCU, and to really focus on this internal struggle of this character, and to use Egyptian iconography and the superhero genre and this language to talk about this real internal struggle that this person is having. And also, to create an indelible, unusual character, particularly with Steven Grant. So it felt like for me once I got a real take on how I wanted to play Steven and I brought that to everyone and they welcomed that with open arms, I also realized I had real, incredible collaborators and it was going to be a creative adventure.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Isaac has expressed interest in taking a sabbatical from both acting and tentpole franchises following his work on The Rise of Skywalker. He's also revealed that he was hesitant to join the MCU before hearing about Steven Grant's battle with DID, a condition that the show's makers took seriously enough to hire a psychiatrist to help depict mental illness in a way that avoided stereotypes. Moon Knight is certain to defy many of the genre's assumptions in this way. Hawke, Isaac's co-star, noted that Marvel Studios let the cast and crew to make errors and thoroughly explore Moon Knight's characters and story.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While it would be deceptive to describe Isaac's roles in Star Wars or Dune straightforward, Moon Knight gives him the chance to play a very complex and challenging character in a series that has the potential to transform the MCU. Moon Knight dabbles in the horror genre more than any other production before it, even ahead of Sam Raimi's Doctor Strange in the Multiverse of Madness. Early reviews have praised it as a distinct and dark series featuring brutality on par with Marvel shows that previously aired on Netflix. Moon Knight focuses on Isaac's character as a genesis story. However, it will pave the way for him and his character to make multiple appearances in the MCU in the future.</p>\n                </div>\n                "]},"reco":[{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","tags":"tv news","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more."},{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."},{"id":"932dada0-caaa-4647-9b04-9959a41d8da6","date":"Apr 18, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52013114754_bf9a552339_c.jpg","title":"Moon Knight Has Been Active In The MCU For Longer Than Spider-Man, According To Marvel","tags":"tv news","excerpt":"Marc Spector has been active in the MCU for even longer than known heroes like Spider-Man, according to a throwaway phrase in Moon Knight episode 3."}]},"__N_SSG":true}