{"pageProps":{"article":{"id":"0b1f2130-832a-414e-9277-722c96bc52a9","date":"Mar 22, 2022","author":"Nick Carver","title":"The Sequel To 'godzilla Vs. Kong' Will Begin Filming In Australia This Year","excerpt":"'Godzilla vs. Kong' was also shot in Queensland, Australia in 2021.","keywords":"monster universe, kong, godzilla","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51954465213_c3c845a0e3_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to government agency Screen Queensland, the now-confirmed sequel to Godzilla vs. Kong will shoot later this year in Queensland, Australia. According to State Premier Annastacia Palaszczuk, the film will be shot in a number of sites across the Gold Coast and the southeast.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>The production is expected to inject more than double the $36.5 million that Godzilla Vs Kong brought to the state and is a welcome boost to our economy as we recover from the impacts of the global pandemic and southeast Queensland flooding events. These types of productions benefit our screen industry, deliver local jobs and provide a welcome boost to our small businesses and communities in and around our production sites.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The plot of this new film is being kept under wraps for the time being, but it will be the fifth installment in Legendary's new MonsterVerse franchise. \"The clear starting point we teed up (in GVK ), exploring Hollow Earth, I think there is a lot more to do there. This is a pre-history of Planet Earth, where all the titans come from. We tee up some mystery in this film, things I want to see resolved and explored and pushed to the next level,\" Godzilla vs. Kong director Adam Wingard told Deadline</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://ca-times.brightspotcdn.com/dims4/default/15b041e/2147483647/strip/true/crop/3060x2040+518+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0d%2F9f%2F8ecdde804e81a4979c549d78a4c2%2Fla-photos-handouts-la-et-godzilla-vs-kong-movie-133.JPG\" alt=\"monster universe, kong, godzilla\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to Screen Queensland, the development of this Godzilla vs. Kong sequel will bring a considerable boost to the Australian economy. The film's production is estimated to generate $79.2 million ($58.6 million) in revenue for the region, as well as 505 jobs for eligible residents. Additionally, 750 local residents will have the opportunity to participate as extras in the film. The first Godzilla vs. Kong film was also shot in Australia, which helped bolster the country's economy at the time. Godzilla vs. Kong was also shot on the Gold Coast, while Godzilla: King of Monsters took place in Atlanta, Georgia.</p>\n                </div>\n                "]},"reco":[{"id":"119b2778-91fa-49b5-85ed-bb94dab1f369","date":"Apr 13, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52000704142_b5dbf6f77c_c.jpg","title":"Maisie Williams Reveals Whether She'd Consider Returning For A Game Of Thrones Spinoff","tags":"movie news","excerpt":"Maisie Williams, who played Arya Stark in the original series, discusses if she'd consider reprising her role in a potential Game of Thrones spinoff."},{"id":"d3f3a202-4f55-4b37-b4c7-18311b645ee7","date":"Apr 12, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52000225410_b129da30c7_c.jpg","title":"Karen Gillan Shares Her Funniest Avengers: Endgame Regret","tags":"movie news","excerpt":"Karen Gillan admits her one humorous Avengers: Endgame regret: she didn't take advantage of the opportunity to plug her other significant property."},{"id":"405cd1ef-56c8-494e-a132-c735b50d2f1c","date":"Apr 12, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51999579280_96c97901cf_c.jpg","title":"Moon Knight Cannot Defeat The Mandalorian In A Fight, According To Pedro Pascal","tags":"tv news","excerpt":"Pedro Pascal joins the argument between Moon Knight and The Mandalorian, which was begun by Moon Knight star Oscar Isaac, and claims that his hero will triumph."},{"id":"062db741-dc24-4805-b849-f08c8a9941db","date":"Apr 11, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/51997352443_38d85dc031_c.jpg","title":"The Reunion of Doc Ock and Maguire in Spider-Man Made Alfred Molina Cry","tags":"movie news","excerpt":"Alfred Molina, who featured with Tobey Maguire in Spider-Man 2, says that his reunion with Tobey Maguire, who he co-starred with in Spider-Man 2, made him weep."}]},"__N_SSG":true}