{"pageProps":{"article":{"id":"78514777-2903-45c3-baff-d78b1abad317","date":"Mar 21, 2022","author":"Nick Carver","title":"Actor who played Gilgamesh in the Eternals is said to be returning for a new MCU film or show.","excerpt":"Don Lee, who played Gilgamesh in the Eternals, is rumored to be reprising his role as Gilgamesh in a secret MCU Phase 4 film or series set to begin production this summer.","keywords":"marvel, mcu, eternals, gilgamesh","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51952783110_82df08fe6a_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Don Lee is rumored to be returning for a secret Marvel Cinematic Universe movie or show in Phase 4, which will supposedly involve Eternals' Gilgamesh once more. Marvel Studios is aggressively replenishing the MCU with new heroes and villains in the wake of Avengers: Endgame. Eternals, which debuted around a dozen Eternals as well as Black Knight, Blade, and Harry Styles' Starfox, was a key element of this campaign. Despite the film's negative reviews and poor box office results, several of the characters introduced in Eternals are expected to return.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>So yet, no plans for any Eternals cast members to return have been revealed by Marvel Studios. The film teases a few intriguing possibilities, such as Black Knight appearing in Blade, but nothing is certain until Eternals 2 is announced. For what it's worth, Sersi's actress, Gemma Chan, is hopeful that she'll appear in future MCU films. There are also fan-favorite characters like Makkari, Druig, and Thena that fans want to see more of. Now, it appears that one of the Eternals cast members may be returning, although in an unexpected way.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/2e221ef6-4c78-468f-a2fc-868f6d1e6c5a'>Actor Gilgamesh from The Eternals Approves of His MCU Action Figure</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lee will reprise his role as Gilgamesh in an upcoming MCU film or series, according to allkpop (via The Direct). According to reports, the actor will travel to the United States this summer to begin production on the untitled project. After Gilgamesh died protecting Thena in Eternals, Lee's return is a possibility. Until Marvel Studios, Lee, or a more trustworthy publication verifies Gilgamesh's comeback, fans should regard this as a rumor.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://www.thewrap.com/wp-content/uploads/2022/01/eternals-don-lee-angelina-jolie-936x527.jpg\" alt=\"marvel, mcu, eternals, gilgamesh\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Based on the information revealed in this rumor, it does help narrow down where Gilgamesh might return, as Lee's return to the United States to concentrate on the production this summer narrows the alternatives. Marvel Studios is ahead of schedule, with all three MCU films set to be released in 2023 currently in production or completed. Blade is set to begin filming in the summer of 2022, which suits Lee's schedule, even if it isn't a natural fit for Gilgamesh. Echo, Ironheart, Armor Wars, and Loki season 2 are among the MCU projects set to film in summer 2022, according to reports. The latter, based on its multiverse concept, might work, but filming is set to take place in the United Kingdom, not America.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There's a chance that, with no clear landing spot for Gilgamesh among the known live-action MCU projects, one is quietly on the way. There's also a tiny chance Lee will join the reshoots for Guardians of the Galaxy 3 or The Marvels, or film a Gilgamesh cameo for Thor: Love and Thunder during late-stage pick-ups. Another possibility for Gilgamesh's return to the MCU is animation, as seen in Marvel's What If...? Season 2 can now use characters from the Eternals. However, Lee would not need to travel to the United States merely to conduct voice work because that can be done remotely. Gilgamesh's MCU return is unknown at this time, however the Eternals character appears to be returning in some form.</p>\n                </div>\n                "]},"reco":[{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"},{"id":"2d2a043a-6744-4343-b320-79dc5ca864c6","date":"Aug 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52280227358_0d847987e5_o.png","title":"Movie Review: Molly’s Game","tags":"movie news","excerpt":"Molly's Game, Aaron Sorkin's first film as a filmmaker, has a lot to chew on. Here is our analysis."},{"id":"3cfede31-3851-4678-8206-57cce069bfc7","date":"Aug 11, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52278291344_a1f6726856_o.png","title":"Every Final Destination Movie, Ranked","tags":"movie news","excerpt":"The one involving the bridge or the one with the jet crash? We attempt to determine which Final Destination film is the finest."}]},"__N_SSG":true}