{"pageProps":{"article":{"id":"f527bdb6-e648-4e4f-8498-dfb1780c7ac2","date":"Apr 17, 2022","author":"Brian Martin","title":"After Guardians of the Galaxy 3, James Gunn discusses his MCU future","excerpt":"Because James Gunn is now working on various Marvel Cinematic Universe projects, he has finally addressed his post-Guardians of the Galaxy 3 plans.","keywords":"mcu, marvel, james gunn, Guardians of the Galaxy","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52010385865_cc0896e9ee_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>James Gunn is presently working on the third installment of the Guardians of the Galaxy franchise.\n3 for Marvel Studios, but the writer/director isn't sure what the future holds for him in the MCU.\nJames Gunn has been an increasingly significant character in the MCU with the release of Guardians of the Galaxy in 2014, especially when it comes to the cosmic aspect of Marvel's narrative. He rose to prominence as the face of the Guardians series and was charged with completing the trilogy's final chapter, but his plans were thwarted when Disney notoriously dismissed him over previous tweets. When James Gunn returned for Guardians of the Galaxy Vol. 3, he was greeted with open arms and he became significantly involved in the MCU's Phase 4 preparations once more.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The filmmaker has been filming Guardians of the Galaxy Vol. 3 for several months ahead of its May 2023 release date, but it's simply one of four projects in which he's a little part. Since the Guardians of the Galaxy gang will appear in Thor: Love and Thunder before the threequel, Gunn has stated that he has counseled on the film. He is also in charge of directing Disney+'s Guardians of the Galaxy Holiday Special. Gunn is also a part of the Disney+ animated series I Am Groot. It's logical to ask what the MCU's future holds for him, given the popularity of these characters and the critical accolades his MCU productions have earned.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Although Gunn's time with the MCU is certainly far from over, the issue of what else he could do after the Guardians of the Galaxy films lingers. Because Gunn is so active on social media, he's now spoken out on his future with the MCU. It all started when the filmmaker responded to a fan's question on Twitter about which Marvel superhero he'd choose if he had complete creative control.\nGunn's reaction raised fears that he was leaving the Marvel Cinematic Universe following Guardians of the Galaxy Vol. 3. However, he quickly clarified that he's only discussing where his thinking is at the moment and that he has no idea what will happen tomorrow or in the next years.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There are presently no characters at either Marvel or DC that I want to be working with right now that I am not.</p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1514998885286096897?ref_src=twsrc^tfw\">April 15, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Whatever the case, I’m currently working on a lot of projects, including a few unknown to the general public, & I’m speaking for where I am right this moment, not tomorrow or next year or five years down the line.</p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1515326648366907404?ref_src=twsrc^tfw\">April 16, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's hardly shocking to see James Gunn address his Marvel Cinematic Universe future in this way.\nHe's already stated that he has no intentions for a fourth Guardians of the Galaxy film, and that the third installment marks the end of the present edition of the crew. Gunn continued to claim that he had no idea what his future held in 2021, however he did confess that Guardians of the Galaxy Vol.\n3 was very certainly his final Marvel picture. He also noted in the same interview that he appreciates parts of DC's multiverse's originality and independence, which allowed him to create The Suicide Squad and Peacemaker. Gunn, on the other hand, appears to be undecided about whether or not he'll return to the Marvel Cinematic Universe following Guardians of the Galaxy 3.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Although it's natural that fans want to see Gunn stay in the MCU, he'll have to go at some point, and Guardians of the Galaxy 3 might be that moment. Aside from Marvel - and DC, for that matter - he's working on a number of other projects. After all, the third installment of the Guardians of the Galaxy franchise, Guardians of the Galaxy Vol. By the time Avengers 3 comes out in 2023, he'll have been a member of the MCU for more than a decade. Since James Gunn has stated that the picture also sets up the next 10-20 years of Marvel's cosmic adventures, it's likely that the film is being used to establish an exciting future for Marvel Studios that he may enjoy as a fan or as a partner.</p>\n                </div>\n                "]},"reco":[{"id":"8352dd3a-6338-4f6a-8cfe-ee0c310542af","date":"Aug 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52264573404_6fb9941d68_o.png","title":"How The Summer Blockbuster Was Reimagined By Inception","tags":"movie news","excerpt":"The best movie of the last decade was Christopher Nolan's Inception. A format-bending summer blockbuster is remembered."},{"id":"f09fcd71-ff3f-48e6-8809-48fa1b21d1dc","date":"Aug 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52259570227_3f525dfaf0_o.png","title":"Final Destination 5 Is the Best Movie in the Franchise","tags":"movie news","excerpt":"There are many personal franchise favorites among Final Destination fans, but here are the reasons why Final Destination 5 is the greatest of the bunch."},{"id":"ef7ea597-5bb4-41d0-a8e0-596a0ca03ee2","date":"Jul 30, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52251188664_cd036baea8_o.png","title":"11 Great Alien Invasion Movies That You Should Watch","tags":"movie news","excerpt":"In movies, aliens from other planets typically signify invasion. Here are a few of the more effective instances of us passing out on the big screen."},{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."}]},"__N_SSG":true}