{"pageProps":{"article":{"id":"52fb1f69-c802-4d2b-b1ef-6d650023ddd4","date":"Jul 12, 2022","author":"Brian Martin","title":"Moon Knight Season 2: What To Expect","excerpt":"Although the MCU series' second season has not yet been announced, creator Jeremy Slater has ambitious intentions if Moon Knight is given a second chance.","keywords":"Moon Knight season 2, mcu, moon knight","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52211207270_90e58bd2f3_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even Moon Knight critics have to concede that Jake Lockley was a fairly cool guy. Concerns about the series were cast aside, like a hospital wheelchair, as Marc Spector's third personality emerged as a tough guy with a newsboy cap and a Spanish accent. Sadly, Lockley only made one appearance in the series, where it was revealed that despite Khonshu's agreement with Spector and Steven Grant, Lockley was still the moon god's assassin. But if Moon Knight does receive a second season, Jake will undoubtedly appear more frequently.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”That guy’s story is definitely not done. Although he may look similar to the cabbie Jake Lockley found in the comics, the version played by Oscar Isaac “is definitely not the same,” and thus remains “an open book.” His motivations remain a mystery not just to Marc and Steven, but to the viewers as well. We don’t necessarily know, is he good? Is he evil? We know he’s working for Khonshu. We know he has some sort of arrangement. And we know he is definitely more on board with Khonshu’s worldview in terms of punishing evildoers.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/784f4e1f-f33b-4b71-b35c-2a25da817385'>Directors Who Should Direct Marvel’s Fantastic Four Movie</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The tension may lead to an intriguing new twist that would allow Khonshu to regain control over Marc and Jake. Jake's existence demonstrates that the moon god still has sway over Marc even if the triumph over Arthur Harrow and Amit seemed to change his mind about Khonshu's destructive tactics. Jake's moral uncertainty would enable the second season to go on with the themes of the first season, given the previous season's issues about virtue and evil.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even while such questions could be interesting, it's uncertain whether or not Moon Knight will receive a second season. No Disney+ MCU series has so far had more than one season. While Loki and What If...second ?'s season? are presently under production, the model appears to favor either branching out into other series, as Hawkeye does to Echo, or continuing the narratives of the program in films, as with WandaVision and Doctor Strange in the Multiverse of Madness. More significantly, Oscar Isaac deviated from the norm by only agreeing to a single season of work with Disney instead of a multi-year contract.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52210993099_b000148c6c_b.jpg\" alt=\"Moon Knight season 2, mcu, moon knight\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Having said that, Isaac said that he would be open to coming back as Marc et. if the story is accurate, everyone. If Slater is to be believed, Lockley's trip also makes for the ideal kind of narrative. Lockley is \"in the service of the greater good\" by acting as Khonshu's assassin, according to Slater, but his allegiances remain unclear. Viewers are left wondering \"is he going to be a friend? Is he an enemy?”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Slater feels that Lockley's existence necessitates additional investigation, even if he isn't the one returning to be the showrunner. He says that are \"really exciting questions for whoever takes up the reins.\" Is it interesting enough to keep fans coming back for more, as he said to Inverse, \"Whoever gets to tell the next Moon Knight story, whether that’s me or someone else, that is an exciting promise.\" Time will only tell.</p>\n                </div>\n                "]},"reco":[{"id":"f09fcd71-ff3f-48e6-8809-48fa1b21d1dc","date":"Aug 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52259570227_3f525dfaf0_o.png","title":"Final Destination 5 Is the Best Movie in the Franchise","tags":"movie news","excerpt":"There are many personal franchise favorites among Final Destination fans, but here are the reasons why Final Destination 5 is the greatest of the bunch."},{"id":"ef7ea597-5bb4-41d0-a8e0-596a0ca03ee2","date":"Jul 30, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52251188664_cd036baea8_o.png","title":"11 Great Alien Invasion Movies That You Should Watch","tags":"movie news","excerpt":"In movies, aliens from other planets typically signify invasion. Here are a few of the more effective instances of us passing out on the big screen."},{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."}]},"__N_SSG":true}