{"pageProps":{"article":{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos.","keywords":"mcu, marvel, avengers, avengers endgame, infinity war, infinity saga, josh brolin thanos","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Josh Brolin has stated that he is willing to reprise his role as Thanos in the Marvel Cinematic Universe. The actor plays the character for the majority of The Infinity Saga, culminating in Avengers: Endgame's final clash between his army and The Avengers. He can presently be found on Amazon Prime's Outer Range.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Thanos first appeared in the Marvel Cinematic Universe in a post-credits stinger for The Avengers in 2012, although Josh Brolin did not play him until 2014's Guardians of the Galaxy. He went on to become the franchise's principal bad guy, moving into the forefront with the release of Avengers: Infinity War in 2018, in which he used the Infinity Gauntlet to wipe off half of all living things. Thanos faced up against The Avengers for the final time a year later (and five years later in canon), only to be vanquished by an Infinity Gauntlet-wielding Tony Stark (Robert Downey Jr.). Thanos' transformation into dust essentially removed the Mad Titan from the canonical MCU chronology.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Thanos' narrative in the Marvel Cinematic Universe appears to have come to an end with the conclusion of The Infinity Saga. However, during a recent interview on SiriusXM's Jess Cagle Show, Brolin discussed a hypothetical comeback as The Mad Titan and stated that he would do it if Marvel asked him to.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>I don't know where they're going with it, no. It's not that I don't have an interest in it. They have their own trajectory that they're worrying about and if they want me to do it, I would do it I'm sure, but I don't know what they're thinking.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52013686322_50bc1398ea_z.jpg\" alt=\"mcu, marvel, avengers, avengers endgame, infinity war, infinity saga, josh brolin thanos\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At this time, it does not appear like Marvel has any plans to bring Thanos back in any substantial fashion. Marvel has essentially moved on to the next major enemy in Phase 4, which appears to be building towards the formal debut of Kang the Conqueror (Jonathan Majors) following his tease at the conclusion of Loki, as Brolin observed in his remarks. When you add in the fact that Brolin is engaged with other projects (like as the impending sequel to Dune), it appears that a Thanos comeback is still a long way off.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/4b4d9d1e-d36f-4d42-a371-d5be789313a8'>The Director of Avengers: Endgame Explains Why Marvel Movies Have So Much Humor</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With all of this in mind, Thanos' return to the MCU appears to be becoming more likely. Phase 4 is going all-in on the multiverse notion, which means that depending on which world is visited next, a broad range of Thanos versions might appear. In the T'Challa-focused episode of What If..., that topic was already explored by giving Thanos a more heroic and appealing persona. Furthermore, because time travel is already a well-established idea in the MCU, characters may theoretically journey back in time to meet Thanos before Tony Stark gained the upper hand and defeated him.</p>\n                </div>\n                "]},"reco":[{"id":"f09fcd71-ff3f-48e6-8809-48fa1b21d1dc","date":"Aug 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52259570227_3f525dfaf0_o.png","title":"Final Destination 5 Is the Best Movie in the Franchise","tags":"movie news","excerpt":"There are many personal franchise favorites among Final Destination fans, but here are the reasons why Final Destination 5 is the greatest of the bunch."},{"id":"ef7ea597-5bb4-41d0-a8e0-596a0ca03ee2","date":"Jul 30, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52251188664_cd036baea8_o.png","title":"11 Great Alien Invasion Movies That You Should Watch","tags":"movie news","excerpt":"In movies, aliens from other planets typically signify invasion. Here are a few of the more effective instances of us passing out on the big screen."},{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."}]},"__N_SSG":true}