{"pageProps":{"article":{"id":"da2311fe-cb3b-49e1-9810-4f0dd8d5ac56","date":"Apr 4, 2022","author":"Nick Carver","title":"All Leonardo DiCaprio Movies You Can Watch on Netflix Right Now","excerpt":"Despite the fact that Leonardo DiCaprio has been one of the biggest movie stars for two decades and has grown up in front of audiences' eyes, there is still an unfathomable element to Leo.","keywords":"netlfix, Leonardo DiCaprio","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51981257166_cb88860fc2_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With a career like DiCaprio's, there's never a bad time to revisit his filmography. What impressed us the most was the lack of sleepwalking performances. Even when DiCaprio's performance in a film isn't very strong, he never fails to give it his best, and he never chooses a role for the sake of monetary gain. Above all, an actor is defined by the choices he makes, and few performers constantly make more compelling choices than Leonardo DiCaprio.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Don't Look Up (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981790495_5c2736f859_b.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>You can see why DiCaprio would have liked Adam McKay's end-of-the-world satire on paper. Climate change, a significant issue in the picture, is a hallmark DiCaprio off-screen cause; in fact, Christian Bale received an Oscar nomination for McKay's last feature. But the pairing is a disaster, and just because it's more McKay's fault than DiCaprio's doesn't mean we don't have to look at Leo the entire time. DiCaprio's scientist character tries to be grounded in a desire to return to his calm family life, but McKay never slows down enough for him to have an arc. Instead, DiCaprio simply seems as distressed and struggling as the rest of the ensemble, even if he does manage to depart with more dignity than some of the others.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Catch Me If You Can (2002)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51980235482_c8eab80cfd_h.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Given all of DiCaprio's weighted-down-by-demons roles, it was a treat to see him play a straight-up bullshitter in an underappreciated episode in Spielberg's oeuvre. DiCaprio as Frank Abagnale, a juvenile conman so accomplished at his chosen profession that you can't help but be carried along by him, is light on his feet and plainly having the best of his life. Though the performance works best when he's having a breezy good time, DiCaprio always lets you see the scared kid beneath the surface – much of this stems from his sad-sack, brokenhearted father, played beautifully by Christopher Walken – DiCaprio smartly gives this rogue some heft, and though the performance works best when he's having a breezy good time, DiCaprio always lets you see the scared kid underneath the surface. (Tom Hanks is his perfect opposite in this regard: he's the everyman, the Frank Grimes, who can't believe this kid gets away with it all.) We'd love to see DiCaprio do something like this again: he fits in remarkably well when he lets himself go in the service of a brilliant director.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Shutter Island (2010)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981309618_bc7d915b9a_k.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Shutter Island, one of DiCaprio's most polarizing films, is an artfully unsettling picture of a guy progressively losing his shit. As U.S. marshal Teddy Daniels, who believes he's on the hunt for a missing inmate on an island for the criminally insane, DiCaprio must play his character's psychosis straight while implying the horrible truth: he's actually a patient, unable to accept the fact that his wife (Michelle Williams) murdered their children. Whether or not you enjoy Shutter Island's twist — we've argued before that it's completely irrelevant - the picture is truly about delving into the depths of agony and denial churning within this man, and DiCaprio is incandescent in that role, portraying all of Teddy's grief. Shutter Island is frequently compared to Alfred Hitchcock films, which is fitting given Leo's performance, which is comparable to that of Jimmy Stewart or Cary Grant, two previous Hollywood stars who bravely went dark while working with a master filmmaker.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Revenant (2015)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981309738_d209ced58c_b.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This is DiCaprio's Cast Away, his All Is Lost. The Revenant, directed by Oscar winner Alejandro G. Iárritu, is a violent survival story about an 1820s frontiersman who survives a Native American ambush, a bear assault, and a betrayal by one of his colleagues (Tom Hardy), who abandons him for dead. Leo's character speaks few words, but in a story this primal, words don't matter: The Revenant is easily the most physically demanding performance of his career, with the actor grunting, straining, and battling his way back to civilization across terrible terrain. His Oscar win was yet another example of a well-respected actor receiving an Academy Award because he was \"due\" rather than for doing his best work — that is to say, The Revenant is great stuff, but it lacks the brilliant range of his most indelible roles because the performance has an unrelenting jackhammer intensity. Still, this could be the film that convinces some critics that DiCaprio lacks the physicality to play tough guys.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Django Unchained (2012)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981522294_6cb308c6ac_z.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Other than Leonardo DiCaprio, has there ever been a superb actor who is noticeably worse in a Quentin Tarantino film than he normally is? As villainous plantation owner Calvin Candie, Leo is fine, but the part isn't a natural match for him. He's a more physical performer than a vocal one, and while he does his best to project menacing, he's likely the fourth most compelling actor in his final moment. (Having him spar with Christoph Waltz, who appears to have been genetically made in a lab solely to recite Quentin Tarantino language, does him no favors.) It's a flamboyant character, but perhaps a little too showy, especially given Candie's entitlement and dependence on others. We hate to say it, but DiCaprio isn't quite right for this role. Would this even make the list of Tarantino's top 25 best performances? We don't believe so.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Body of Lies (2008)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981241321_319fcc0528.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Body of Lies is a rare commercial flop for DiCaprio, and it's second-tier Ridley Scott, which means it's stylish but without substance. Leo plays a CIA assassin on the hunt for a secret terrorist boss in Iraq and Jordan. At the same time, he's dealing with a romance subplot involving a Jordanian nurse (Golshifteh Farahani), which is designed to humanize a region's tensions but, once she's taken by the bad guys, becomes a manipulative story device. Body of Lies is a boring but competent piece of studio entertainment that tries to be smart about US–Middle East ties. It's a reunion with Leo's Quick and the Dead co-star Russell Crowe, whose CIA chief leads a cushy life back home in the States. Sure, DiCaprio brings enough grit and empathy to the character, but admit it: this is the one major film on this list where you forgot he was in it.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Blood Diamond (2006)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51980235542_b78bc265b9_k.jpg\" alt=\"netlfix, Leonardo DiCaprio\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>DiCaprio doesn't do message movies well – he's too shifty – so he's an odd match for Edward Zwick in this extremely preachy and stilted drama about \"don't purchase African gems.\" DiCaprio chafes at the prospect of breaking free from the Reluctant Hero straitjacket that Zwick has placed him in. This is the kind of job Humphrey Bogart would have played 80 years ago, and DiCaprio isn't that kind of actor: he's too jittery to have that unearned but irrefutable arrogance. DiCaprio isn't the worst thing about this film – which has aged horribly, even if its message hasn't – but it is a character that appears to be outside of his comfort zone and strengths as an actor.</p>\n                </div>\n                "]},"reco":[{"id":"f09fcd71-ff3f-48e6-8809-48fa1b21d1dc","date":"Aug 3, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52259570227_3f525dfaf0_o.png","title":"Final Destination 5 Is the Best Movie in the Franchise","tags":"movie news","excerpt":"There are many personal franchise favorites among Final Destination fans, but here are the reasons why Final Destination 5 is the greatest of the bunch."},{"id":"ef7ea597-5bb4-41d0-a8e0-596a0ca03ee2","date":"Jul 30, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52251188664_cd036baea8_o.png","title":"11 Great Alien Invasion Movies That You Should Watch","tags":"movie news","excerpt":"In movies, aliens from other planets typically signify invasion. Here are a few of the more effective instances of us passing out on the big screen."},{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."}]},"__N_SSG":true}