{"pageProps":{"article":{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium.","keywords":"james gunn, peacemaker, dc, dcu","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A videotape of the Peacemaker introduction dance routine being replicated for a high school talent event has prompted director James Gunn to respond. The series, which stars John Cena as the titular hero/antihero, is a direct spinoff from James Gunn's The Suicide Group, and follows the vicious mercenary as he is recruited by Amanda Waller's A.R.G.U.S. to join another black ops squad. They've been tasked with dealing with an extraterrestrial menace in the shape of parasitic butterfly-like organisms who've taken up residence in human bodies.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn established the tone for his series with an exhilarating, choreographed introduction dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" Gunn set the tone for his series with an exhilarating, choreographed introductory dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" \"No kidding, we shot the actual opening in a school auditorium not so different from that,\" Gunn said to a tweet showing the sequence being reproduced for a high-school talent competition.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No kidding, we shot the actual opening in a school auditorium not so different from that. <a href=\"https://twitter.com/hashtag/Peacemaker?src=hash&amp;ref_src=twsrc^tfw\">#Peacemaker</a> <a href=\"https://t.co/S9IsLv8ReU\">https://t.co/S9IsLv8ReU</a></p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1507732545470971905?ref_src=twsrc^tfw\">March 26, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker has already been renewed for a second season, so fans will be interested to see what happens with the beginning dance sequence as fresh episodes air. Given that several of the characters from the original scene are no longer alive, such as Annie Chang's Detective Sophie Song and Robert Patrick's Auggie Smith, the sequence is likely to be re-choreographed and re-filmed. The launch date for Peacemaker season 2 has yet to be revealed, so fans may have to wait a while to watch more of John Cena's dance moves.</p>\n                </div>\n                "]},"reco":[{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."},{"id":"932dada0-caaa-4647-9b04-9959a41d8da6","date":"Apr 18, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52013114754_bf9a552339_c.jpg","title":"Moon Knight Has Been Active In The MCU For Longer Than Spider-Man, According To Marvel","tags":"tv news","excerpt":"Marc Spector has been active in the MCU for even longer than known heroes like Spider-Man, according to a throwaway phrase in Moon Knight episode 3."},{"id":"32c7f2e5-5bb2-4fe1-8d32-bbc900d2cfb9","date":"Apr 18, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52012406506_a8d53479c5_c.jpg","title":"The Best TV Shows That You Should Binge Watch","tags":"tv news","excerpt":"Clear your calendars because these are the finest series to binge watch."}]},"__N_SSG":true}