{"pageProps":{"articlepost":[{"id":"6d8df57f-04ce-496f-b891-06c8208020ec","date":"Apr 11, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51997038444_e1d6e422c3_c.jpg","title":"Season 4 Of Stranger Things Is Similar To Game Of Thrones, According To The Creators","tags":"tv news","excerpt":"While discussing Stranger Things season 4, the Duffer Brothers make a comparison between the Netflix series and Game of Thrones."},{"id":"4485bf95-ab7a-4e8a-ae86-18d24b4bf297","date":"Apr 6, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51986899144_f2db0f747f_c.jpg","title":"Time-Travel TV Shows That You Must Start Watching","tags":"tv news","excerpt":"Time travel is a popular subject in many forms of entertainment, from novels to movies. However, time travel has recently been a popular TV topic."},{"id":"e75ceff2-8f62-4181-a896-291aa4f97a0c","date":"Apr 5, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51983828334_bd4671a682_c.jpg","title":"7 Must-Watch K-Dramas Starring Park Seo Joon That You Can Watch On Netflix","tags":"tv news","excerpt":"Park Seo Joon has resurfaced in the public eye. While the circumstances surrounding this latest attention are not ideal, there is one silver lining: we now have a fresh collection of images of this great actor to view as we give him our best wishes."},{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","tags":"tv news","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium."},{"id":"d01af9b7-84fe-4724-94b5-cfeacf781686","date":"Mar 28, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51966817133_c39a87085b_c.jpg","title":"Oscar Isaac Compares Joining The Marvel Cinematic Universe As Moon Knight To Star Wars And Dune","tags":"tv news","excerpt":"Oscar Isaac compares working on Star Wars and last year's Dune to joining the Marvel Cinematic Universe as Steven Grant in Moon Knight."},{"id":"77b6029d-1393-4cd6-8d6e-42f72b361c09","date":"Mar 23, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51955747851_c256e4d768_o.png","title":"The Best Zombie TV Shows That You Should Start Watching","tags":"tv news","excerpt":"There are many TV shows featuring zombies, ranging from dramas to post-apocalyptic thrillers and even comedies, but these are the best ones you should start watching."},{"id":"7a18b13f-67ef-48a9-8715-35704015c3f8","date":"Mar 21, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51952077484_727e913025_o.png","title":"The Creator Of The Squid Game Reveals Plans To Bring Back Actor in Season 2 After Character Death","tags":"tv news","excerpt":"Will there be a second season of Squid Game after it became the surprise Netflix success that blasted through streaming audiences in 2021?"},{"id":"d5921ecd-40e0-4ef2-a840-cb9913c4058f","date":"Mar 21, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51950760392_6ddd24c1ba_o.png","title":"Season 2 Of Squid Game Will Have More Games, According To The Creator","tags":"tv news","excerpt":"Squid Game, Netflix's surprise blockbuster, has more lethal activities planned for its players in season 2, according to show creator Hwang Dong-hyuk."}],"page":2,"next":false,"prev":true},"__N_SSG":true}