{"pageProps":{"article":{"id":"d5921ecd-40e0-4ef2-a840-cb9913c4058f","date":"Mar 21, 2022","author":"Wallace Bell","title":"Season 2 Of Squid Game Will Have More Games, According To The Creator","excerpt":"Squid Game, Netflix's surprise blockbuster, has more lethal activities planned for its players in season 2, according to show creator Hwang Dong-hyuk.","keywords":"squid game, korean, kdrama","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51950760392_6ddd24c1ba_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Season 2 will have new games, according to Squid Game designer Hwang Dong-hyuk. The show follows 456 people who enter a competition in the hopes of winning a life-changing sum if they can survive the show's dangerous games. Squid Game's success was recently recognized at this year's award season, with the program winning three SAG awards and a Golden Globe, among other accolades.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While the popularity of Squid Game can be attributed to outstanding storytelling and world-building, the game's major draw is its unusual and horrifying assortment of tournaments. The show depicts harmless games turned deadly, turning childhood favorites like tug of war and even marbles into murderous activities, but Squid Game's most renowned game was its opening event. Red Light Green Light, one of the show's most dangerous games, required participants to halt moving when a terrifying, huge mechanical doll turned around. The doll has also become something of an unofficial Squid Game mascot, with a group of enthusiasts recently attempting to build the robot in real life.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/7a18b13f-67ef-48a9-8715-35704015c3f8'>The Creator Of The Squid Game Reveals Plans To Bring Back</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Showrunner Dong-hyuk has now revealed that he has more game ideas for Season 2, even if he isn't ready to release them just yet.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>There will be more great games, that’s all I can say. I’m just still brainstorming and collecting the ideas for Season 2. I haven’t even started with the writing yet”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://www.indiewire.com/wp-content/uploads/2021/11/DSC_9584_2021110875926760.jpg\" alt=\"squid game, korean, kdrama\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fans can expect old events to return, but new games would be a welcome addition to Squid Game's cutthroat competition. Dong-hyuk has a plethora of possibilities to make Season 2 as successful as Season 1 with such a vibrant and innovative premise. More Squid Game, on the other hand, appears to be a long way off, which isn't necessarily a bad thing because fans of the program will no doubt want Dong-hyuk to take his time bringing future seasons to life.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>After the cliffhanger finish of Season 1, Squid Game could have easily moved away from more games and taken a whole other path. Despite receiving a warning from the game's leaders, the show's star and single survivor, Seong Gi-hun, set out to end the games once and for all. With Dong-hyuk already organizing his next round of lethal games, it appears that Seong will be involved in more terrifying Squid Game competitions in the future.</p>\n                </div>\n                "]},"reco":[{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","tags":"tv news","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."},{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","title":"Best Barry Keoghan Movies That You Should Watch","tags":"movie news","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’"}]},"__N_SSG":true}