{"pageProps":{"article":{"id":"784f4e1f-f33b-4b71-b35c-2a25da817385","date":"May 9, 2022","author":"Brian Martin","title":"Directors Who Should Direct Marvel’s Fantastic Four Movie","excerpt":"Let the speculation about who will direct what may be the most crucial MCU entry begin now that Jon Watts has now swung out his role helming the upcoming Fantastic Four film.","keywords":"mcu fantastic four director, who should direct fantastic four, fantastic four director","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52060947184_3996070d0a_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Director Jon Watts has left Marvel Studios' first official Fantastic Four picture. Watts and Marvel Studios president Kevin Feige both released comments claiming that the divorce was amicable.\nWatts appears to be looking for a change of pace and content after directing three blockbuster Spider-Man movies for Marvel.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Watts' personal contribution to the Spider-Man trilogy he just concluded with Spider-Man: No Way Home is difficult to pinpoint; while all three films are fantastic (and likely the finest cinematic adaptation of the character yet), his directing style is very obvious. One might argue that he was a great Marvel \"house\" filmmaker in certain aspects, specializing in teen humor while staying true to the MCU's established models.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Marvel could be looking for someone similar for the Fantastic Four. This will be the third live-action adaptation of Marvel's First Family, and possibly the most important, since it must properly integrate the four bickering superheroes into the MCU and ideally establish them as one of the franchise's future pillars. Marvel requires a filmmaker who will work closely and constructively with Feige and the rest of the Marvel Studios team to accomplish this.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>So, who will that someone be? We've gone through several options and compiled a list of who we believe are the best contenders. For the time being, the Fantastic Four remains untitled; other from Watts' appointment as director in December 2020, no other details, such as a script or cast, have been revealed. When a new director takes over, expect that to alter.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Deborah Chow</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52060716586_78554d7b8f_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Deborah Chow is a veteran of the Disney system, having directed episodes of Marvel's Jessica Jones and Iron Fist as well as Lucasfilm's The Mandalorian. Fear the Walking Dead, Lost in Space, Better Call Saul, The Man in the High Castle, and many other TV shows are among her numerous credits.\nBut Chow's most high-profile project to date is coming out soon: Lucasfilm has chosen Chow to helm all six episodes of Obi-Wan Kenobi.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that she has only appeared in one theatrical picture (2010's The High Cost of Living), Disney and Lucasfilm have given her the whole first season of Star Wars: The Force Awakens.\nHer work appears to be marked by a concentration on character, which might be crucial to the building of a great Fantastic Four. It could be time for Chow to bring their narrative back to the big screen.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Jon Favreau</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52061202370_9da6bbea4a_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Jon Favreau, like Joss Whedon and Edgar Wright, quit Marvel following creative differences on Iron Man 2, dealing with a film that was essentially written as it was shot and being obliged to build the basis for future Marvel franchises. However, Favreau has maintained solid working relations with Marvel, appearing as Happy Hogan in Iron Man 3, Avengers: Endgame, and Watts' three Spider-Man films.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Bringing Favreau back to helm the premiere of one of Marvel's most renowned teams would surely signal its importance, despite his apparent niche as one of the key developers behind The Mandalorian and The Book of Boba Fett. If he could reproduce the fast-paced, funny approach of the first Iron Man, he could do the same for the Fantastic Four. Maybe he could let Dave Filoni run the Star Wars business on his own for a while, as he did in 2008, and assist Marvel usher in a new age.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Brad Bird</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52059671652_e16889c1d4_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Bird has been a popular choice among fans as the next director, and it's easy to see why.\nWith his critically praised picture The Incredibles, which was essentially Pixar's rendition of the Fantastic Four, he gave the superhero genre a new spin. He also directed The Iron Giant, a popular sci-fi classic, and successfully switched to live-action with Mission: Impossible Ghost Protocol.\nBird's variety and ability as an auteur might contribute to one of the MCU's most unusual and well-made flicks.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Steven Caple Jr.</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52059671212_9829530fe9_c.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Creed II, Steven Caple Jr.'s second feature picture, solidified his reputation by demonstrating that director was equal to the task of creating a believable sequel to Ryan Coogler's great Creed.\nThe Rocky franchise isn't known for having a lot of good sequels, but Creed II did an excellent job of continuing Adonis Creed's tale and even gave Dolph Lundgren a possibly career-best performance.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Caple was then given the Transformers franchise and is now working on Transformers: Rise of the Beasts in post-production. Michael Bay's five-film reign on the franchise definitely set a low standard, but if Caple can combine his character insights with stunning graphics, he may not only be able to resurrect the Transformers franchise, but he may also get a crack at directing Marvel's Fantastic Four.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Rian Johnson</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52060716326_6390360680_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite alienating a large number of Star Wars fans with his direction of The Last Jedi, the picture was critically acclaimed and lauded for taking the famous sci-fi tale in a creative new path. But, regardless of how you feel about this picture, Johnson has proven himself to be a great director with films like Looper, a popular time-traveling thriller, and Knives Out, a deconstructive whodunit.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Julia Hart</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52061202340_ded2ba63f4_z.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Julia Hart's 2018 film Fast Color features a superb character-driven narrative and excellent lead performances from Gugu Mbatha-Raw and Lorraine Toussaint, making it one of the most eccentric superhero pictures of recent vintage. She hasn't done anything else in the sci-fi or fantasy genres yet, but her upcoming crime drama I'm Your Woman demonstrated a willingness to experiment with new genres and even parody them.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fast Color is likely to be the calling card for any Marvel project, and her unique take on the genre's cliches may serve her well when it comes to deciphering the Richards/Storm/Grimm family dynamics. Even if she doesn't get the Fantastic Four, she'll be in the running for something in the MCU shortly.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">James Gunn</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52059671607_f30726ef87_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>James Gunn is the only one who knows how to direct a dysfunctional superhero family. With Guardians of the Galaxy and The Suicide Squad, he's done it before, but Gunn's raunchier, more adult-skewing impulses – but not his frequently madcap directing style – would have to be submerged for the far more benign First Family of Marvel.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn is presently working on the sequel to Guardians of the Galaxy. 3, and a second season of Peacemaker in the works, it's difficult to predict if he'd go onto another Marvel franchise straight immediately. On a personal level, he might be upset with the studio; his firing from Guardians of the Galaxy Vol. Even if 3 was finally brought back to land the plane, he may have left a sour taste in his mouth. Nonetheless, the inclusion of important characters like Adam Warlock and the High Evolutionary in the latter film ensures that he'll have a long-term effect on the MCU, and it may be too enticing for him to pass up the Fantastic Four.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">John Krasinski</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52059671492_b5e1925cfe_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As Mr. Fantastic, Krasinski has finally entered the superhero genre. However, considering his track record as a filmmaker, particularly his success with the Quiet Place films, he might become the first person to direct and act in an MCU picture. He's also got action experience in shows like Amazon's Jack Ryan and 13 Hours, which might help him helm the type of thrilling and eye-catching adventure that Marvel Studios is known for. He could offer the right combination of comedy, drama, and action to an MCU film, thanks to his tremendous comic abilities gained while portraying Jim Halpert.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Olivia Wilde</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52059671662_f3a311f8de_b.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>We were pleased with Olivia Wilde's feature directorial debut, Booksmart, in 2019, but we've just finished watching the trailer for her next film, Don't Worry, Darling, and are completely blown away.\nWilde is striving for broader, more expansive stuff as she continues to evolve as a director, and the picture clearly leans into genre — some of it reads like an updated version of The Stepford Wives.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>That may put her in a good position to be considered for Fantastic Four, but there's a catch: Wilde was set to helm an unnamed film for Sony in 2020 based on their Spider-Man-related Marvel characters world (supposedly Spider-Woman). Since then, little has been heard about the movie, and with the failure of Morbius, Sony may decide to rethink their Marvel-based films in the future.\nIf she's no longer interested in it, Marvel Studios should speak with her as soon as possible.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Matthew Vaughn</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52060716381_628cd909b3_z.jpg\" alt=\"mcu fantastic four director, who should direct fantastic four, fantastic four director\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Matthew Vaughn is no stranger to comic book films, having directed Kick-Ass, X-Men: First Class, and the Kingsman films, all of which were critically acclaimed. When he gets it right, as he did with X-Men: First Class, which is still considered one of the best films in the problematic franchise, he demonstrates that he can effectively capture the tone, style, and visual sense of the novels on which the films are based.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Vaughn also really enjoys the genre and has already expressed his wish to participate in Marvel's Fantastic Four reboot. He has a lighthearted demeanor that would go nicely with the topic. Now that the role is vacant, Feige and his team may explore bringing him in — and maybe keeping him around to help with the X-Men.</p>\n                </div>\n                "]},"reco":[{"id":"f604210e-6a8c-4508-9669-4745d39bf7c0","date":"Jul 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52212039877_a813967c89_o.png","title":"How the Marvel Cinematic Universe was influenced by The Dark Knight","tags":"movie news","excerpt":"Although The Dark Knight is often regarded as the pinnacle of superhero movies, did it really have an influence on the more well-known Marvel Cinematic Universe?"},{"id":"52fb1f69-c802-4d2b-b1ef-6d650023ddd4","date":"Jul 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52211207270_90e58bd2f3_o.png","title":"Moon Knight Season 2: What To Expect","tags":"tv news","excerpt":"Although the MCU series' second season has not yet been announced, creator Jeremy Slater has ambitious intentions if Moon Knight is given a second chance."},{"id":"dffa1745-2c6b-42a3-91a3-b07d7eb3e00e","date":"Jul 11, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52208264963_d3ca84afcb_o.png","title":"Ranking The Craziest Nicolas Cage Performances Ever","tags":"movie news","excerpt":"These performances by Nicolas Cage provide as evidence that he is a unique performer"},{"id":"e238699d-70f7-40a4-a096-a586eb6fd1e7","date":"Jul 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52201616346_be60795aaf_o.png","title":"Stranger Things: The Real-Life Inspiration Behind Eddie Munson","tags":"tv news","excerpt":"Season 4 of Stranger Things' inaccurate charge of Eddie Munson was based on a true story of Satanic fear."}]},"__N_SSG":true}