{"pageProps":{"article":{"id":"1cb21529-32f3-4d41-b3d5-baad0f19d863","date":"Mar 21, 2022","author":"Nick Carver","title":"After No Way Home, Marisa Tomei Wants To Reprise Her Role As Aunt May In The Marvel Cinematic Universe","excerpt":"Following her sad death in last year's Spider-Man: No Way Home, Marisa Tomei confesses that she would love to reprise her role as Aunt May.","keywords":"marvel, sony, Spider-Man, mcu, aunt may","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51952198698_1c5b6e5d97_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following her tragic demise in Spider-Man: No Way Home, Marisa Tomei expresses her desire to return to the MCU as Aunt May. Tomei first appeared in the Marvel Cinematic Universe in Captain America: Civil War as the newest iteration of the beloved comic book character, who becomes Peter Parker's guardian when his parents die. Since then, Tomei has reprised her role as May in all of Tom Holland's Spider-Man films, including last year's highly anticipated No Way Home.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>After a number of villains from Tobey Maguire and Andrew Garfield's Spider-Man universes, like as Alfred Molina's Doc Ock and Jamie Foxx's Electro, crossed over into the MCU timeline, Holland's Peter faced his hardest struggle yet. Willem Dafoe's Green Goblin, who killed Aunt May after an intense struggle with Parker, was the villain that caused the most pain and misery for Holland. The heartbreaking sequence included Tomei delivering a twist on the traditional Spider-Man line, \"With great power, comes great responsibility,\" and was a watershed moment in Holland's Spider-Man journey.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Now, Tomei says she'd \"love to come back\" as Aunt May in the future. During a recent appearance on The Tonight Show Starring Jimmy Fallon, Tomei admitted that she doesn't comprehend the multiverse and had to ask Spider-Man: No Way Home director Jon Watts to explain it to her numerous times. Tomei then goes on to talk about May's extensive history in the comics, as well as one of her former love interests, before affirming that, if the concept of the multiverse opens the door for her return in the future, she would be more than happy to do it.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Oh yes, there is a Multiverse. That’s true, that was part of the secrecy originally, now a lot of people know. But the thing was, if anyone asked me about it, I would have nothing - I don’t understand the Multiverse myself. Our wonderful director, Jon, and I’m like ‘And so, where am I now? Ok, well, can you explain it to me one more time?’ I would love to come back and be part of that. There’s history there, too. May Parker hooks up with Ant-Man - well, I mean, she’s a standalone character, of course, but there are more avenues to explore.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spider-man-no-way-home-aunt-may-1640100840.jpg?crop=0.806xw:1.00xh;0.157xw,0&resize=1200:*\" alt=\"marvel, sony, Spider-Man, mcu, aunt may\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Zendaya, Tomei's co-star in Spider-Man: No Way Home, recently stated that she believes Aunt May is underappreciated as a character and that she is a \"great role model\" for Peter. May is frequently depicted as a crucial component in Peter Parker's life in each Spider-Man incarnation, making her death all the more tragic given the depth of their relationship. Tomei also recently said that she told her therapist about No Way Home's finale before the film's premiere because she \"had to tell someone.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>May's death came as a shock to many viewers who had assumed her character's survival was a foregone conclusion due to her significant impact on Peter's life. Many fans are likely to agree with Tomei's sentiments and would love to see her return to the MCU in some capacity, though it's amusing to hear that if she does, she may not understand the logic behind her character's return. Given the MCU's Phase 4 multiverse plot, it's not out of the question that Tomei may return as an Aunt May variant who avoided the sad events of Spider-Man: No Way Home in the future.</p>\n                </div>\n                "]},"reco":[{"id":"6827305d-b11e-44da-9c7c-3746dc274bca","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52086874610_0c8116f5f8_c.jpg","title":"8 Best Anne Hathaway Movies That You Should Start Watching","tags":"movie news","excerpt":"Few actresses have the variety of Annie, who has appeared in everything from rom-coms to Oscar-winning musicals."},{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","tags":"movie news","excerpt":"And why one of the few films that scares him is 'The Thing.’"},{"id":"ea5bcadb-6b70-41d4-aace-29cfb3824434","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52082671695_1bbb5391a0_c.jpg","title":"Where Did 'The Godfather Part IV' Go? The Never-To-Be-Released Sequel","tags":"movie news","excerpt":"Coppola apparently had an offer he couldn't refuse."},{"id":"b94d8c73-15cf-4437-aa16-4ae8334e3208","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52081976178_3f0b96e7ac_c.jpg","title":"The Forgotten Pre-Marvel Action Film of Robert Downey Jr.","tags":"movie news","excerpt":"Interest in the United States is surging like a relic from the past. Marshals is a neglected (and substandard) sequel to Harrison Ford's masterpiece The Fugitive, released in 1998. And there's a reason for it: Robert Downey Jr.'s baby face."}]},"__N_SSG":true}