{"pageProps":{"article":{"id":"42a978da-3280-44c3-acb0-e6cff031af0c","date":"May 6, 2022","author":"Alfred Bright","title":"Why Once Upon A Time In America Is One Of The Greatest Gangster Films Ever Made","excerpt":"Sergio Leone's mob masterwork, Once Upon a Time in America, featured Robert De Niro and James Woods as criminal figures.","keywords":"Why Once Upon A Time In America is great, Once Upon A Time In America robert de niro","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52052555437_3faa74aac7_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Godfather is an excellent film, perhaps the finest ever filmed. The Godfather, Part II, is frequently compared to it in the pantheon of legendary cinema, and some reviewers say it is even better. In the early 1970s, Paramount's chief of production, Robert Evans, wanted The Godfather to be directed by an Italian American. Francis Ford Coppola was a last-ditch effort. Sergio Leone was the studio's initial option, but he was busy filming his own gangster epic, Once Upon a Time in America. It is similarly stunning, although being less well-known.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America stars Robert De Niro as David \"Noodles\" Aaronson and James Woods as Maximillian \"Max\" Bercovicz, a fantasy gangster film coupling on par with Humphrey Bogart and James Cagney in The Roaring Twenties or Angels with Dirty Faces. Noodles and Max are rivals and collaborators; one is ambitious, while the other craves the beach. One has been sentenced to prison, while the other intends to rob the Federal Reserve Bank.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When you add Joe Pesci as mafia leader Frankie Monaldi and Burt Young as his brother Joe Monaldi to the mix, life becomes \"funnier than crap,\" and funnier than their more well-known crime films, Goodfellas and Chinatown, respectively. Future mob entertainment staples may also be found in Once Upon a Time in America, and they're in good company. Jennifer Connelly, a future Oscar winner, stars in her debut film. She portrays little Deborah, the small girl who grows up to be the lady between Noodles and Max, and she even has a catchphrase: \"Go ahead Noodles, your mother is calling,\" which is delivered by Elizabeth McGovern as adult Deborah.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>People in the crowd were said to giggle when Deborah was reintroduced after a 35-year pause in the action when Once Upon a Time in America initially aired in cinemas. She hadn't changed in years. Deborah, on the other hand, is more than a character to Leone.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>She says, \"Age can wither me, Noodles.\" However, neither the character nor the filmmaker will let the spectator see past the cold cream. The character Leone is replying to is Deborah. She also represents the storytelling's shifting timeline. Its only constant is her.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, the rest of the movie might seem like a free fall. Once Upon a Time in America had time for memories, flashbacks within flashbacks, and detours that careen between the violent and the peaceful, whereas The Godfather went in a linear way. Landing where we, and this genre, originated is a visceral experience.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52053633523_7082532420_b.jpg\" alt=\"Why Once Upon A Time In America is great, Once Upon A Time In America robert de niro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Godfather and Once Upon a Time in America both span decades, depicting the history of immigrant crime in America over the twentieth century. However, they differ in terms of chronological order. Once Upon a Time is divided into three parts. The first is from 1918 in the Lower East Side of New York City's Jewish ghettos.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Young Noodles (Scott Tiler), Patrick \"Patsy\" Goldberg (Brian Bloom), Philip \"Cockeye\" Stein (Adrian Curran), and Dominic (Noah Moazezi) are members of a bush league street gang that do tiny crimes for Bugsy, a local neighborhood mug (James Russo). Max (Rusty Jacobs), a new kid on the street, stops the group as they're ready to roll a drunk, and Max takes the guy's watch for himself. He quickly joins the group, and they go on to more serious activities.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, the majority of the film takes place between De Niro's Noodles' release from jail in 1930, following Bugsy's murder, and the end of Prohibition in 1933. Max, now played by Woods, has established himself as a successful bootlegger with a sideline in the funerary industry. With William Forsythe as the grown-up Cockeye and James Hayden as Patsy, the mobsters progress from bootlegging to contract murdering, eventually enlisting the help of the country's largest trucking union as enforcers. They spend much of their free time in the speakeasy of their boyhood buddy Fat Moe (Larry Rapp). Deborah, Fat Moe's sister, is on her way to becoming a Hollywood star, and Noodles is smitten with her. The liquor delivery slaughter brings the gang's ascent to a close.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film's conclusion takes place in 1968. Noodles is discovered after 35 years in hiding and hired to work on a private contract for the United States. Secretary of Commerce Christopher Bailey... a different Max who has managed to maintain his status and make Deborah his mistress after 35 years. A person's entire existence has become a mask.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52053837889_ac0f21610f_b.jpg\" alt=\"Why Once Upon A Time In America is great, Once Upon A Time In America robert de niro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America is based on the autobiographical crime book The Hoods, while The Godfather is based on Mario Puzo's fictitious bestseller. It was written by Herschel \"Noodles\" Goldberg while incarcerated at Sing-Sing Prison under the pen name Harry Grey.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In The Godfather, Coppola's vision is artistically akin to Leone's projection. The cosmopolitan milieu of old New York crowded the frames and the participants in both films, from the opium pipes at the Chinese puppet theater to the take-out Lo Mein during execution planning. Once Upon a Time in America was filmed in Rome's Cinecittà Studios for the most part. In Manhattan's 1918 Jewish neighborhood, a street in Williamsburg, Brooklyn, was recreated precisely as it had been 60 years before.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Leone conveys the hardship of immigrant life in New York with flair and humour. The Dead End youngsters may have committed the first crime the four-member gang commits. They set fire to a newspaper stand because the proprietor refuses to pay the local mug protection money. They needle their mark and make jokes with each other, much like the Dead End youngsters. Cockey is playing the pan pipe and Dominic is dancing at the conclusion of the crime. They take pride in and love their profession. Breaking stuff for money is entertaining. And it's even better when they have the option of accepting cash or rolling the money into the safe bet of rolling a drunk.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52053602121_b526e5013a_b.jpg\" alt=\"Why Once Upon A Time In America is great, Once Upon A Time In America robert de niro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Both Leone and Coppola's films rely heavily on music. The Godfather is very much like an opera, and the third installment even ends on a high note. The film Once Upon a Time in America is set in the American frontier. Ennio Morricone scored the score, who also provided the music for Leone's films A Fistful of Dollars, For A Few Dollars More, and The Good, the Bad, and the Ugly.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Though the sequence takes place in 1968, Kate Smith's rendition of \"God Bless America\" starts and finishes the film. The song plays on the radio of a car that appears to be from another era.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Morricone's score for Once Upon a Time in America is as symbolic as Nino Rota's theme for The Godfather. Characters, locales, actions, and relationships all have recurring motifs that become as familiar as the Prohibition-era music that pervades the period piece's atmosphere. While Deborah is conversing with Noodles, Fat Moe conducts the speakeasy orchestra through José Mara Lacalle Garca's \"Amapola.\" He's a hopeless romantic.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America incorporates music throughout the plot. As waiters and cigarette girls glide past, individual couples cut their own carpets and dance the Charleston between tables. Cockeye, who has been playing the pan pipe since the start of the movie, wants to join the band.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America comes close to being stolen by Forsythe. During the pretend funeral for Prohibition, he appears to cry real tears and swallows formula from a baby bottle in the maternity ward scenario. The extortion strategy, which involves switching children, plays like a Three Stooges outtake, which Coppola would never do in The Godfather. The ploy is set to Gioachino Rossini's \"The Thieving Magpie,\" which evokes the juvenile thuggery seen in Stanley Kubrick's A Clockwork Orange.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52053837914_b8bf27f6d9_b.jpg\" alt=\"Why Once Upon A Time In America is great, Once Upon A Time In America robert de niro\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America introduces another aspect to the genre that The Godfather does not: a lingering mystery. Coppola tells brief puzzles, such as Luca Brasi's fate, that are revealed as the tale progresses. The 35-year gap between Noodles' crew's killing and Secretary Bailey's entrance is nearly unbelievable. How did Max move from long-dead to legitimately powerful man?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Without any information, it's very easy to anticipate what happens to Noodles throughout those years. He made it. When he attempted to recover the gang's shared secret money as the final surviving member, it was empty. He put his pistol aside and lived a peaceful existence. But, when the truth of Max's fate emerges, it is shockingly startling, both for the viewer and for Noodles.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This is a huge undertaking. This film bends American celluloid into European cinema, regardless of genre. Leone surpasses customary bounds simply by existing outside of Hollywood. He has a much larger palette to work with. He can spend three minutes filming De Niro's spoon in a coffee cup and never lose the audience's rapt attention. Leone has the ability to pull the rug out from under everyone with a last-minute bombshell. For The Godfather, Coppola pushed the boundaries of American cinema while staying inside set constraints. He'll never be as sweet as Charlotte Russe or as unpleasant as a limo's rear seat.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Once Upon a Time in America tore the genre apart from the inside out and showed it with uncompromising authenticity and spectacular grandeur.</p>\n                </div>\n                "]},"reco":[{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"}]},"__N_SSG":true}