{"pageProps":{"article":{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","title":"Wonder Man is about to make the MCU really weird","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery.","keywords":"MCU Wonder Man Trevor Slattery Ben Kingsley","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>MCU fans have all been wondering, \"Who even are the Avengers anymore?\" since since three of its essential members passed away or retired in Avengers: Endgame. Kevin Feige, the head of the Marvel Cinematic Universe, has been very mum about when we'll see the next cast or who's under consideration, but one stalwart of the comic book team will soon be making his way to live-action. Simon Williams, an ionic-powered superhero, stars in the Disney+ series Wonder Man, which is presently in development.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>One of Marvel's most intriguing characters, Wonder Man is mostly unknown to people who don't read comic books; he has a complicated past even by the standards of superheroes. The storylines that may be told with Wonder Man are quite diverse, but the recent announcement that Ben Kingsley would be returning as Trevor Slattery gives us a fairly decent indication of the kind of program Wonder Man is trying to be.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52334206167_24acdde58d_b.jpg\" alt=\"MCU Wonder Man Trevor Slattery Ben Kingsley\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many iconic characters had humble beginnings, but it's difficult to see how Wonder Man was ever saved from his debut in 1964's Avengers #9, written by Stan Lee and illustrated by Don Heck. In addition to starting off as a villain, Wonder Man had the most absurd goals conceivable. Williams chose to become Wonder Man by undergoing covert Baron Zemo experiments just because he detested Tony Stark. Which is understandable because many people despise Tony Stark. He is a haughty jerk!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Williams, however, didn't simply despise Stark because he lost his riches when Williams Innovations, the munitions business Simon inherited from his father, suffered as a result of Stark Industries' success. No, Williams despised Stark because after deciding to steal money from that organization, he was apprehended and imprisoned. In addition, Wonder Man wore one of the most outrageous outfits from the early Marvel era—a green and red ensemble capped with a silly-looking helmet—and soon perished in his first encounter with Earth's Mightiest Heroes. As if that type of outrageous charge weren't enough.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52335460574_2fb502abc4_b.jpg\" alt=\"MCU Wonder Man Trevor Slattery Ben Kingsley\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Wonder Man has starred in some of the finest Avengers stories over the years. In his debut appearance, Wonder Man learns from his mistakes and turns against Zemo to aid the Avengers, giving his life to rescue the group. In an effort to one day bring the hero back, Ant-Man kept Williams's brain patterns as a mark of respect for his sacrifice. Which he sort sorta does. The villain utilizes Simon Williams' preserved brain patterns to build the Vision after the evil robot Ultron goes insane and fashions his own synthetic being to resemble his inventor Hank Pym (and not Tony Stark, as in Avengers: Age of Ultron).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Second, Wonder Man resurrected and joined the team at a crucial juncture in its history. In Avengers #160, Simon Williams made a full comeback to the living world after a few false starts (1977). He and former X-Man Beast teamed up right away to establish one of the finest superhero comic book teams, introducing a buddy spirit that is still unsurpassed by other Avengers.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Last but not least, Wonder Man has an odd yet fascinating past. Every few of years, Wondie alters his appearance, ability set, and even attitude due to the erratic nature of his ion-energy-based abilities. A further source of conflict for Wonder Man is his relationship with his brother Eric, a villain known as the Grim Reaper. When Simon begins to develop feelings for the Scarlet Witch, he begins to view Vision alternately as a brother and a competition. In summary, Wonder Man is perhaps Marvel's hottest and messiest hero, and just having him around may spark some scrumptious conflict.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52335160306_1efa43baec_b.jpg\" alt=\"MCU Wonder Man Trevor Slattery Ben Kingsley\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>No, not quite. The original Human Torch, an android from World War II who predates the Fantastic Four member, served as the inspiration for Ultron's design of the Vision's physique. The fact that Wondie and Vision share memories and mental processes, however, implies that the two occasionally collaborate and occasionally disagree.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite all of this, it doesn't seem plausible that the MCU will leverage any of those connections. Although Ultron created both versions of Vision and they both produce magical chaos offspring with the Scarlet Witch, that is the extent of their similarity. In the Marvel Cinematic Universe, Ultron imitates his quick-witted inventor Tony Stark and makes Vision out of experimental synthetic flesh while excluding Wondie and the original Human Torch. In addition, Kingsley's choice for the role of Trevor Slattery in the MCU hints that Wonder Man won't initially hang around with the Avengers for long stretches of time.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52335460524_a0d0858b01_o.jpg\" alt=\"MCU Wonder Man Trevor Slattery Ben Kingsley\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Grim Reaper is Wonder Man's primary adversary because they are siblings and Trevor is regretfully not seen in the comics. The fact that Trevor is back on screen suggests that the Disney+ series will draw inspiration from one of Wondie's most distinctive versions. Simon Williams has worked as a model, stuntman, and actor in addition to being a super-genius, a being of pure energy, and occasionally dead. In reality, the Wonder Man series from the 1990s, a lighthearted tale about superheroes and celebrity society, centered on Simon's experience in Hollywood (which happen to be written by a man who, thankfully, is currently in prison). In that series, Wonder Guy faced out against villains like Gamma-Burn, a TV enthusiast whose intentions to harness gamma radiation to reverse aging convert her into a monster, and Splice, a man with huge swords for hands and a film-editing gimmick.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Wonder Man will probably function as a self-aware Hollywood parody, similar to how She-Hulk: Attorney at Law introduces superheroes to the realm of comedy courtrooms. After his journey in Shang-Chi and the Legend of the Ten Rings, Trevor is undoubtedly eager to return to show business, and as he and Simon navigate the studio system, they will certainly encounter haughty executives, psychotic fans, and other tinsel town scum. Like the Rogers musical saw in Hawkeye, we could even get to watch renditions of our favorite MCU flicks set within the realm. But ultimately, it's difficult to doubt that Wondie will eventually join the Avengers in the same manner as his comic book counterpart.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52335460544_99c9ef7142_b.jpg\" alt=\"MCU Wonder Man Trevor Slattery Ben Kingsley\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Although Nathan Fillion is not likely Wonder Man, James Gunn, a friend of Fillion's, was filming Guardians of the Galaxy Vol. 2. He hired the Firefly actor to take a few photos while posing as Simon Williams for movie posters. Fans continue to draw the connection even though none of the characters depicted in those posters appeared on-screen and Fillion was never formally cast. However, at 51, Fillion is a little bit older than Marvel like for new heroes, despite the fact that he would be ideal for the comedy of a Wonder Man TV program.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Regardless of who they select, they will have a challenging assignment. For his Hollywood exploits, the actor will not only have to portray Simon Williams' sillier side, but also the depth of a man who has experienced loss and finally joins the Avengers. Even though it's a challenging task, the right actor can make Marvel's Cinematic Universe's Wonder Man as as adored as his comic book counterpart.</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}