{"pageProps":{"article":{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”","keywords":"mcu, marvel, phase 4, Russo Brothers","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Brothers' journey appears to be intertwined with the MCU's own journey. The two Ohioan directors were once a bit of a gamble for Marvel Studios President Kevin Feige. They were young filmmakers who were better known for their television work on shows like Community and Arrested Development than for the kind of flashy Hollywood vehicles that used to lead to Hollywood blockbusters. Nevertheless, on Captain America: The Winter Soldier in 2013, the Russo family received the royal keys, and the rest is Marvel history: Captain America: Civil War (2016), Avengers: Infinity War (2018), and a small film called Avengers: Endgame (2019), which became the highest-grossing movie of all time upon its release.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe and Anthony Russo have taken a sabbatical from the MCU, if not necessarily from action films, since those endeavors. Their most recent movie, The Gray Man, is really one of the largest in Netflix history. It's a star-studded spy thriller with all the scope of a Marvel extravaganza but none of the moral clarity of a superhero. The Russos have a number of movies in development after putting down their Marvel superhero costumes (for the time being) and focusing on growing their own production business, AGBO.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, when we met down with Joe and Anthony to talk about The Gray Man, Joe affirms that they have followed Marvel's progress in Phase 4 (at least as much as is feasible given the volume of MCU information now available!). And one of the most recent attempts stood out for the duo.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I thought No Way Home was unbelievable . It was fantastic. I thought it was pitch perfect. It was one of the best times I’ve had in the movie theater in a long time, and it was nice not being involved. As a film geek, I could just go sit in a theater and be surprised and laugh and cry with everyone else in the movie theater.” - Joe Russo</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In fact, Joe was made aware of a frequently disregarded egalitarian aspect of the Marvel approach and experience as he watched his fellow spectators applaud the sight of three generations of wallcrawlers working together in Spider-Man: No Way Home, including Tom Holland's most recent Peter Parker, who the Russos had a hand in casting.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I think the one thing that Marvel doesn’t get enough credit for is what else bonded people after such a divisive time during the pandemic and after all this manufactured conflict that’s been playing out in America over the last four years? But going into a theater, race, color, creed, whether you’re a Democrat or Republican, it doesn’t matter.” - Joe Russo</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/4d162734-0f96-436b-9146-ef54a7a695bb'>What has Marvel planned for MCU Phase 5?</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Later, Joe included a follow-up interview,</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”The power of filmmaking is its ability to bind people together as a community in a public space, respective of background. And Marvel does that better than anyone, and I don’t think they get enough credit for that. And if that is the true power of what filmmaking is, then they’re certainly the most potent filmmaking entity on the planet because you go into one of those theaters, and, boy, there’s a lot of joy and happiness, and emotion, and excitement going on in one of their films. And you just don’t see that on any other movie. Even, historically, I’m not sure that you’ve seen that level of excitement on any film other than when Marvel’s operating at the top of their game.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe and Anthony agree that their time at Marvel opened their eyes to the true appeal of visual narrative to consumers, as opposed to what certain cultural gatekeepers may have led them to believe.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“You connect with audiences in a way that allows you to understand the global impact of big release movies and you get a better window into the perspective of audiences who are outside of the U.S. and outside of that sort of Hollywood circle. My brother and I have found that incredibly enlightening and really pivotal to our careers moving forward.” - Joe Russo</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>He further stated,</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”To really understand inclusion, you have to remember that going to a movie theater is, in some regards, an elitist experience, right? It’s expensive. And outside of the U.S., a lot of people cannot afford it. A majority of audiences can’t afford it. There are certain countries you go to where going to a movie theater is a once in a lifetime experience. So you’re trying to deliver something to those audiences that is deserving of that time, that money they’re going to spend. Also it allows you to understand that putting barriers into your storytelling, whether they be faux-intellectual barriers in an attempt to create a niche appeal, that’s uninteresting to us, because it excludes a wider audience, and I would argue a more interesting audience.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Gray Man will debut on Netflix on July 22 following a restricted theatrical run that starts on July 15. The Russos will then attempt to reach that broad audience on the most well-known streaming service globally with this film.</p>\n                </div>\n                "]},"reco":[{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"}]},"__N_SSG":true}