{"pageProps":{"article":{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl.","keywords":"Johnny Depp Pirates of the Caribbean, jack sparrow","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp admits to never having seen Pirates of the Caribbean: The Curse of the Black Pearl. The first Pirates of the Caribbean film, released in 2003, was a huge smash with audiences and launched a multi-billion-dollar franchise. Captain Jack Sparrow, played by Johnny Depp, was introduced to viewers in Pirates of the Caribbean: The Curse of the Black Pearl, a beloved figure who would go on to feature in all four sequels, the most recent of which, Pirates of the Caribbean: Dead Men Tell No Tales, was released in 2017.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The possibility of a sixth Pirates of the Caribbean film has been discussed since before the fifth, but no new information has been released about the project in a long time. The production of a sixth Pirates of the Caribbean film might possibly be hampered by Depp's current legal issues. The 58-year-old actor's troubled marriage with ex-wife Amber Heard has long been the topic of tabloid headlines, and the two stars' bitter spat has now moved to the courtroom, with Depp suing Heard for $50 million in defamation.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp's evidence in court against Heard included an unexpected admission: he'd never seen Pirates of the Caribbean: The Curse of the Black Pearl, according to Matthew Belloni, creator of Puck News. Belloni considers Depp's admission \"a baller move,\" noting that he was nominated for Best Actor at the 2004 Academy Awards for his performance as Sparrow.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Johnny Depp just said in court he never saw the first PIRATES movie. Remember, he was nominated for an Oscar for that film. Just a baller move right there.</p>— Matthew Belloni (@MattBelloni) <a href=\"https://twitter.com/MattBelloni/status/1516492621522243589?ref_src=twsrc^tfw\">April 19, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following Jared Leto's recent allegations that he hasn't seen one of his own films in over 22 years, Depp has admitted that he hasn't seen one of his own films in over 22 years. Depp, who has previously stated that he does not enjoy viewing his own films, joins the ranks of Meryl Streep, Joaquin Phoenix, Javier Bardem, and Reese Witherspoon as performers who skip their own films. While it may seem strange that Depp didn't see a film for which he was nominated for an Academy Award, Pirates of the Caribbean: The Curse of the Black Pearl appears to be only the latest in a long series of Depp films that he hasn't seen.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's unclear how Depp's current legal issues will affect the Pirates of the Caribbean franchise's future. Even said, it's becoming increasingly improbable that Depp would reprise his role as Captain Jack Sparrow. The Pirates of the Caribbean series may have to learn to thrive without Depp's presence, with a spinoff reportedly in production with Margot Robbie attached to feature. Many fans believe the latter episodes are notably worse than Pirates of the Caribbean: The Curse of the Black Pearl and the other two original trilogy films, therefore it could be a good thing for the franchise to receive a fresh start.</p>\n                </div>\n                "]},"reco":[{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"}]},"__N_SSG":true}