{"pageProps":{"article":{"id":"dffa1745-2c6b-42a3-91a3-b07d7eb3e00e","date":"Jul 11, 2022","author":"Brian Martin","title":"Ranking The Craziest Nicolas Cage Performances Ever","excerpt":"These performances by Nicolas Cage provide as evidence that he is a unique performer","keywords":"Nicolas Cage weirdest movies","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52208264963_d3ca84afcb_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Whatever your opinion of Nicolas Cage's movies, you can never claim that he is acting for the camera. Cage has acted in a wide range of films throughout the span of his 40+ year career, including independent dramas, blockbusters that appeal to mass audiences, prestige films that have received Oscar nominations, and everything in between. He has remained committed to his art throughout it all, making unique decisions that may appear ludicrous to some but are always influenced by his in-depth understanding of movie history.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>“I think many of the choices I’ve made have been inspired by film stars from the silent era, as well as cultural expression of performance like Kabuki and some of the Golden Age actors like [James] Cagney, so I don’t know how to say I’ve done something new because those elements are always on my mind,” Cage said in a Reddit AMA.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">10. Ghost Rider: Spirit of Vengeance</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535174_413c3186a1_o.png\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While neither of the two Ghost Rider movies are particularly good, we have to admit that we really like how much Cage emphasized his natural talent for drama in the sequel to the less successful but considerably more compelling first movie.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Cage is taking risks and can come across as more menacing when he's not in his blazing skull persona. As he struggles to prevent the spirit of revenge from consuming wicked folks, see Cage twitch and convulse.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">9. Raising Arizona</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535214_463811cfc2_o.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nic Cage gave one of the most heartfelt performances of his career as H.I. McDunnough in the Coen Brothers' zany baby caper, Raising Arizona, while also hamming it up like a real-life Looney Tunes cartoon. The character played by Nicolas Cage has a Looney Tunes tattoo on his bicep, in case that wasn't obvious.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film's heightened realism fits Cage's ridiculous actions like a glove, and his amiable demeanor makes you sympathize for a man who has abducted a baby, which is something that ought to be abhorrent. It seems like it shouldn't work, just like many of Cage's acting decisions, yet it simply works.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">8. Moonstruck</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208267281_3324329eba_o.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Cher gives a remarkable performance in this quirky love story, but Nic Cage, who plays the eccentric freak Ronny Cammareri, an opera enthusiast baker, steals the show. Ronny revealing to Cher's Loretta the loss of his hand and his fiancé would be the scenario that best summarizes Cage's career. It is both a devastating expression of sensitivity and a delightfully histrionic outburst. One really moving picture perfectly captures the uplifting Nic Cage can bring.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">7.Kick-Ass</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535209_319c5f5974_o.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Kick-Ass, a comic book movie starring Cage, skillfully makes use of the actor as Big Daddy, a devoted father who also raises his little daughter to be a merciless killing machine. Cage is hilarious in this scene, enticing his kid into flawless headshots and evasive actions with a beautiful, sing-song voice. And that's before he begins emulating Adam West's voice delivery whenever he dons Big Daddy's frightening mask.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>We'd also be remiss if we were to note (spoiler alert) his utterly compelling death scene, in which he displays his vocal prowess and convincingly conveys that he's been set on fire. Right now, their shouts are very vivid in our heads.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">6. Mandy</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208289368_926ef7d6b9_o.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Mandy is a nasty little psychedelic vengeance film that finds the actor going medieval on some acid victim cultists who killed his lover. It is a contemporary and successful vehicle for furious Cage. Cage portrays the role in the movie as a guy who has escaped hell just to drag his adversaries back down with him. He is fuelled by cocaine, LSD, and blazing white-hatred. There is a forlorn, melancholy aspect to Cage's performance in between his eruptive fits of wrath. The guy has several layers, but in this instance many of them may be described as \"feral.”</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">5. Color Out of Space</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208267411_8b4af51d40_b.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In the H.P. Lovecraft adaption by director Richard Stanley, a family fights a horrific extraterrestrial entity that has infected both their brains and bodies. Cage spends the third act alternating between rage-driven monster and family protector in this horror gem that rises to meet Cage's WTF magnificence. Cage portrays family patriarch Nathan Gardner, whose best intentions to safeguard his family struggle against the lunacy brought on by \"the Color.”</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">4. Wild at Heart</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535124_94aefca670_b.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>One of Nic Cage's most well-known roles is Sailor Ripley from David Lynch's wickedly entertaining Wild at Heart. Sailor Ripley has a snakeskin leather jacket that works equally well for power metal as it does for Elvis ballads. Ripley is the sensitive bad guy who seems like he would write beautiful poetry to his girlfriend in the blood of his foes. He is an unashamed romantic. It's hilarious to see Cage, who portrays Ripley like a contemporary James Dean, flail around or earnestly sing out \"Love Me Tender\" without any sarcasm. Cage makes weirdo melodramas just better.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">3. Adaptation</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535254_1ec6cedc99_o.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Some people love their Cage to be ferocious and explosive, but I prefer mine Nic Cage to be anxious and neurotic. In Spike Jonze's Adaptation, Cage gives a masterclass in sweating, worry-driven neuroses as real-life playwright Charlie Kaufman. Cage plays Charlie's imaginary, dim-witted, and upbeat brother Donald as well, which makes the situation much funnier. Watching Charlie's reaction to Donald's casual study of screenplay is comedy gold. Cage has seldom been better in Adaptation, a meta-masterpiece that consistently defies expectations.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">2. Vampire’s Kiss</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208289308_84778d7991_o.png\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In the age of YouTube, this mostly forgotten 1989 picture about a bad boy literary agent who thinks he's been changed into a vampire has burst back to life as movie fans gleefully shared some of Cage's most irrational acting to date. Cage totally commits to the part and adopts an expressionistic style to represent a man's spiral into lunacy, which includes donning artificial vampire teeth, devouring a (actual) cockroach, and racing through the streets of New York yelling \"I'm a Vampire.\" Yes, it's cheesy and inadvertently humorous, but it's also oddly magnetic. There is nothing at all like it.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">1. Face/Off</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52208535179_cb50450b80_b.jpg\" alt=\"Nicolas Cage weirdest movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Here is the decade's pinnacle of bonkers action. John Woo's Face/Off, which is so ludicrous and campy that it can't help but be adored, could have been the turning point when more people began to realize that Cage is a little bit unique. The majority of the movie is spent with the actor pretending to be Castor Troy, a murderous psychopath, while playing the role of agent Sean Archer, a wonderful person! —but Cage is the most entertaining during the movie's opening sequences when he plays the actual Castor Troy and masticates the background like a teething Rottweiler.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Put Cage in the Smithsonian while disguised as a priest and groping himself to \"Hallelujah.\" It's unfortunate that we don't get to see much more of Cage as Troy, but the actor also pulls off a phenomenal Travolta impersonation.</p>\n                </div>\n                "]},"reco":[{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"}]},"__N_SSG":true}