{"pageProps":{"article":{"id":"1dd77e03-3722-45aa-8542-b5a045ff401d","date":"Apr 14, 2022","author":"Brian Martin","title":"All Johnny Depp Movies That You Can Watch on Netflix","excerpt":"When it comes to portraying a character, Johnny Depp goes all out. Today, we're going to check out his movies that are available on Netflix.","keywords":"netflix, johnny depp, chill, blow, the tourist, mortdecai","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52002477877_c3802936ab_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>He's one of the oddest and most eccentric actors of the last four decades. Johnny Depp is also noted for playing some of the oddest and most bizarre parts in film over the previous four decades. Depp interprets the character based on what is written on the page of the screenplay.\nAt the very least, the result is a memorable character. At the very least, it's a memorable film to go with the persona.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>His personal image may have suffered in recent years, but his career has not, thanks to appearances in the Fantastic Beasts flicks and other high-profile ventures. Here are 4 Johnny Depp Movies that you can watch on Netlix right now.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Corpse Bride</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003498946_8b1cb61641_b.jpg\" alt=\"netflix, johnny depp, chill, blow, the tourist, mortdecai\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Johnny Depp's major part in Rango was one of his best, many on IMDb prefer the Tim Burton and Mike Johnson produced Corpse Bride. The film stars Johnny Depp as Victor and Helena Bonham Carter as Emily, a zombie who believes she is Victor's Corpse Bride in a stop-motion animation that is viewed as a spiritual sequel to The Nightmare Before Christmas.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Based on 197 reviews, the review aggregator website Rotten Tomatoes reported an 84 percent approval rating with an average rating of 7.2/10. \"As can be expected from a Tim Burton movie, Corpse Bride is whimsically macabre, visually imaginative, and emotionally bittersweet,\" according to the site's critical consensus. Metacritic, a review aggregator that assigns a score out of 100 based on top reviews from mainstream critics, calculated a score of 83 based on 35 reviews, indicating \"universal acclaim.\" On a scale of A+ to F, audiences polled by CinemaScore awarded the picture an average grade of \"B+.\" The film was nominated for the 78th Academy Award for Best Animated Feature, but it was defeated by Wallace & Gromit: The Curse of the Were-Rabbit, which also starred Helena Bonham Carter. This film was nominated for the American Film Institute's Top 10 Animation Films list in 2008.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Blow</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52002478442_577865dc27_b.jpg\" alt=\"netflix, johnny depp, chill, blow, the tourist, mortdecai\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With the exception of J.M. The majority of Johnny Depp's biographical portrayals are outlaws and renegades, according to Barries. On that list, George Jung is at the top. In Blow, he plays a man who assisted in the importation of cocaine into the United States, and he does so with the swagger of a rock star.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Jung risks everything for the good life, driven by the ambition to never be poor. Despite the glamorization, Depp's Jung yearned for more time with his daughter by the end.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Based on 141 reviews and a weighted average score of 5.8/10, the film has a 55 percent approval rating on Rotten Tomatoes. \"With elements that seem borrowed from movies like Goodfellas and Boogie Nights, Blow is pretty much been-there-done-that despite another excellent performance from Johnny Depp. It, also, becomes too sentimental at the end,\" the site says. The film received a \"A-\" on an A+ to F rating from audiences polled by CinemaScore.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Mortdecai</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52004022910_bf50c6aefd_b.jpg\" alt=\"netflix, johnny depp, chill, blow, the tourist, mortdecai\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp plays Charlie Mortdecai, a borderline dissolute roué and cad who works as an art dealer of dubious means and morals who, as the film begins, owes the British government over 8 million pounds in back taxes and is on the verge of losing everything, save for his newly cultivated walrus-style mustache. One person who would like to see him lose his stache is Johanna (Gwyneth Paltrow), his otherwise loving and infinitely patient wife, whose gag reflex goes into overdrive whenever she comes into close contact with the soup strainer in question, a trait shared by Mortdecai and, presumably, most members of the audience.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Not only is it a one-joke characterization, but the joke is on the level of a below-average knock-knock joke. Johnny Depp delivers another one of the self-consciously campy turns that he has been giving viewers in lieu of actual performances—not only is it a one-joke characterization, but the joke is on the level of a below-average knock-knock joke. This performance, like the rest of the picture, is such a terrible error that you almost want to keep watching just to see how much worse it can get until it eventually comes to a merciful and long-overdue finish.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Tourist</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52002478227_20371b385e_b.jpg\" alt=\"netflix, johnny depp, chill, blow, the tourist, mortdecai\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Angelina Jolie gives it her all as the mysterious woman. She understands the humor. At this film, she begins in a Paris cafe, eludes detectives by scurrying into the Metro, boards an overnight train to Venice, picks up a mysterious man (Johnny Depp), and checks them both into the Royal Danelli without a wrinkle on her clothing or a hair out of place.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp plays the accommodating, love-struck straight guy who gets sucked into someone else's problems in the Cary Grant character. These two should, in principle, indulge in clever flirting and sardonic understatement. No one appears to have informed Depp that the film is a farce in practice. Of course, I'm referring about farce in the dictionary sense: a humorous dramatic production that employs buffoonery and horseplay, as well as coarse characterisation and ludicrously impossible scenarios. Depp, on the other hand, takes his math teacher seriously and with a hint of melancholy.</p>\n                </div>\n                "]},"reco":[{"id":"f527bdb6-e648-4e4f-8498-dfb1780c7ac2","date":"Apr 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52010385865_cc0896e9ee_o.png","title":"After Guardians of the Galaxy 3, James Gunn discusses his MCU future","tags":"movie news","excerpt":"Because James Gunn is now working on various Marvel Cinematic Universe projects, he has finally addressed his post-Guardians of the Galaxy 3 plans."},{"id":"6bce8ad0-35c6-41f4-9ca0-5ba14b2e2c78","date":"Apr 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52005638938_4ee164a2e3_c.jpg","title":"10 Best Superhero Movies Since 2007","tags":"movie news","excerpt":"These finest superhero films will convert you to a real believer in the cinematic magic of comic books."},{"id":"b33d19dc-f1be-4282-9679-acdacf7c2d7e","date":"Apr 14, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52003867179_3052f81a11_c.jpg","title":"15 Best Johnny Depp Movies That You Should Watch","tags":"movie news","excerpt":"Depp, who is regarded as an acting chameleon, is most recognized for his ability to embody distinctive and oftentimes dark characters to the point of being nearly unrecognizable."},{"id":"594a7681-075f-455c-b030-a00e9075ac34","date":"Apr 13, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52002373450_050f7aaa9b_c.jpg","title":"Is it Possible for Mission: Impossible to Survive Without Tom Cruise?","tags":"movie news","excerpt":"The Mission Impossible films have been so popular that the espionage franchise may be able to continue without Tom Cruise. But will the franchise be able to pull it off?"}]},"__N_SSG":true}