{"pageProps":{"article":{"id":"b33d19dc-f1be-4282-9679-acdacf7c2d7e","date":"Apr 14, 2022","author":"Brian Martin","title":"15 Best Johnny Depp Movies That You Should Watch","excerpt":"Depp, who is regarded as an acting chameleon, is most recognized for his ability to embody distinctive and oftentimes dark characters to the point of being nearly unrecognizable.","keywords":"johnny depp, best movies","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52003867179_3052f81a11_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp has had a long and diverse career filled with highs and lows, hits and misses, but where does he rank from worst to greatest in terms of movies? Depp began his career as a young idol in films such as A Nightmare on Elm Street and the successful TV program 21 Jump Street, soon progressing to main parts and developing a friendship with director Tim Burton.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Burton is the one who gave him a movie star character that would become distinctly his, a blend of oddball peculiarities and profoundly felt soulfulness. This strange presence would go on to shine in films like Edward Scissorhands and What's Eating Gilbert Grape, eventually culminating to his instantly-iconic role as Captain Jack Sparrow. He's now mired in a dispute after being dismissed from his role as the primary villain in the Fantastic Beasts trilogy by Warner Bros.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp's career is broad and varied, brimming with lonesome outcasts, grim-faced criminals, and pounds upon pounds of white makeup, even if his future acting possibilities appear bleak at the moment. Minamata hasn't been included since it was never released in theaters or on Netflix in the United States, according to the filmmaker, who claims MGM sought to bury the picture. City of Lies is also absent, having been withdrawn from its 2018 release date owing to a lawsuit, with no replacement revealed.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Black Mass</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003613526_4b5b01e803_w.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp could play crime leaders or shady characters in his sleep by this time in his career, and in \"Black Mass,\" he portrays iconic Boston gangster James \"Whitey\" Bulger under a prosthetic mask.\nWhitey Bulger is a nasty figure with practically no redeeming characteristics, and Depp portrays him with such calm malice that it's extremely unsettling to see.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>After a spate of disappointments that included \"The Lone Ranger\" and \"Mortdecai,\" Depp's return to form with \"Black Mass\" proved that he could still put in a superb performance. Most reviewers thought that it was one of his greatest recent portrayals, with the consensus on Rotten Tomatoes claiming that it \"spins a captivating yarn out of its fact-based plot — and leaves moviegoers with one of Johnny Depp's most compelling performances in years.\"</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Minamata</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003867154_51395644a8_c.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Minamata,\" which premiered at the Berlin International Film Festival over two years ago and will be released in the United States in February 2022, feels like it has been on the verge of being released for a long time. Depp portrays W. in the film. Eugene Smith was a real-life war photographer who photographed the consequences of mercury poisoning on the people of Minamata, a coastal Japanese town. Depp's transformation into the persona is practically unrecognizable, showcasing his ability to entirely morph into the character he is portraying.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Minamata\" follows a similar theme to investigative documentaries like \"Dark Waters,\" focused on the search to unearth the truth about the possibly life-threatening side-effects of corporate greed on regular people. The picture is patchy at times, but Depp's acting is superbly restrained, and it contributes to the illumination of an essential narrative.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Benny & Joon</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52004137405_fa4c1c4752_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp embraces his inner silent cinema star in this quirky 1993 romantic comedy, and it's evident even at this early stage in his career that he was built to play misfits. Depp captures the physicality necessary for the humorous parts in the film as Sam, the love interest of the eponymous Joon (Mary Stuart Masterson), with one notable highlight being his replication of Charlie Chaplin's \"bread roll dance\" in a diner.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The picture may be a little too bizarre for some, but it is an extraordinary tour de force as an example of what Depp is capable of as an actor. Depp was also nominated for a Golden Globe for best actor in a comedy or musical for his performance.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Finding Neverland</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003613296_56f3b8a59c_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp portrays writer J.M. Barrie in one of his most endearing roles. With his career at a crossroads, Barrie meets widowed Sylvia (Kate Winslet), and her energetic young sons supply him with the inspiration he needs to write his cherished childhood classic.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Finding Neverland\" is a fantastic biographical drama with just enough fairy dust and magical realism to conjure up the sensation of J.M. Barrie's most famous invention. While the film didn't aim for complete authenticity in its portrayal of Barrie, it was a box financial and critical success. It also received seven Academy Award nominations, including Depp's second for acting, and one for original soundtrack.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Corpse Bride</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52002593032_ee48a86b5a_c.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As Victor Van Dort, Depp is almost unrecognizable the stuttering protagonist in Tim Burton's fantastical stop-motion animated film \"Corpse Bride.\" It was Burton's third foray into stop-motion animation, following his contributions to \"The Nightmare Before Christmas\" and \"James And The Giant Peach,\" but it was the first that he had directed himself.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The monotone and dreary \"land of the living\" contrasts beautifully with the rich color and vibrancy of the \"land of the dead,\" mirroring the differences between Victor and the corpse he accidentally ends up marrying (voiced by Helena Bonham Carter), with the two unexpected partners literally worlds apart. \"Corpse Bride\" is a charming and ghastly romance that showcases not only Burton's stop-motion skills, but also Depp's voice acting ability.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Sweeney Todd: The Demon Barber of Fleet Street</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003613336_ee099a13cf.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tim Burton and Johnny Depp are the ideal combo to bring Stephen Sondheim's macabre musical from the Broadway stage to the big screen, based on their track record. \"Sweeney Todd\" is a slasher film set in the 1800s with singing and practically every phrase set to music. Depp's musical skills prepared him for this role, and his singing voice adds to the demon barber's venom.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many viewers were astonished when they sat down in cinemas to a full-fledged musical after the film's trailer effectively hid exactly how many songs it had. Disgruntled moviegoers are said to have taken their complaints to the Advertising Standards Authority. However, those who were able to get into \"Sweeney Todd\" received rave reviews, and the picture gained critical acclaim as well as an Oscar nomination, with Depp obtaining his third nomination.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Arizona Dream</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52002592962_e071baa5b7_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This underappreciated film from Johnny Depp's early career is absolutely worth searching out.\nWhile it's a strange little picture, Depp's performance as Axel Blackmar, a young guy with a mind full of visions, is totally enthralling. Axel is coaxed away from New York and back to Arizona for an uncle's wedding, where he has a series of bizarre events, including a crush on the elder Elaine (Faye Dunaway), with whom he helps build a flying contraption.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Arizona Dream\" is a strange and mesmerizing film that seems to be about everything and nothing at the same time. It investigates and deconstructs the American Dream via filmmaker Emir Kusturica's distinctively European viewpoint.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Donnie Brasco</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003675593_e9df3a65d5_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this gritty gangster film, F.B.I. agent Joe Pistone (Depp) infiltrates the Bonanno criminal family under the pseudonym of Donnie Brasco, working alongside veteran hitman Lefty Ruggiero (Al Pacino). Lefty's life is in shambles, so he takes Donnie under his wing in the hopes of teaching him not to repeat his errors. However, the further Donnie delves into the criminal organization, the more it affects his personal life, as the borders between undercover agent and gangster blur.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Donnie Brasco\" is a brutal investigation of what it's like to play both sides in the world of organized crime, and the delicate power balances that may mean the difference between life and death, with a brilliant cast that includes Michael Madsen. The film was nominated for an Academy Award for best adapted screenplay after being based on the 1988 book \"Donnie Brasco: My Undercover Life in the Mafia\" by the real Joe Pistone.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Platoon</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52002593152_9a3414b4ae_z.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that Johnny Depp's role in Oliver Stone's Vietnam war epic \"Platoon\" is little, it is crucial. He portrays Lerner, a company interpreter who is assigned to the corporation. He is significant in the sense that he is one of the few who can genuinely converse to and comprehend the other side, given the film's frequent use of violent language.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>More than anything, the baby-faced Depp serves as a reminder of how young these troops were, and while he survives, many others do not, a stark reminder of the Vietnam War's devastation. The film earned a lot of praise and was nominated for eight Oscars, winning four of them, including best director for Stone and best picture.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">A Nightmare On Elm Street</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003675278_9314fab118_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nothing compares to the original 1984 version of \"A Nightmare On Elm Street,\" directed by famed horror filmmaker Wes Craven, which has inspired countless sequels, spin-offs, and remakes. Of course, the picture is renowned for being Johnny Depp's debut film performance, in which he plays Glen Lantz, one of the youths tortured by Freddy Krueger (Robert Englund).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It doesn't get much better than this for a first job, especially as Glen is despatched in a magnificently over-the-top manner, making Depp's arrival all the more unforgettable. The film was a huge hit, grossing more than $25.5 million on a $1.2 million budget. The legacy of \"A Nightmare On Elm Street\" is even more important: the famous Freddy Krueger was named to the AFI's list of the 100 greatest villains, and the picture was selected for preservation in the National Film Registry in 2021.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">What's Eating Gilbert Grape</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003675138_21c798911a_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"What's Eating Gilbert Grape,\" starring a young Johnny Depp as Gilbert and an even younger Leonardo DiCaprio as his brother Arnie, is a touching movie about a young man's yearning to establish his own life after feeling stuck in his hometown. Gilbert is the primary carer for both his mentally challenged brother Arnie and his morbidly obese mother (Darlene Cates).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gilbert and Arnie's connection is possibly the most emotional aspect of the picture, while Depp and DiCaprio have a fantastic sibling dynamic. It's also refreshingly honest in portraying Gilbert's conflict; while he is fully dedicated to his brother, he also wishes he could be free of him at times.\nWhile Depp did not earn an Oscar nomination for \"What's Eating Gilbert Grape,\" DiCaprio, who is just 19 years old, received an Oscar nomination for best supporting actor.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Rango</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003867099_1269c7af4a_b.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp, who has been dubbed a \"acting chameleon,\" has the opportunity to voice a real chameleon in the animated film \"Rango.\" When he ends himself in the Old West town of Dirt, he has a lot of fun playing a former pet who is having identity issues. Rango, like the real-life beast, is skilled at weaving narratives to acclimatize himself, posing as a courageous hero whose claims are subsequently put to the test when he is chosen sheriff.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With nods to classic Westerns like \"The Good, The Bad, And The Ugly,\" as well as an Easter Egg for \"Fear and Loathing in Las Vegas,\" \"Rango\" sometimes feels like a picture geared more for adults than youngsters. \"Rango\" affords Depp the opportunity to create a character that feels like it could only be performed by him with just his voice.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Pirates Of The Caribbean: The Curse Of The Black Pearl</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003867114_ecca251eb2_z.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp won perhaps his most renowned part as the swaggering swashbuckler Captain Jack Sparrow in Disney's big-screen rendition of one of their classic theme park attractions over 20 years into his cinematic career. \"Pirates of the Caribbean: The Curse Of The Black Pearl\" offers everything you'd expect from an epic blockbuster adventure, including a stirring score, swordfights, and a swarm of zombie pirates.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film was a smash hit with audiences and critics alike, with Nick Schager of Slant Magazine stating, \"Depp commands the screen.\" It was for this commanding performance that Depp received his first Oscar nomination for best actor, and while he didn't win, it marked the beginning of a very successful period for the actor as one of Hollywood's most bankable stars.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Edward Scissorhands</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003613646_1ccf5440d6_c.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this dark and melancholy story about accepting people who seem different, Johnny Depp and Tim Burton's debut collaboration is also one of their greatest. \"Edward Scissorhands\" was the start of a highly lucrative partnership for the two, and it allowed Depp the chance he'd been yearning for to move away from the young heartthrob parts he'd been put in following his breakout appearance on the TV serial \"21 Jump Street.\"</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Edward does prove to be very endearing, his external look is a major difference from Depp's other 1990 feature, \"Cry-Baby,\" which established early in his career that he was a tremendous actor with a special ability for playing dark and odd characters. The Telegraph's Marc Lee stated Depp was \"sensational in the main character, evoking tension, sorrow, and innocence with tragic sincerity.\"</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Ed Wood</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52003867214_827f432823_c.jpg\" alt=\"johnny depp, best movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tim Burton pays respect to the sort of movie he enjoys, as well as the strength and force of misfits, in \"Ed Wood,\" one of those rare pictures that seems to work on every level. Ed Wood, who is often regarded as the worst director of all time, directed his films with a fierce and exuberant zeal that Depp masterfully captures.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Ed Wood\" may have been ridiculing in tone in the wrong hands, but Burton's intention is to praise the filmmaker instead, and the film is never sneering or condescending to him, regardless of the quality of his films. Depp's abilities are ideally matched to the role of Wood, who is a colorful and quirky figure. Despite being a box financial disappointment — which seems unusual given the subject matter — \"Ed Wood\" received great accolades from reviewers and earned two Academy Awards, including best supporting actor for Martin Landau's tragic portrayal as Bela Lugosi.</p>\n                </div>\n                "]},"reco":[{"id":"f527bdb6-e648-4e4f-8498-dfb1780c7ac2","date":"Apr 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52010385865_cc0896e9ee_o.png","title":"After Guardians of the Galaxy 3, James Gunn discusses his MCU future","tags":"movie news","excerpt":"Because James Gunn is now working on various Marvel Cinematic Universe projects, he has finally addressed his post-Guardians of the Galaxy 3 plans."},{"id":"6bce8ad0-35c6-41f4-9ca0-5ba14b2e2c78","date":"Apr 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52005638938_4ee164a2e3_c.jpg","title":"10 Best Superhero Movies Since 2007","tags":"movie news","excerpt":"These finest superhero films will convert you to a real believer in the cinematic magic of comic books."},{"id":"1dd77e03-3722-45aa-8542-b5a045ff401d","date":"Apr 14, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52002477877_c3802936ab_o.png","title":"All Johnny Depp Movies That You Can Watch on Netflix","tags":"movie news","excerpt":"When it comes to portraying a character, Johnny Depp goes all out. Today, we're going to check out his movies that are available on Netflix."},{"id":"594a7681-075f-455c-b030-a00e9075ac34","date":"Apr 13, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52002373450_050f7aaa9b_c.jpg","title":"Is it Possible for Mission: Impossible to Survive Without Tom Cruise?","tags":"movie news","excerpt":"The Mission Impossible films have been so popular that the espionage franchise may be able to continue without Tom Cruise. But will the franchise be able to pull it off?"}]},"__N_SSG":true}