{"pageProps":{"article":{"id":"9d5ca4b8-c628-4586-a800-ea074863184d","date":"Mar 28, 2022","author":"Nick Carver","title":"Will Smith Smacking Chris Rock At The Oscars In 2022 Appears To Have Jaden Smith's Support","excerpt":"Will Smith struck Chris Rock after the latter's Jada Pinkett Smith joke at the 2022 Oscars, prompting Jaden Smith to express his support for his father.","keywords":"oscars, will smith, chris rock, jaden smith, king richard","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51965763342_3e42506d42_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>After his father, Will Smith, slapped presenter Chris Rock during the 2022 Academy Awards, Jaden Smith expresses his support for him. In more ways than one, the Oscars ceremony this year was a significant night for the elder Smith. Smith won Best Actor for his depiction of Richard Williams, father of tennis legends Venus and Serena, in the film King Richard, as expected. This was a significant victory for the actor, as it was his first ever win after receiving his third Academy Award nomination.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, as many people are aware, winning an Oscar isn't the only reason his participation at the 2022 Oscars will be remembered. Earlier in the ceremony, comedian and presenter Chris Rock made a joke about Smith's wife, Jada Pinkett Smith, shaving her head and stating that she was ready to star in a sequel to 1997's G.I. Joe. Jane. Pinkett Smith, on the other hand, has been vocal about her difficulties with alopecia, a disorder that causes hair loss, for several years. Smith slapped Rock across the face when he approached the stage after plainly not taking kindly to the statement, then returned to his seat and admonished the comedian for ridiculing his wife.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Smith's son Jaden recently tweeted his support for his father's behavior. While the message itself is a little confusing, it's hard to conceive the phrase could be referring to anything other than support for his father, who not only stood up for Jaden's mother, but also went on to win an Academy Award.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And That’s How We Do It</p>— Jaden (@jaden) <a href=\"https://twitter.com/jaden/status/1508295733551632389?ref_src=twsrc^tfw\">March 28, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Both Smith's behavior and Jaden's post have elicited diverse reactions. Many people think that Rock's joke about Jada Pinkett Smith was utterly improper, with many viewers noting out that Rock made comments about her the last time he presented the Academy Awards. Others, however, have suggested that, while Smith had every right to be outraged, a public display of violence, especially at one of the year's most watched live television events, was not justified.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's impossible to deny that Rock's joke was absolutely inappropriate, and it's obvious that Jaden supports his father. It's never okay to make a joke about someone's illness, especially when it's made in front of as many people as were watching the 2022 Academy Awards. Smith's Oscars slap, on the other hand, was inexcusable, and while he appears to have avoided legal action, many will doubt the producers' choice to keep him in the ceremony as if the incident never happened.</p>\n                </div>\n                "]},"reco":[{"id":"d50a2581-329c-4d33-84bd-960681d523d4","date":"Apr 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52010028001_6d35098fc4_c.jpg","title":"Top 15 Saddest MCU Deaths","tags":"movie news","excerpt":"While a few of these characters have returned in other incarnations, their deaths will go down in history as some of the most heartbreaking events in the MCU."},{"id":"f527bdb6-e648-4e4f-8498-dfb1780c7ac2","date":"Apr 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52010385865_cc0896e9ee_o.png","title":"After Guardians of the Galaxy 3, James Gunn discusses his MCU future","tags":"movie news","excerpt":"Because James Gunn is now working on various Marvel Cinematic Universe projects, he has finally addressed his post-Guardians of the Galaxy 3 plans."},{"id":"6bce8ad0-35c6-41f4-9ca0-5ba14b2e2c78","date":"Apr 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52005638938_4ee164a2e3_c.jpg","title":"10 Best Superhero Movies Since 2007","tags":"movie news","excerpt":"These finest superhero films will convert you to a real believer in the cinematic magic of comic books."},{"id":"b33d19dc-f1be-4282-9679-acdacf7c2d7e","date":"Apr 14, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52003867179_3052f81a11_c.jpg","title":"15 Best Johnny Depp Movies That You Should Watch","tags":"movie news","excerpt":"Depp, who is regarded as an acting chameleon, is most recognized for his ability to embody distinctive and oftentimes dark characters to the point of being nearly unrecognizable."}]},"__N_SSG":true}