{"pageProps":{"article":{"id":"71995c14-eccf-4eb4-8fee-7425409a94c0","date":"Mar 23, 2022","author":"Kohei Watanabe","title":"Barcelona Footballer Pays Tribute To Goku From Dragon Ball Z","excerpt":"During a match against Real Madrid, FC Barcelona footballer Pierre-Emerick Aubameyang shows off his Dragon Ball fandom.","keywords":"anime, dragonball, goku, kakarot","tags":"anime news","thumbnail":"https://live.staticflickr.com/65535/51956013878_29e059cdb5_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Pierre-Emerick Aubameyang, a professional footballer, celebrated a goal with a posture that Dragon Ball fans will recognize.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to SB Nation, Aubameyang paid tribute to Akira Toriyama's popular anime and manga genre during FC Barcelona's last match against Real Madrid, which Barcelona won 4-0. Aubameyang went to the field's sidelines after scoring a goal, picked up a transparent orange orb, and placed two fingers on his brow, recreating the pose that Dragon Ball protagonist Son Goku strikes when he uses his Instant Transmission ability, which allows him to teleport great distances in the blink of an eye. \"It was a ball from Dragon Ball. With it, you can make a wish. I wanted to win and score a goal for my grandparents, who are gone,\" the player subsequently stated, confirming that it was a conscious homage to the iconic shonen manga.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://pbs.twimg.com/media/FOVS85_WUAIzcCU?format=jpg&name=large\" alt=\"anime, dragonball, goku, kakarot\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>On his personal Twitter account, Aubameyang later tweeted a photo of himself striking the position with a photo of Goku. \"Hello from a finished player,\" the multi-time Premier League top scorer said, mocking critics who claimed his career was gone after leaving Arsenal. Aubameyang's Twitter profile photo has been changed to a portrait of himself drawn in the style of Akira Toriyama's classic painting. The player is well-known for his eye-catching post-goal celebrations, which frequently include a flip. Aubameyang has also done a \"Wakanda Forever\" salute while wearing a Black Panther mask and celebrating a victory.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Goku is taught the Instant Transmission technique by the friendly people of the planet Yardat after crashing there following his planet-destroying battle with Frieza in the original Dragon Ball manga and the Dragon Ball Z anime. Goku not only exploits his ability to travel throughout the world to surprise opponents, but he has also integrated it into his combat technique, blending it with his famous Kamehameha and Spirit Bomb assaults. The Saiyan warrior most recently employed the technique in the Dragon Ball Super manga's current chapter, where he used it to buy time in his combat with the wish-powered warrior Gas.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Toriyama created Dragon Ball in 1984, and it is now the third best-selling manga of all time, with more than 300 million copies in print worldwide. The ongoing Dragon Ball Super manga, which is still overseen by Toriyama himself and incorporates art by his protégé, Toyotarou, continues Goku's exploits to this day.</p>\n                </div>\n                "]},"reco":[{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."},{"id":"6827305d-b11e-44da-9c7c-3746dc274bca","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52086874610_0c8116f5f8_c.jpg","title":"8 Best Anne Hathaway Movies That You Should Start Watching","tags":"movie news","excerpt":"Few actresses have the variety of Annie, who has appeared in everything from rom-coms to Oscar-winning musicals."}]},"__N_SSG":true}