{"pageProps":{"article":{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","excerpt":"And why one of the few films that scares him is 'The Thing.’","keywords":"Quentin Tarantino Reservoir Dogs","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Quentin Tarantino described why John Carpenter's The Thing is one of the few films that has ever terrified him, and how it helped him establish the appropriate tone for Reservoir Dogs on The Late Show with Stephen Colbert.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino's admiration for Carpenter's The Thing was never hidden. On The Hateful Eight, the filmmaker collaborated with Ennio Morricone, the composer of The Thing, even using some cues from the horror classic in the cold Western. The Thing, on the other hand, appears to have influenced Tarantino's earlier film Reservoir Dogs. And it's all because Tarantino's terrified reaction to Carpenter's masterwork is one of the few.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino claims to be a \"big horror movie fan\" who doesn't get terrified easily. \"I respond to suspense, I respond to that – oh what’s gonna happen next, and I can jump by a ‘boo’ scare – but that’s not really terror.\" Tarantino says. The Thing, on the other hand, terrified Tarantino. That's why the filmmaker wanted to \"bring it under the microscope\" and figure out what makes Carpenter's picture so terrifying.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52086174314_400917bbb6_o.jpg\" alt=\"Quentin Tarantino Reservoir Dogs\">\n                </div>","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I think the reason [for it being scary] is this. These men are trapped in this situation in this arctic research center, and one or more of them are possibly this Thing that’s going to devour all of them. And no one knows if you are the guy I’ve known forever or you are a Thing. And the movie makes the paranoia of that so palpable, so real, it’s almost like another character in the movie. The sheer paranoia of it. They’re trapped in the Antarctic, in this shelter, and so the paranoia is bouncing off of the four walls… until it has nowhere to go except through the fourth wall into the audience. I started feeling exactly like they felt.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Because the atmosphere of paranoia is exactly what fuels Reservoir Dogs, Tarantino drew heavily on The Thing for inspiration.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“When I started writing Reservoir Dogs, I was like, I need to have that aspect that’s in The Thing. I need to trap these bastards in this warehouse and no one can trust anybody else… and I want the paranoia of what’s going in that warehouse to bounce across the walls and hopefully, like in The Thing, it will go out into the audience.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino has yet to select which of his films will be his final. It might be Kill Bill 3 or something a little more outlandish, like a spaghetti western comedy. While the filmmaker continues to mull about how to say farewell to Hollywood, it's instructive to revisit his earlier work and gain a better understanding of how his iconic pictures came to be.</p>\n                </div>\n                "]},"reco":[{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","title":"How Community Prepared The Russo Brothers for Marvel","tags":"movie news","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame."},{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."},{"id":"6827305d-b11e-44da-9c7c-3746dc274bca","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52086874610_0c8116f5f8_c.jpg","title":"8 Best Anne Hathaway Movies That You Should Start Watching","tags":"movie news","excerpt":"Few actresses have the variety of Annie, who has appeared in everything from rom-coms to Oscar-winning musicals."}]},"__N_SSG":true}