{"pageProps":{"article":{"id":"71d9aa6e-276f-4f36-b1b8-79f1ded363d6","date":"Mar 22, 2022","author":"Nick Carver","title":"Director Says Morbius Has Endless Marvel Crossover Possibilities.","excerpt":"Exclusive: Director Daniel Espinosa discusses potential future Marvel crossovers as Morbius becomes the latest film in Sony's Spider-Man Universe.","keywords":"mcu, sony, morbius, marvel","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51953436092_93676042cf_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As Morbius prepares to hit theaters, the filmmaker believes he's leaving the door open for a variety of potential Marvel crossovers. Sony Pictures is continuing to focus on its other Marvel-related properties following the enormous success of Spider-Man: No Way Home. While not part of the Marvel Cinematic Universe, Sony's Spider-Man Universe of films continues to expand with additional villains from Peter Parker's comic book roster. The experiences of Tom Hardy's Eddie Brock have been chronicled in two films, and Jared Leto is the next actor to bring one of Spider-foes Man's from the page to the screen in Morbius.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Morbius is one of several upcoming Spider-Man characters who will make their live-action debuts, the film will focus on him as an anti-hero rather than a villain. Despite the fact that they reside in distinct universes, there is already one crossover in the works, thanks to Michael Keaton's presence. Despite the fact that Sony Pictures has kept specifics of his involvement under wraps, Keaton's Adrian Toomes, a.k.a. Vulture, from Spider-Man: Homecoming has appeared in many Morbius trailers. Whether or whether this is the same antagonist iteration remains to be revealed.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://wwwflickeringmythc3c8f7.zapwp.com/q:i/r:1/wp:1/w:1/u:https://cdn.flickeringmyth.com/wp-content/uploads/2021/08/morbius-michael-keaton-vulture-1-600x346-1.jpg\" alt=\"mcu, sony, morbius, marvel\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As Morbius approaches its theatrical release, what does Leto's anti-future hero's hold after his solo film? Director Daniel Espinosa spoke with Screen Rant recently about the impending Marvel adventure. When asked about Morbius' status in the broader universe, particularly whether or not Spider-Man exists there, Espinosa adds that there are unlimited opportunities for crossovers and characters from other films and universes coming together.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>Morbius takes place in what you would call the Sony-Verse. If you remember, when Sony released Spider-Verse, they introduced the idea of different timelines that then later Kevin Feige with Marvel took up. It is an idea that has existed within the studio for a long time. We are in what some people call the Venom-Verse. But these worlds have endless possibilities of interacting and trading people or information. Who knows what the future will hold?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the three live-action Spider-triple-crossover Men's in Spider-Man: No Way Home, there's no certainty that Leto's Morbius will interact with any MCU character in the near future. Despite the fact that Hardy's Venom was introduced to the MCU following Venom: Let There Be Carnage, his Spider-Man: No Way Home cameo ended with him being returned to his own realm. Despite appearing to tease that the line between the two universes will become more porous, it appears that the main goal was to build up a fresh Symbiote tale within the MCU, possibly for Spider-Man 4.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Espinosa is most likely referring to the other Spider-Man characters that will be released next in Sony's Spider-Man Universe. While Aaron Taylor-Johnson is presently filming Kraven the Hunter as the eponymous character, Sony Pictures is preparing to release Dakota Johnson's Madame Web. A third Venom picture is also rumored to be in the works, with Hardy reprising his role. Despite the fact that the overall ending for Sony's franchise has remained a mystery, Morbius will almost certainly meet those individuals at some time.</p>\n                </div>\n                "]},"reco":[{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."},{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","title":"Best Barry Keoghan Movies That You Should Watch","tags":"movie news","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’"},{"id":"73c4f89b-1163-4ee9-8669-abeab2a05560","date":"Apr 24, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52025734411_9639bb0e74_c.jpg","title":"The 'Endgame' Plot Point That Influenced the Series Is Revealed by the 'Loki' Writer","tags":"tv news","excerpt":"Loki Season 1 is now available on Disney+. Season 2's release date has yet to be confirmed."},{"id":"746d1140-6058-4fe4-aefe-d9cf8ac88dd1","date":"Apr 24, 2022","author":"Kohei Watanabe","thumbnail":"https://live.staticflickr.com/65535/52025741233_bd8d20eef0_c.jpg","title":"Naruto x Jordan Collaboration Is Teased by Nike","tags":"anime news","excerpt":"In a forthcoming partnership, the legendary shonen franchise Naruto joins forces with Nike's Jordan Brand and Zion Williamson of the New Orleans Pelicans."}]},"__N_SSG":true}