{"pageProps":{"article":{"id":"7a18b13f-67ef-48a9-8715-35704015c3f8","date":"Mar 21, 2022","author":"Wallace Bell","title":"The Creator Of The Squid Game Reveals Plans To Bring Back Actor in Season 2 After Character Death","excerpt":"Will there be a second season of Squid Game after it became the surprise Netflix success that blasted through streaming audiences in 2021?","keywords":"squid game, korean, kdrama","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51952077484_727e913025_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following one character's death in the first season, the creator of Squid Game teases a stunning reappearance for Season 2! Squid Game was one of Netflix's quickest and most popular releases in recent months, and it was such a smash that the streaming provider swiftly announced plans for a second season. But one of the biggest concerns that fans have about the show is that, aside from the possibility of a lightning in a bottle success, a second season will be without the majority of the ensemble that made the first season so popular.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/d5921ecd-40e0-4ef2-a840-cb9913c4058f'>Season 2 Of Squid Game Will Have More Games, According To The Creator</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that several of these fan favorites perished during the first season, it appears that they or their performers aren't completely off the table. During an interview with Deadline at the PGA Awards, series creator and director Hwang Dong-hyuk discussed the possibility of returning characters from the second season.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"No, because most of them are dead. I'll try something to bring them back to Season 2.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://www.thesundaily.my/binrepository/lyfe-121021-page-2-sg1-netflix_1944204_20211012112926.jpg\" alt=\"squid game, korean, kdrama\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Let's say maybe she has a twin sister, you'll see,\" Dong-hyuk joked about HoYeon Jung, who plays Kang Sae-byeok on Squid Game (and has gone on to win some major honors for her work in the series). That is, assuming the series continues as an anthology of some sort; but, if it continues the series' main tale after Gi-hun, there may not be a logical method to do so.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In any case, it's evident that the resurrection of Squid Game is still a long way off. Dong-hyuk even told Deadline that he hasn't even begun scripting the sequel yet. \"There will be more great games, that's all I can say,\" he said. \"I'm just still brainstorming and collecting the ideas for Season 2. I haven't even started with the writing yet.\" That means it while it may seem difficult to bring back characters right now, that might change as the series progresses!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>What are your thoughts? Do you want to see any of the characters from the Squid Game return in Season 2? Which actors or characters would you like to see more of?</p>\n                </div>\n                "]},"reco":[{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."},{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","title":"Best Barry Keoghan Movies That You Should Watch","tags":"movie news","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’"},{"id":"73c4f89b-1163-4ee9-8669-abeab2a05560","date":"Apr 24, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52025734411_9639bb0e74_c.jpg","title":"The 'Endgame' Plot Point That Influenced the Series Is Revealed by the 'Loki' Writer","tags":"tv news","excerpt":"Loki Season 1 is now available on Disney+. Season 2's release date has yet to be confirmed."},{"id":"746d1140-6058-4fe4-aefe-d9cf8ac88dd1","date":"Apr 24, 2022","author":"Kohei Watanabe","thumbnail":"https://live.staticflickr.com/65535/52025741233_bd8d20eef0_c.jpg","title":"Naruto x Jordan Collaboration Is Teased by Nike","tags":"anime news","excerpt":"In a forthcoming partnership, the legendary shonen franchise Naruto joins forces with Nike's Jordan Brand and Zion Williamson of the New Orleans Pelicans."}]},"__N_SSG":true}