{"pageProps":{"article":{"id":"119b2778-91fa-49b5-85ed-bb94dab1f369","date":"Apr 13, 2022","author":"Nick Carver","title":"Maisie Williams Reveals Whether She'd Consider Returning For A Game Of Thrones Spinoff","excerpt":"Maisie Williams, who played Arya Stark in the original series, discusses if she'd consider reprising her role in a potential Game of Thrones spinoff.","keywords":"game of thrones, arya stark, Maisie Williams","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52000704142_b5dbf6f77c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if most Game of Thrones fans would want to see more of Williams' beloved portrayal in the part, the topic of Arya's return is sure to be divisive among fans. Many fans want a complete redo of Season 8, and any future movie or show using any of the original characters would have to deal with the fallout. Williams' careful consideration of the in-universe context before giving any approval appears to be a wise move. While Arya is perhaps the least contentious choice to bring back, given that her story is largely seen as having lived up to its original promise, Williams' careful consideration of the in-universe context seems like a wise move.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While the program featured an ensemble cast of characters with linked stories, Williams' Arya Stark was one of the most popular protagonists, with one of the show's most dramatic arcs. Despite her stubborn spirit, which she shared with the other Stark siblings, she was trained as a Faceless One, which she subsequently used to wreak devastation on her family's adversaries. She became one of the show's most accomplished heroines in Season 8, as she was the one who eventually killed the Night King and defeated the White Walker danger.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Williams is now being questioned in a GQ piece if she would consider repeating her part in a future Game of Thrones spinoff project. While she doesn't rule it out completely, she makes it clear that her response is in no way a confirmation, and that no such return is presently in the works. Williams, on the other hand, would be open to an Arya comeback provided it made sense for both her career and the Game of Thrones world.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>I’m not saying it would never happen, but I’m also not saying it in this interview so that everyone goes… [gasps] 'The spin-off! It’s coming!' Because it’s not. It has to be the right time and the right people. It has to be right in the context of all the other spin-offs and the universe of Game of Thrones. [...] It has to be the right time for me.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52001718021_b9d372f54b_c.jpg\" alt=\"game of thrones, arya stark, Maisie Williams\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if most Game of Thrones fans would want to see more of Williams' beloved portrayal in the part, the subject of Arya's reappearance is sure to divide viewers. Many viewers want a complete redo of Season 8, and any future movie or show returning any of the original characters would have to face with the weight of that criticism. Williams' careful consideration of the in-universe context before giving any approval appears to be a wise move. While Arya is perhaps the least contentious choice to bring back, given that her story is largely seen as having lived up to its original promise, Williams' careful consideration of the in-universe context before giving any approval seems like a wise move.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, the anticipation for the impending Game of Thrones spinoff House of the Dragon indicates that fans are eager to return to Westeros. The new series has the advantage of being set a few centuries before the events of its parent program, which means it doesn't have any of the show's narrative baggage and has a genuine chance of recapturing the enchantment that enchanted so many people around the world. Game of Thrones season 8's failure may even work in its advantage, reducing expectations to the point where any amount of success would be welcomed by returning viewers.</p>\n                </div>\n                "]},"reco":[{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","tags":"tv news","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."},{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","title":"Best Barry Keoghan Movies That You Should Watch","tags":"movie news","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’"}]},"__N_SSG":true}