{"pageProps":{"article":{"id":"6bce8ad0-35c6-41f4-9ca0-5ba14b2e2c78","date":"Apr 15, 2022","author":"Brian Martin","title":"10 Best Superhero Movies Since 2007","excerpt":"These finest superhero films will convert you to a real believer in the cinematic magic of comic books.","keywords":"superhero, comic, dc universe, marvel, mcu, superhero movies","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52005638938_4ee164a2e3_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If you transported yourself back to the late 1980s and told any Wizard Magazine-reading nerd that characters like Groot would be introduced to the public in the future decades, that nerd would label you a liar. However, superhero movies have developed from a genre that Hollywood didn't know how to handle into the only form of blockbuster that regularly makes a lot of money. While the Marvel Cinematic Universe continues to rule the world of film superheroes, it is far from the only game in town. Fans may see Wonder Woman, the Teenage Mutant Ninja Turtles, and Wolverine in a variety of films, with more being released each year.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Since Richard Donner's Superman: The Movie, superhero films have existed as a genre. It's been nearly 45 years since moviegoers first believed a man could fly—and, more crucially, desired to see it again and again. Nonetheless, it appears that our present concept of the superhero film did not mature until 2008. That was the year of The Dark Knight, Iron Man, and the Marvel Cinematic Universe (MCU). The business would never be the same again.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Capes and cowls have progressed from sporadic highs and lows in the mid-2000s to near-total market dominance by the end of the decade. As a result, everyone has their favorites—the films that we consider to be superior to anything that has gone before or since.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, with so many cape-and-cowl films on the market, a critical issue arises: Which films stand out? We're here to answer that question by rating the top superhero movies of the previous 15 years, from the merely impressive to the completely astounding. What are your thoughts on your favorite superhero film? Let's take a closer look and see what we can learn.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Black Panther (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005834579_5090526ac0_c.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>For all the ways that Marvel Studios has broken new ground, Ryan Coogler's Black Panther is undoubtedly the best and most completely paradigm-shifting example. The film not only served as a thrilling, globe-trotting espionage adventure in and of itself, but it also helped to usher the superhero genre, and tentpole-style films in general, into the twenty-first century by breaking down barriers of race both in front of and behind the camera, and providing a new, unconditional hero to millions of fans who could finally see themselves represented on the big screen.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With his breakthrough cameo in Civil War and then headlining this picture, Chadwick Boseman established himself as T'Challa so thoroughly that Marvel has (for the time being) ruled out the possibility of recasting the part. Killmonger, played by Michael B. Jordan, was the other half of the equation, portraying a righteous, multi-layered enemy whose goals were good, even if his methods were perverted. Black Panther was an eye-opening, magnificent insight into what may be when films are open to the world around them, with geopolitics, Afro-futurism, and a deep dive into Black culture all part of the mix.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Captain America: The Winter Soldier (2014)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005639048_f4470d11a8_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Marvel Cinematic Universe quickly realized that it couldn't keep saturating the market with copycat copies of superhero origin stories indefinitely. Captain America: The Winter Soldier was the first sign that the studio was willing to try something new. This First Avenger sequel is as much a paranoid political thriller as it is a superhero picture, putting Steve Rogers at the center of a great sociopolitical plot originating from S.H.I.E.L.D.'s dark core.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Russo Brothers' debut MCU picture is a masterpiece in action filmmaking, with three massive action set pieces and one intimate elevator melee that will undoubtedly go down in history as one of Marvel's best moments.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Chris Evans is fantastic as Captain America once again, but The Winter Soldier recognizes that he is best when he is working as part of a team, with Scarlett Johansson's Natasha Romanoff, Samuel L. Jackson's Nick Fury, Sebastian Stan's Bucky Barnes, and even a villain played by Robert Redford rounding out a fantastic ensemble cast.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Batman (2022)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005638963_0278b926e8_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>I mean, who needs another Batman film, let alone one set in the early years of the Dark Knight's career? With Matt Reeves at the helm, it turns out that's precisely what we needed. Who knew a film as dark and dismal as this could be so entertaining?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There's a good explanation behind this! While The Batman aims to dive into the harsh psychological reality of Bruce Wayne's existence and presents Gotham as the ultimate city that can't be redeemed, it also embraces all of the character's colorful, crazy parts of the DC Comics heritage in surprising and unrestrained ways. With an all-star ensemble and a neo-noir atmosphere that wouldn't have been out of place in the 1970s, The Batman manages to find room for some truly jaw-dropping action and a superheroic heart behind its kevlar armor and black eye makeup.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Captain America: Civil War (2016)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52004558247_8cc08c6108_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When Francis Coppola directed The Godfather, Part II, he stated that his goal was to take the Corleone family at its pinnacle of power and demolish it. With the Avengers' powers and prominence in the MCU at an all-time high, it appears that Marvel Studios intended to do the same with Captain America: Civil War: rip the team to shreds and elevate the stakes for what was to come.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Director Anthony and Joe Russo crafted a spectacle that was virtually Avengers 2.5 in everything but name, two years after proving themselves with the excellent Captain America: The Winter Soldier.\nThey and writers Christopher Markus and Stephen McFeely juggled a convoluted narrative involving a dozen characters, as well as the debut of Spider-Man (Tom Holland) and Black Panther (Chadwick Boseman).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At Leipzig Airport, Team Cap vs. Team Iron Man was as intense as it gets, and the more personal climax—Steve vs. Tony—was so riveting because we don't want to watch these people fight, but they are nearly unable to stop it. Civil War is a top-tier Marvel film because it depicts our heroes at their most vulnerable, yet still attempting to do the right thing.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Avengers: Infinity War (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52004558432_52f4d51eef_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Avengers: Infinity War was an epic in every sense of the term, with a cosmos-spanning narrative, a gigantic ensemble, a breathtaking space opera design (the Russo Brothers' most beautiful film to date), and an eloquently crafted story in which the stakes were clearly set out and really monumental. After tearing the Avengers apart in Civil War, the Russos had to reassemble them, but only in new and frequently amusing ways, offering some respite from the catastrophic predicament.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Making Thanos (an exceptional, multidimensional Josh Brolin) the protagonist was a wonderful idea, but it was also heartbreaking to see the heroes we'd grown to know and love over the preceding decade pushed to their most extreme test yet... and fail. All of the little character arcs, such as Thor's transformation from sadness and defeat to dignity and wrath, Doctor Strange and Tony Stark's mutual hate to respect and friendship, and Wanda and Vision's sacrifice, provided heart and resonance to a picture that could have been a train wreck. No one expected all the threads of the MCU's \"Infinity Saga\" to come together so flawlessly, just as no one expected The Avengers to come together six years earlier.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Thor: Ragnarok (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52004558382_7e9951d1c3_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Marvel Studios must have realized they'd hit the jackpot when they hired What We Do in the Shadows and Eagle vs Shark director Taika Waititi to helm the third installment in their floundering Thor franchise in the latter half of the 2010s, after continuing their search for hot indie talent to helm their big superhero blockbusters. Thor: Ragnarok was a pleasant surprise, not only for those who had grown up watching films from Waititi's eclectic filmography, such as Big Trouble in Little China and Flash Gordon.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Well, he does now, and owing in large part to this breathless 2017 franchise addition, he's poised to become the only Avenger with three sequels to his name. Marvel finally found a way to balance Thor's fantasy elements with his MCU journey in Thor: Ragnarok by killing his father, taking away his hammer, muddying his notion of what his family legacy is, annihilating Asgard, and even ripping out one of his eyes, thanks to Chris Hemsworth's natural comedic talent.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Logan (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52006100210_b80b24ecd9_c.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Hugh Jackman worked for 17 years to develop a Wolverine film that was as personal to him as the character. He and writer-director James Mangold got close in the first half of the underappreciated The Wolverine (2013), but Logan, an elegiac swan song for a great hero and a great star performance in the Unforgiven style, is where they finally discovered their classic. Logan was finally allowed to enjoy the gruesome side of its antihero's claws thanks to the R-rating. However, the film's R rating allowed it to move at a slower pace, allowing it to reflect on the history of this figure, this genre, and this disappearing breed of adult-oriented mainstream filmmaking.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Logan has the elegance to embrace the current peculiarity of franchise and \"universe\" narrative to truly investigate problems of death and faded popularity. It's as much a poetic drama as it is a brutal action movie—and a modern Western, too. It also serves as a wake-up call for Hugh Jackman and Patrick Stewart, revealing new depths to their decades-long performances with the entrance of fatherhood and old age.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Furthermore, the film remains the most important X-Men story depicted in any medium during the twenty-first century, with the arrival of Laura (Dafne Keen), Logan's ferocious Mexican daughter, who, along with her other young friends, is fleeing to the Canadian border to avoid American authorities, giving the social allegory aspect of mutants a visceral new context. They're trying to get out of their shackles. It was released at the start of Trump's administration, and it still has a nauseous ring to it.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Spider-Man: Into the Spider-Verse (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005575806_0e09b29bae_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This beautiful animated feature picture, directed by the powerhouse team of Bob Persichetti, Peter Ramsey, and Rodney Rothman, possibly achieved more to generate a whole new generation of Spider-Fans in 117 joy-filled minutes than all the live-action movies combined. Spider-Man: Into the Spider-Verse is an origin story for Miles Morales, who is bitten by a radioactive spider, falls into the multiverse, and must team up with superheroes from other dimensions to take down mad scientist Olivia Octavius. It features a stellar voice cast that includes Shameik Moore, Mahershala Ali, and Brian Tyree Henry (and the Kingpin).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Who thought a Spider-Man film centered on Miles would become the finest Spider-Man film of all time? For starters, those of us who were already following Marvel's web-continuous slinger's escapades! Thankfully, 21 Jump Street filmmakers Phil Lord and Christopher Miller are also enormous fans, so they agreed to help Sony bring Spider-Man: Into the Spider-Verse to life on the condition that Mr. Morales be a central character.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Avengers: Endgame (2019)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005575971_aab7f24063_b.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In a day when it appears like most properties, particularly superhero ones, are becoming increasingly reliant on fan service, it's easy (and perhaps even reasonable) to wonder when it's being used correctly. But make no mistake: Avengers: Endgame is the finest type of fan service you'll ever see.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Because every Marvel Comics easter egg, every franchise callback, and every cheer-worthy moment was not only flawlessly accomplished, but it was also well earned, and it was all done with the goal of cleanly closing up some of the brand's most important storylines. Every single audience member who made it through the 21 films leading up to it received a 181-minute prize from Marvel Studios. Endgame is far more than a franchise novelty; it's the pinnacle of Marvel Studios' blockbuster formula, brimming with true emotional stakes to match its cosmic grandeur and time-bending narrative. It's been so successful that one has to wonder if Marvel, or any studio, will ever be able to produce another capstone of this magnitude.\nOr even if they should attempt.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Dark Knight (2008)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52005834584_f0f17aa058_c.jpg\" alt=\"superhero, comic, dc universe, marvel, mcu, superhero movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Dark Knight is, without a doubt, at the top of our list. Is there any other possibility? Whether fair or not, the superhero genre was primarily regarded by the industry as \"kids table\" fare prior to the debut of The Dark Knight. Movies that exist just to sell tickets. Christopher Nolan shattered those preconceptions with a criminal epic as broad and harrowing as any in the decade, and one that did a greater job of addressing the fears of the Bush years than genuine films about the War on Terror. All of this happened when a man costumed as a bat punched a \"terrorist\" in clown makeup.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>What stunning makeup Heath Ledger smeared on his own face in a move that 14 years later is still thrilling to watch. Ledger balances rock star swagger with true nihilistic coldness, hardly identifiable behind the scars and that Tom Waits drawl. However, the film is more than simply his legendary performance. The way Nolan employs the famous Joker as a Rorschach test for his heroes, his Gotham, and even his audience to cast all their fears of the abyss onto is why the film soars above the genre.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In that sense, The Dark Knight is possibly the only really great American picture on our list, with a stellar cast that includes Christian Bale's character-defining second turn as Batman, Gary Oldman, Michael Caine, and the sad soul of the film, Aaron Eckhart as Harvey Den.</p>\n                </div>\n                "]},"reco":[{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","tags":"movie news","excerpt":"And why one of the few films that scares him is 'The Thing.’"},{"id":"ea5bcadb-6b70-41d4-aace-29cfb3824434","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52082671695_1bbb5391a0_c.jpg","title":"Where Did 'The Godfather Part IV' Go? The Never-To-Be-Released Sequel","tags":"movie news","excerpt":"Coppola apparently had an offer he couldn't refuse."},{"id":"b94d8c73-15cf-4437-aa16-4ae8334e3208","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52081976178_3f0b96e7ac_c.jpg","title":"The Forgotten Pre-Marvel Action Film of Robert Downey Jr.","tags":"movie news","excerpt":"Interest in the United States is surging like a relic from the past. Marshals is a neglected (and substandard) sequel to Harrison Ford's masterpiece The Fugitive, released in 1998. And there's a reason for it: Robert Downey Jr.'s baby face."},{"id":"7f9dfde0-5d4a-43f6-a1c4-b0f626ef7dab","date":"May 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52074724140_d604f27001_o.png","title":"Christopher Walken Is The Excellent Choice for a God Emperor","tags":"movie news","excerpt":"In Dune: Part Two, Christopher Walken has been cast as Padishah Emperor Shaddam IV of House Corrino!"}]},"__N_SSG":true}