{"pageProps":{"article":{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl.","keywords":"Johnny Depp Pirates of the Caribbean, jack sparrow","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Johnny Depp admits to never having seen Pirates of the Caribbean: The Curse of the Black Pearl. The first Pirates of the Caribbean film, released in 2003, was a huge smash with audiences and launched a multi-billion-dollar franchise. Captain Jack Sparrow, played by Johnny Depp, was introduced to viewers in Pirates of the Caribbean: The Curse of the Black Pearl, a beloved figure who would go on to feature in all four sequels, the most recent of which, Pirates of the Caribbean: Dead Men Tell No Tales, was released in 2017.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The possibility of a sixth Pirates of the Caribbean film has been discussed since before the fifth, but no new information has been released about the project in a long time. The production of a sixth Pirates of the Caribbean film might possibly be hampered by Depp's current legal issues. The 58-year-old actor's troubled marriage with ex-wife Amber Heard has long been the topic of tabloid headlines, and the two stars' bitter spat has now moved to the courtroom, with Depp suing Heard for $50 million in defamation.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Depp's evidence in court against Heard included an unexpected admission: he'd never seen Pirates of the Caribbean: The Curse of the Black Pearl, according to Matthew Belloni, creator of Puck News. Belloni considers Depp's admission \"a baller move,\" noting that he was nominated for Best Actor at the 2004 Academy Awards for his performance as Sparrow.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Johnny Depp just said in court he never saw the first PIRATES movie. Remember, he was nominated for an Oscar for that film. Just a baller move right there.</p>— Matthew Belloni (@MattBelloni) <a href=\"https://twitter.com/MattBelloni/status/1516492621522243589?ref_src=twsrc^tfw\">April 19, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following Jared Leto's recent allegations that he hasn't seen one of his own films in over 22 years, Depp has admitted that he hasn't seen one of his own films in over 22 years. Depp, who has previously stated that he does not enjoy viewing his own films, joins the ranks of Meryl Streep, Joaquin Phoenix, Javier Bardem, and Reese Witherspoon as performers who skip their own films. While it may seem strange that Depp didn't see a film for which he was nominated for an Academy Award, Pirates of the Caribbean: The Curse of the Black Pearl appears to be only the latest in a long series of Depp films that he hasn't seen.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's unclear how Depp's current legal issues will affect the Pirates of the Caribbean franchise's future. Even said, it's becoming increasingly improbable that Depp would reprise his role as Captain Jack Sparrow. The Pirates of the Caribbean series may have to learn to thrive without Depp's presence, with a spinoff reportedly in production with Margot Robbie attached to feature. Many fans believe the latter episodes are notably worse than Pirates of the Caribbean: The Curse of the Black Pearl and the other two original trilogy films, therefore it could be a good thing for the franchise to receive a fresh start.</p>\n                </div>\n                "]},"reco":[{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","tags":"movie news","excerpt":"And why one of the few films that scares him is 'The Thing.’"},{"id":"ea5bcadb-6b70-41d4-aace-29cfb3824434","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52082671695_1bbb5391a0_c.jpg","title":"Where Did 'The Godfather Part IV' Go? The Never-To-Be-Released Sequel","tags":"movie news","excerpt":"Coppola apparently had an offer he couldn't refuse."},{"id":"b94d8c73-15cf-4437-aa16-4ae8334e3208","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52081976178_3f0b96e7ac_c.jpg","title":"The Forgotten Pre-Marvel Action Film of Robert Downey Jr.","tags":"movie news","excerpt":"Interest in the United States is surging like a relic from the past. Marshals is a neglected (and substandard) sequel to Harrison Ford's masterpiece The Fugitive, released in 1998. And there's a reason for it: Robert Downey Jr.'s baby face."},{"id":"7f9dfde0-5d4a-43f6-a1c4-b0f626ef7dab","date":"May 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52074724140_d604f27001_o.png","title":"Christopher Walken Is The Excellent Choice for a God Emperor","tags":"movie news","excerpt":"In Dune: Part Two, Christopher Walken has been cast as Padishah Emperor Shaddam IV of House Corrino!"}]},"__N_SSG":true}