{"pageProps":{"article":{"id":"2d2a043a-6744-4343-b320-79dc5ca864c6","date":"Aug 12, 2022","author":"Brian Martin","title":"Movie Review: Molly’s Game","excerpt":"Molly's Game, Aaron Sorkin's first film as a filmmaker, has a lot to chew on. Here is our analysis.","keywords":"Molly’s Game, Netflix Movies, Idris Elba","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52280227358_0d847987e5_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Aaron Sorkin is one of the very few screenwriters who is well-known and prominent enough to inevitably enter the awards season discourse whenever he gets a new film made, similar to how Meryl Streep is to performing. And here is Molly's Game, just in time for the year's finale.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Social Network, Moneyball, and Steve Jobs, three of his most recent nominated screenplays, are all based on real-life individuals, as is his debut as a filmmaker. Molly Bloom, the \"self-proclaimed Poker Princess,\" made headlines a few years ago when it was revealed that she was the brains behind a prominent underground poker business that was visited by celebrities, CEOs, and mobsters. Molly's Game is an adaptation of the memoir of the same name.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Jessica Chastain portrays the main character throughout the course of 12 years, from the tragedy that derailed her youth dreams of competing in the Olympics to the FBI sting operation when she is apprehended for making money from illicit gambling. The movie then shifts elliptically between her ascent in the world of high stakes poker and her attempts to avoid going to jail with the aid of meticulous former prosecutor Charlie Jaffey. That's only the first 10 minutes (Idris Elba).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>You can clearly understand what drew Sorkin to this specific narrative, and his devoted followers will be able to immediately recognize his work. Based on a true story, it is a fast and incisive drama that is built on court depositions and clever banter between smart individuals. However, for his debut directorial attempt, he certainly hits the ground running, whether you love or detest his clichés.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It is less similar to his two major tech biopics than it is to Moneyball and, shockingly, to the playful tone of Charlie Wilson's War in terms of his prior filmography. Although Molly is not a Zuckerberg or Jobs, her self-aware account of what happened—a narrative technique that could have gone horribly wrong—illuminates the drama without descending into self-parody.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>By extension, it is simple to understand why Chastain was drawn to the movie as well. As wonderful as this year's Miss Sloane was, there's no denying the genuine deal here: nobody else working today turns up the conversation RPM to screwball levels like Sorkin does. She has already demonstrated her dedication to strong female lead parts in that picture.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>But there are no parallels between the two titular characters, and Chastain makes for endlessly entertaining character changes throughout the movie as she alternately realizes that she's in over her head in one aspect or is determinedly making her way in a field that is clearly controlled by males.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52280227328_40a0bfc7de_b.jpg\" alt=\"Molly’s Game, Netflix Movies, Idris Elba\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Elba is in fine form as the prosecutor who is unnerved by his client's lack of malice and continuously agitated by her moral position, keeping her word and standing up for her clients even when given the option of a plea bargain that would spare them from going to jail. They work well together, especially as the movie progresses, keeping the drama moving when it returns to Charlie's workplace in the present.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Due in part to Molly's narration of what it means when a player loses rather than focusing on how they lose, you don't need to be an expert at poker to enjoy this book. It's hardly Casino Royale, but Sorkin does a good job of engrossing you in watching others play cards by skillfully portraying the regulars at Molly's as unlucky, cautious, and Chris O'Dowd before watching them till they flip the tables. Yes, Chris O'Dowd included.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Names are changed to protect the rich and famous (who, for some reason, didn't want to play themselves); Michael Cera plays Hollywood actor Player X in a shark-like performance, and Joe Keery from Stranger Things plays an immature trust fund child dressed in full Steve Harrington regalia. The movie smartly concentrates on Molly's arc rather than the scurrilous specifics, even though some individuals' names are known from the book that served as inspiration (at one point, Molly had cause to avenge Player X, and I wondered if it would emerge out that she created a draft of Spider-Man 3).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In other scenes, Kevin Costner, who plays Molly's father and is a psychology professor, does some outstanding work. Through both his athletic training of Molly and his strict parenting style, he instills in her a fierce desire. But anybody offended by Jonathan Kent's stunning lax attitude in the DC movies will appreciate his father work in this movie, as his major scene is one of the highlights when the movie inevitably changes into lengthy character-defining speeches towards the conclusion. Anecdotally, no horses perished while creating this image.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>For Sorkin aficionados, its 140 minutes pass more quickly than they should, but if you're even somewhat fed up with his self-satisfied approach, this is exceptionally Sorkin-like material. However, Molly's Game is a watchable and adoring depiction that plays for and extracts more subtlety from its core character than a just tabloid curiosity, making it one of the season's more enjoyable mature films.</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}