{"pageProps":{"article":{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","title":"What has Marvel planned for MCU Phase 5?","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?","keywords":"mcu, marvel, phase 5, kevin feige mcu","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>What direction is the Marvel Studios film universe taking? Many fans are wondering that, and you could get the answer to it sooner than you think. Recently, it was revealed that Kevin Feige will soon—in the coming months, in fact—finally provide more information on Phase 5 of the MCU.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>But the head of Marvel Studios says that for those who have been paying attention, it shouldn't come as much of a surprise. I think there have been many signs previously, that are at least evident to me, of where this whole narrative is headed, he said in an exclusive interview with Total Film. So, what has already been hinted at in prior projects, and where do we think Phase 5 may be going based on that information?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The next phase of Marvel may be the craziest ever, with brand-new teams, epic comic book storylines, and dangers bigger than Thanos!</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Young Avengers</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52181562466_393c910e86_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if a group of Avengers foes is being assembled, it doesn't rule out the possibility of another team made up of the Earth's Mightiest Heroes. The Young Avengers, a tremendously popular group in the comics, are one of the most clear areas that the MCU looks to be moving in.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Younger heroes have started joining MCU big and small screen ventures, frequently learning from their elder mentors. America Chavez as Ms. America, Kate Bishop as Hawkeye, and Kamala Khan as Ms. Marvel have all already donned their superhero costumes. Along with Eli Bradley, the future Patriot, Cassie Lang, alias Stature, and Billy Maximoff, the future Speed and Wiccan, respectively, the MCU has welcomed Tommy and Billy Maximoff.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Thunderbolts</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52182051300_a337fee946_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Whether it's the Thunderbolts or the Dark Avengers, it's clear that throughout Phase 4, a significantly more evil unit is being created. In both Black Widow and The Falcon and the Winter Soldier, Valentina Allegra de Fontaine (Julia Louis-Dreyfus) has established herself, strengthening her future squad.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At this point, John Walker is essentially a member who has accepted the role of US Agent. Yelena Belova appears to have been coerced into cooperating with the Contessa, and it is probable that she will don the White Widow costume and join the gang. The Abomination (Tim Roth) has also been set up to join the team, with hints as varied as his unexpected appearance in She-Hulk to his startling reappearance in Shang-Chi and the Legend of the Ten Rings.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's unclear if anybody else will join the squad, but Taskmaster, Zemo, and Ghost are all likely options. It's clear that Valentina has far bigger plans, and she might not be operating alone. Phase 5 will undoubtedly reveal her plan and mark the debut of this unexpected crew as a unit. Playing off the established ideas of Walker's portrayal of Captain America, they may even be heroes themselves, much like in the first comic book run.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Kang the Conqueror</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52181564663_c041d815cc_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It needed to be resolved! Everything points to Kang. The time-traveling conqueror has previously been observed seeking to preserve a single holy timeline under the guise of He Who Remains in Loki. That isn't occurring anymore because of Sylvie, which allows Kang a chance to attack.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Kang appears in so many different ways in comic books, from Iron Lad (who is closely related to the Young Avengers story) to Rama-Tut, an Egyptian pharaoh who could be connected to Moon Knight's mythology. It has been revealed that the adversary will appear in Ant-Man and the Wasp: Quantumania, and it is almost expected that Loki Season 2 and Fantastic Four will do the same.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Given that Kang can figuratively bend time to his will, it is reasonable to suggest that he may be more powerful than Thanos. The roster will need to be of the highest caliber ever if that is the challenge the Avengers will be facing in Phase 5. But as far as hints go, Kang is right there in front of everyone right now.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Skrull Invasion</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52181564368_95995671b7_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It was always quite simple to figure out who to hit at the end of the first MCU phases because Thanos served as the main antagonist. The Skrulls may be a different adversary in the future of the universe that poses a significant danger in an unexpected manner, more in line with their appearance in Marvel Comics.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Skrulls were first presented in Captain Marvel, when they were unexpectedly seen as allies by comic book readers. Since then, a few Skrulls have infiltrated humanity, as seen in the films Spider-Man: Far From Home and WandaVision. What is the purpose of this? That should be addressed in the upcoming Secret Invasion on Disney+.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The truth about the Skrull infiltration will be revealed by Nick Fury and Talos, but perhaps things won't end there. Currently, it is believed that the streaming series will wrap up the story, but it is absolutely conceivable that the Skrulls are just too entrenched for that to happen. It's time to make educated guesses about who may have been an extraterrestrial all along. Sharon Carter, without a doubt, right?</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Midnight Sons</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52182051400_09b4bc01d7_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Midnight Sons, a squad made up of otherworldly entities from around Marvel, have already seemed to have attempted to be brought together on the horror side of the company. In the original text, werewolves, witches, vampires, and sorcerers banded together to stave off evil powers. The universe now prominently features characters like Black Knight, Moon Knight, and supernatural beings like Doctor Strange. Both Morbius and Blade will soon be released. Additionally, Werewolf By Night is en route. There is definitely a pattern here!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If we ignore the Defenders arc, it appears that Marvel is allowing its programs to become darker than before. There is a lot of material to cover with Midnight Sons because those horror themes are difficult to ignore and because so many excellent characters, like Ghost Rider, have yet to be introduced. Fans are looking for this sort of series since it is a route that no other phase has yet pursued.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The abolition of the Darkhold must have some sort of effect on the multiverse that only darker minds can resolve. It could be a long-term strategy, and it most certainly won't be the main focus of Phase 5.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Secret Wars</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52181811499_9896f2efec_o.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The more current rendition of Secret Wars, a comic book event that saw the Ultimate Universe crash with Earth-616 and pitted Marvel's heroes against one another on a dimension of reality called Battleworld, is an expansion of that Kang story. A multiversal menace that wreaked havoc throughout the cosmos was described by He Who Remains. With What If...?, the MCU has made a significant multiverse-centric bet. Loki, Doctor Strange, and Spider-Man: No Way Home in the Multiverse of Madness. Most likely, this is only the beginning.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The current Secret Wars iteration in the comics played out pretty similarly on a multiversal level, so there is absolutely a means to bring in former Marvel alumni, just like the other incarnations of Spider-Man or Professor X. How might the MCU beat the Avengers: Endgame gateways sequence? By elevating it to a Variant level and including several permutations of Marvel's adored heroes and antagonists. Loki essentially informed us all that the initial venture into the universe would be fast expanding into other planets.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Mutants</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52181562296_aed012aaf6_o.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If the company decides to embrace mutants, super-powered beings will fundamentally alter the face of Marvel moving forward. Before Multiverse of Madness, Wanda Maximoff's potential unique abilities were the only hint that there were mutants in the Marvel Cinematic Universe. Even if she is the original Scarlet Witch, an X-gene may still play a role in her appearance.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>But everything has changed since Professor X showed up; his entrance was no longer a subtle suggestion but rather a massive megaphone. The X-Men may be able to travel around the multiverse indefinitely, and it may even send mutants to Earth-616. However, Wanda's personal tale may have the opposite effect of the \"No More Mutants\" story arc, which witnessed the extinction of the species in the comics. Right now, any approach is absolutely possible, and Phase 5 will eventually have to deal with it.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Deadpool is the unknowable element in all of this. There will be a third chapter of The Merc with a Mouth, which will take place in the MCU (and all the fourth-wall-breaking that comes with that). The movie Deadpool 3 may be the first to properly include mutants on Earth-616.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Defenders</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52182051640_e352e37eb1_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even though there had always been speculations, Daredevil fans were pleasantly surprised to learn that Matt Murdock appeared in Spider-Man: No Way Home. The following appearance of Kingpin in Hawkeye hinted to a bigger scheme. Are the Defenders on their way?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The casts of the Netflix programs that were canceled might appear in a variety of future projects, most notably Jessica Jones for She-Hulk and any number of characters in Echo. This street-level concentration may adopt a strategy similar to the horror strategy: a side project that aims to broaden the many facets of the Marvel Universe. The Defenders saga's arrival on Disney+ only serves to strengthen the idea that Marvel Studios intends to revive that universe soon.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's an intriguing possibility, but there isn't much of an end in sight. The most logical tale to tell with these street-level individuals would probably be Shadowland, an arc in which a corrupted Daredevil led the Hand and established a totalitarian state in New York. However, that hasn't been alluded to in the official MCU narrative.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Galactus</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52180538937_96cf12158f_b.jpg\" alt=\"mcu, marvel, phase 5, kevin feige mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The concept that a monster deity of epic proportions was endangering the Earth was first presented in Eternals. That the planet's fate would be decided by the Celestials themselves, who would judge it. Galactus may be part of the grand scheme to wipe off the Earth in the end!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There aren't many such large-scale dangers that are as terrible. One of the Fantastic Four's most formidable foes must be close behind with the Fantastic Four ready to enter the MCU. Given how frequently Kang has been teased, it's an unusual pick for a terrible guy. With all this talk of enormous entities, Gorr the God Butcher's mission to eliminate these amazing deities could well be a prelude to the most powerful of them all. Let's hope he's not simply another enormous CGI cloud!</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}