{"pageProps":{"article":{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers.","keywords":"Daredevil Born Again MCU","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It has now been announced that Daredevil will return, this time on a different streaming service, Disney+, after months of hints and rumors. Charlie Cox played the blind lawyer/superhero Matt Murdock in the three-season Netflix original series, and Vincent D'Onofrio played Wilson Fisk, the Kingpin of Crime. Additionally, the series had some of the most brutal superhero action since Punisher: War Zone. Many believed that Cox and D'Onofrio would have to reduce the brutality once they entered the MCU, which is much more family-friendly. However, the new series' subtitle calls it into doubt.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>MCU president Kevin Feige stated that the 18-episode Daredevil: Born Again would debut on Disney+ in Spring 2024 during the Marvel panel at SDCC. The subtitle most commonly only alludes to Cox's return to the role after a six-year absence. However, the title relates to one of Daredevil's finest and most depressing tales for comic book fans.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Born Again\" appeared in Daredevil #227–231, and it was written by Frank Miller, illustrated by David Mazzucchelli, lettered by Joe Rosen, and colored by Christie Scheele. The plot starts when a drug-addled Karen Page gives the Kingpin the persona of Daredevil in exchange for a fix. Using this knowledge, Fisk dismantles Murdock's life piece by piece, leaving him destitute, penniless, and extremely paranoid. Daredevil joins forces with Captain America to take on the insane super-soldier Nuke after helping Karen get sober and recommitting himself to justice.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>There is still enough of \"Born Again\" left for the Disney+ program, even if portions of it were already utilized in the first and third seasons of the Netflix series. Although Cox appeared in Spider-Man: No Way Home and will appear in She-Hulk: Attorney at Law and Echo, we are unsure of when he will next interact with his associates Karen Page and Foggy Nelson (played by Deborah Ann Woll and Elden Henson on Netflix). It would be beneficial to demonstrate Matt's new status quo and offer a theory as to why Karen and Foggy have been absent by using the \"Born Again\" narrative.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, \"Born Again\" is a considerably darker plot than anything else we've seen in the MCU to date. Along with the terrible fight between Nuke and Daredevil and Kingpin's total cruelty, the plot also makes Matt really consider killing himself and giving up. Even the conclusion, in which Murdock develops fresh resolution, is motivated by a desire to give up material possessions—a desire that is considerably more austere than anything Bruce Banner has ever displayed while evading capture. Daredevil is pushed to darker realms in \"Born Again\" than most people ever are.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Disney+ has recently pushed the limits of its rating by adding Netflix series and R-rated films like Logan and Deadpool. Additionally, the MCU has always desired to create diverse tales and incorporate Deadpool into the main world. Marvel will have the opportunity to go toward those barren areas with Born Again while keeping ties to Spider-Man, Hawkeye, and other core characters.</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}