{"pageProps":{"article":{"id":"af273c9d-f94b-4628-945e-283d60793b08","date":"Aug 9, 2022","author":"Brian Martin","title":"Predators Is Still The Franchise's Underrated Sequel","excerpt":"People are ignoring the last successful Predator sequel, Predators (2010) with Adrien Brody and Alice Braga.","keywords":"Predator Franchise, Predators, Arnold Schwarzenegger Predator, Adrian Brody Predator","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52273645779_a039aa5ddc_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>One must be aware of the status of 1980s movies in order to truly understand the legacy left by the first Predator. Action in the 1980s embraced extravagance after decades of heroes like John Wayne and Clint Eastwood. Large men like Sylvester Stallone and Arnold carried large weapons to cause large explosions and utter large insults. Predator, which for most of its first half acted as the most outrageous 1980s action movie, both embraced and undermined these films. In addition to showing us the heroes causing havoc, McTiernan spends a lot of time boasting about their physiques and sexual prowess. The movie settles into its premise, though, when the Predator shows up and decimates the commandos: these men may be large, but there's always someone greater.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Things had altered by 2010. Action movies were in a slump the same year that Schwarzenegger and Stallone would launch the \"Geezer Teaser\" subgenre with The Expendables. Action movies lacked a distinct identity because The Matrix's light had been dimmed by too many poor imitators and because The Raid: Redemption was still a year away. The upcoming producers Robert Rodriguez and Nimród Antel couldn't base their film in any cultural context.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Rodriguez and Antel used character performers in place of well-known action icons. Predators included performers that would either go on to become more well-known later in their careers, such Mahershala Ali and Walton Goggins, or who were recognized for dramatic or humorous parts, like Topher Grace and Alice Braga, with the possible exception of Danny Trejo and Oleg Taktarov. They each portray various types of human killers: Braga as an Israeli Defense Force sniper (supposedly because stupid Americans can't tell the difference between a Brazilian and an Israeli) and Louis Ozawa Changchien as a Yakuza assassin. Ali plays a death squad soldier from Sierra Leone. The crew battles the trio of Predators proving their talents on a planet that serves as a game reserve in an effort to survive.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52273874490_7005179530_b.jpg\" alt=\"Predator Franchise, Predators, Arnold Schwarzenegger Predator, Adrian Brody Predator\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Predators shouldn't function in theory. Despite the performers' talent, the roles they play are essentially cliches. The Nikolai played by Taktarov is a huge Spetsnaz soldier who wields a chain gun and exhibits mushy family talk. Hanzo played by Changchien keeps a low profile and is silent, showing the missing fingers on his hand, and dies in a valiant combat with a Predator. They are as rooted in their culture as the fighters from Mike Tyson's Punch-Out.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>But it's just that absurdity that gives Predators their power. The best example of this is Brody's portrayal of Royce, an ex-mercenary from the special forces who claims to just care about himself but is continually helping the other members of the gang. Brody, who is typically lanky, definitely bulks up for the film and looks fantastic during the expected shirtless confrontation at the conclusion. However, he seems to be portraying a tough guy in parody by whispering all of his sentences in an amusing manner. Brody attempts to convey weary with his raised eyebrows and furrowed eyes, but anyone who views him seriously sees confusion in his expression.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A brief but magnificent appearance by Laurence Fishburne as Noland, an air cavalry trooper who has been residing on the planet for some time, brings into sharp focus Brody's performance. Fishburne dominates the frame as he chastises the others for making too much noise when they go through the forest or take in his supplies. Fishburne lends his intimidating presence to the scenario. But when we begin to see that Noland is completely insane and prone to yelling at an imagined companion, Fishburne puts all of his comic skills to bear, creating a sequence that makes it clear that the entire situation is absurd. Fishburne enters to remind everyone that this is a movie about ugly aliens tearing out the spines of helpless people, regardless of what Brody and his other top-tier performers were attempting to communicate about the nature of collaboration or redeeming one's past.</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}