{"pageProps":{"article":{"id":"da2ac8ca-4ac5-408f-b8e9-9d64a98bb5fc","date":"Mar 21, 2022","author":"Kohei Watanabe","title":"Popular Basketball Anime Slam Dunk Returns Fall 2022","excerpt":"Takehiko Inoue, the creator of the basketball film, will write and direct it.","keywords":"anime, sports, basketball, slam dunk, hanamichi sakuragi","tags":"anime news","thumbnail":"https://live.staticflickr.com/65535/51952149230_24105eecc0_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The venerable basketball animation has returned! Slam Dunk will return in the fall, with creator Takehiko Inoue writing and directing the script. The timing could not be better after such a long gap.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Slam Dunk premiered as a manga in Weekly Jump in 1990 and ran for six years until being cancelled. It wasn't the first basketball manga, but it was a great phenomenon in Japan, selling over 120 million copies and inspiring a hugely popular anime series that aired from 1993 to 1996, as well as four animated feature films.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Inoue initially revealed the upcoming film on Twitter in January, as reported by Kotaku at the time.\nWe now know that everything is on track, and that the picture will be released later next year.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://tz-mag-media.s3.ap-southeast-1.amazonaws.com/wp-content/uploads/2021/01/11162302/slam-dunk-gets-a-brand-new-movie.jpg\" alt=\"anime, sports, basketball, slam dunk, hanamichi sakuragi\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This is a crucial program for anime enthusiasts of a certain generation. Slam Dunk is one of the most influential sports manga and anime of all time. It has a freshness to it, with interesting characters that pique the interest of even non-basketball aficionados. The characters are amusing, and the manga has aided in the further popularization of basketball in Japan, much like Captain Tsubasa did for soccer.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/2a353adb-5a82-48c6-bac1-c7d341b195a6'>Top 15 Greatest Sports Anime of All Time</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many of the references to NBA stars of the time, such as Michael Jordan and Patrick Ewing, went unnoticed by many readers at the time. It wasn't required for readers to catch all of the nods and homages. What was evident was Inoue's enthusiasm for the game.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Kids in Japan who had never followed basketball before became followers, and the comic appealed to both young men and women. My wife, who was born in Osaka, developed a strong interest in Slam Dunk. She was more interested in the story and characters than in the sport. Any new interest in basketball was a plus for her and others growing up in Japan in the early 1990s.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>After years of languishing on the periphery, Japanese basketball is now coming into its own decades after its inception. Rui Hachimura and Yuta Watanabe, for example, are NBA players, and the national women's team recently won silver at the Tokyo Olympics.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Slam Dunk is making a comeback, and it's an even better time to be a basketball fan in Japan.</p>\n                </div>\n                ","\n                <div class='ArticleBody_relatedNext__4ybLJ'>\n                <p class='ArticleBody_relatedCap__07hkO'>READ NEXT:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='1081276b-522a-4916-a42a-5d68ac95d642'>Season 5 of Haikyuu!! is Coming. Here’s What You Can Expect</a>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}