{"pageProps":{"article":{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium.","keywords":"james gunn, peacemaker, dc, dcu","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A videotape of the Peacemaker introduction dance routine being replicated for a high school talent event has prompted director James Gunn to respond. The series, which stars John Cena as the titular hero/antihero, is a direct spinoff from James Gunn's The Suicide Group, and follows the vicious mercenary as he is recruited by Amanda Waller's A.R.G.U.S. to join another black ops squad. They've been tasked with dealing with an extraterrestrial menace in the shape of parasitic butterfly-like organisms who've taken up residence in human bodies.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn established the tone for his series with an exhilarating, choreographed introduction dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" Gunn set the tone for his series with an exhilarating, choreographed introductory dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" \"No kidding, we shot the actual opening in a school auditorium not so different from that,\" Gunn said to a tweet showing the sequence being reproduced for a high-school talent competition.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No kidding, we shot the actual opening in a school auditorium not so different from that. <a href=\"https://twitter.com/hashtag/Peacemaker?src=hash&amp;ref_src=twsrc^tfw\">#Peacemaker</a> <a href=\"https://t.co/S9IsLv8ReU\">https://t.co/S9IsLv8ReU</a></p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1507732545470971905?ref_src=twsrc^tfw\">March 26, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker has already been renewed for a second season, so fans will be interested to see what happens with the beginning dance sequence as fresh episodes air. Given that several of the characters from the original scene are no longer alive, such as Annie Chang's Detective Sophie Song and Robert Patrick's Auggie Smith, the sequence is likely to be re-choreographed and re-filmed. The launch date for Peacemaker season 2 has yet to be revealed, so fans may have to wait a while to watch more of John Cena's dance moves.</p>\n                </div>\n                "]},"reco":[{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."},{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"}]},"__N_SSG":true}