{"pageProps":{"article":{"id":"752f193e-a990-4687-80d9-2b09f15e536b","date":"Jul 15, 2022","author":"Brian Martin","title":"David Fincher’s Zodiac: 15 Years Later","excerpt":"Why the Zodiac Killer is still a ghostly presence in our lives years after David Fincher's masterpiece.","keywords":"David Fincher movie, Zodiac","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52217253121_c911bcc830_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Zodiac by David Fincher has been around for almost 15 years. The two-hour, 38-minute movie chronicles the Zodiac Killer's years-long police and media investigation. The serial killer committed five murders and wounded two more in northern California between 1968 and 1969. There have been a number of further murders that may have been committed by the Zodiac between 1963 and 1972, but none of those have ever been proven. A large number of suspects who have appeared over the years has failed to provide a clear solution to the issue of who the Zodiac is. The Zodiac himself, who penned a series of letters to the press, was never apprehended.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>With Zodiac, Fincher didn't set out to create a fast-moving, gory thriller like his earlier masterpiece Seven; instead, he wanted to create a meticulously researched procedural more like to All the President's Men. The movie followed the tenacious efforts of a newspaper cartoonist-turned-amateur investigator named Robert Graysmith (Jake Gyllenhaal), a loose-cannon journalist named Paul Avery (Robert Downey Jr.), and two San Francisco police detectives, Dave Toschi (Mark Ruffalo) and Bill Armstrong (Anthony Edwards), as they followed their leads and hit dead ends after dead ends as the case took a toll on their personal and professional relationships.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Some of the essential elements that turned Zodiac into a quiet, profoundly unsettling masterpiece included the director's recreation of the original Zodiac killings, his attention to historical detail, and the almost obsessive focus on the main characters as they delve deeper into the mystery only to unearth more clues. The entire cast was excellent, but Chloe Sevigny, Elias Koteas, Brian Cox, and especially Charles Fleischer as a man who may be connected to the Zodiac killings (and whom Gyllenhaal interviews in one of the movie's most disturbing scenes) and John Carroll Lynch in a genuinely chilling performance as Arthur Leigh Allen, who at one point in the investigation emerged as a prime suspect, helped to elevate the cast's overall excellence.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's obvious that Fincher and screenwriter James Vanderbilt, who adapted the story from Graysmith's Zodiac books, intended for the audience to believe Allen was the murderer as well. And nobody could be blamed for thinking so. The cinematic Allen practically tattoos \"I am the Zodiac\" on his forehead in the jaw-dropping interrogation scene where he calmly and almost gleefully displays his Zodiac watch to three detectives while casually mentioning that the trunk of his car is full of bloody knives, to the dramatic scene where Graysmith confronts him in a hardware store only to be met with a cold, dead-eyed stare.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52217734465_d86e2939c2_b.jpg\" alt=\"David Fincher movie, Zodiac\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In reality, there was a ton of circumstantial evidence that pointed to Allen as well: he did wear the Zodiac brand watch (which featured the same cross-circle symbol found in the Zodiac's letters), he owned the same typewriter as the one used to write at least one of the Zodiac's letters, and he briefly resided close to the scene of one of the murders. He shared the same shoe size as the Zodiac, was targeted by a number of other attacks, and was in the same area of numerous additional assaults. In-depth handwriting analysis and subsequent DNA testing, however, provided some evidence, though not proof, that Allen, who passed away in August 1992 at the age of 58, was not the killer.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As far while we are aware, the Zodiac did not murder any more people during the subsequent years as the case mostly fell cold. However, after Allen's passing and the failure to establish a physical link between him and the murders, a number of additional suspects—some more believable than others—came to light. Richard Gaikowski in particular has become to be a favorite of online detectives. He was briefly under investigation in 1986 but was never formally designated a suspect. But since 2009, additional fascinating information about him has come to light.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gaikowski, a former editor at the anti-establishment Good Times newspaper in San Francisco, resembled the composite police sketches created of the Zodiac, and the patterns of his life (where he lived, when and where he moved, etc.) placed him close to at least two victims, Paul Stine and Darlene Ferrin (the third known victim of the Zodiac) (who was killed while driving a cab). Gaikowski's voice was recognized as the killer's by a police dispatcher who answered a call from the Zodiac in 1969, despite handwriting analysis coming up empty. Gaikowski was detained for relatively minor infractions in the 1960s, but no fingerprint records exist. He passed away in 2004, and unlike Arthur Leigh Allen, there was never enough evidence to support an arrest.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The fact that we are still no closer to understanding who the Zodiac was ten years after David Fincher's film makes it all the more potent. The movie simply sort of drifts out with its protagonists feeling defeated, perplexed, and frequently permanently injured; it doesn't actually finish. Its nihilistic, unsettling conclusion reflects the unsettling nature of American society as we said goodbye to the 1970s and entered an era that, in retrospect, began laying out the blueprint for our current national nightmare. It is the director's ultimate commentary on the time period in which it was set and the mindset of the people living during that time, including the psychopath who terrified them.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In addition to leaving us with one of the best movies of the twenty-first century, Fincher also provided a disturbing look at how one deranged human mind can appear out of nowhere, wreak havoc on anyone or anything that stands in its way, and then vanish into the mists of time while leaving behind a legacy of destruction and horror.</p>\n                </div>\n                "]},"reco":[{"id":"3cfede31-3851-4678-8206-57cce069bfc7","date":"Aug 11, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52278291344_a1f6726856_o.png","title":"Every Final Destination Movie, Ranked","tags":"movie news","excerpt":"The one involving the bridge or the one with the jet crash? We attempt to determine which Final Destination film is the finest."},{"id":"8ef2fc57-dad6-4a5e-9cd1-c9cf61c4931d","date":"Aug 9, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52272473257_8eaa597711_o.png","title":"Does Moon Knight Deserve a Second Season?","tags":"tv news","excerpt":"According to a social media post, The Fist of Khonshu will return for a second season. Is that, however, a good thing?"},{"id":"af273c9d-f94b-4628-945e-283d60793b08","date":"Aug 9, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52273645779_a039aa5ddc_o.png","title":"Predators Is Still The Franchise's Underrated Sequel","tags":"movie news","excerpt":"People are ignoring the last successful Predator sequel, Predators (2010) with Adrien Brody and Alice Braga."},{"id":"8352dd3a-6338-4f6a-8cfe-ee0c310542af","date":"Aug 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52264573404_6fb9941d68_o.png","title":"How The Summer Blockbuster Was Reimagined By Inception","tags":"movie news","excerpt":"The best movie of the last decade was Christopher Nolan's Inception. A format-bending summer blockbuster is remembered."}]},"__N_SSG":true}