{"pageProps":{"article":{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","title":"Best Korean Horror Films That You Should Watch","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category.","keywords":"Korean horror movies ","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>You're losing out if you limit your Halloween viewing to the United States and the United Kingdom. International horror movies might be among the scariest. Although social horror hit Squid Game has recently made headlines in Korean pop culture, the nation's film has been expertly frightening us for decades. Here are three Korean horror films you should watch this Halloween, from the monster mayhem of Bong Joon-The ho's Host to the unforgettable horrifying conclusion of Park Chan-Oldboy. wook's</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Red Shoes (2005)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52226697360_2240db3780_o.jpg\" alt=\"Korean horror movies \">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Red Shoes is a South Korean horror film that draws inspiration from the same-named story by Hans Christian Andersen, published in 1845. In the movie, a young woman named Sun-Jae (Kim Hye-Su), who had recently ended her marriage, picks up a pair of cursed red shoes at the railway station and brings ill luck to everyone around her.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The way in which the supernatural horror and criminal investigative subgenres are successfully combined in the film will have audiences on edge the whole time. The movie's use of color and music is also noteworthy; they increase the intensity of the parts that need it and make viewers choke along with the characters. Last but not least, the cast gives a great performance.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Gonjiam: Haunted Asylum (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52226697385_f4a39701ba_b.jpg\" alt=\"Korean horror movies \">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gonjiam: Haunted Asylum follows a Grave Encounters-style film team as they go on an investigation of a well-known haunted asylum. The film team feels that if they live stream the incident, they would make thousands of dollars due of the countless web films that show individuals who have attempted and failed to explore it without getting wounded.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gonjiam: Haunted Asylum, while adhering to the now-familiar and frequently-used found-footage style, does so in a very novel way, with believable dialogue in the form of character banter and behind-the-scenes jokes, and a pacing that, while effective in setting up the story, cannot adequately prepare its audience for the utter terror that it soon starts to deliver.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Thirst (2009)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52226210851_83c5d17163_o.jpg\" alt=\"Korean horror movies \">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>How's that for \"elevated horror\"? Park Chan-interpretation wook's of the vampire genre is a rough version of Zola's Thérèse Raquin and shares a lot in common with the current Netflix series Midnight Mass. Song Kang-ho, a regular for director Park, plays priest Sang-hyun, who, after agreeing to participate in a vaccine study, is slain and then brought back to life with vampire blood.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>He suddenly develops a passion for sex and human blood and has an affair with his boyhood friend's wife, which swiftly becomes perilous for them both. The lavish, seductive, and passionate epic Thirst is laced with the dark humor of filmmaker Park. It's stunning, gruesome, and somewhat heartbreaking; for aficionados of vampires, a must-see.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Wailing (2016)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52226697460_1b9b2174a4_b.jpg\" alt=\"Korean horror movies \">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's a strange movie, The Wailing. It's excessively long for a horror film at 156 minutes, but for good reason. After all, what starts out as a police procedural quickly transforms into a ghost story and a zombie film with demonic possessions and small-town dread, frightening youngsters, violent family members, paranoia, superstition, shamanism, and other weird things. The Wailing keeps you on your toes right up to the heartbreaking closing seconds despite the fact that there is a lot going on. It is also surprisingly tonally consistent and very unnerving.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In the movie, a mysterious Japanese visitor enters a small South Korean community. Villagers soon after his arrival begin exhibiting weird infection-related symptoms that finally force them to murder their families. Cops looking into one of these murder cases encounter a strange lady who claims the stranger is to blame for the epidemic. Before his daughter becomes the next victim, one of the officers must unravel the mystery after discovering a piece of his daughter's property at the stranger's home. Strange, unsettling, and sending you down a rabbit hole, this original horror film deserves all the praise it received when it was first released.</p>\n                </div>\n                "]},"reco":[{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."},{"id":"752f6e9c-cfc6-413b-af02-bbae594c1c78","date":"Jul 21, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52231320065_743420415e_o.png","title":"The Reason Why Game of Thrones Spinoff Bloodmoon Was Canceled","tags":"tv news","excerpt":"The original concept for a Game of Thrones spinoff from HBO was bold and unique but maybe too much."},{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","tags":"movie news","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”"}]},"__N_SSG":true}