{"pageProps":{"article":{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned.","keywords":"Saving Private Ryan Best Picture Oscars","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Saving Private Ryan's Best Picture Oscar defeat in 1999 still stings. Many people feel this way, and it's not only because they were disappointed when Shakespeare in Love won the top prize that night. After all, there have been numerous upheavals in the past and afterwards. Just ask the makers of Brokeback Mountain or La La Land about Crash or Moonlight. The stories Orson Welles would have to tell about How Green is My Valley if he were still alive.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Yet, in the case of Steven Spielberg's seminal World War II epic losing to an amusing (if somewhat lightweight) romantic comedy, there had never been an upset so fundamentally unexpected that it changed the way awards were won; and never had a widely acclaimed studio hit with frontrunner status run into Harvey Weinstein's political machinations. The Academy Awards would never be the same again.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Saving Private Ryan was released in July 1998 at a time when there was revived interest in the generation of Americans who lived through the Great Depression and then went on to win World War II, transforming the United States into a superpower. Tom Brokaw's book The Greatest Generation, published the same year as Saving Private Ryan, popularized the term used in the title to commemorate their sacrifice. Spielberg had already given the notion visual shape for younger audiences by the time it was released.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The director's use of shaky handheld camera and starkly unsentimental images of violence were stunning in 1998, thanks to his uncompromising devotion to realism and authenticity. The D-Day landing sequence in particular echoed documentary filmmaking, generating a visceral terror that would eventually transform the way war pictures were shot. All of this suffering, however, made the film's heroes' sacrifice—eight American soldiers deployed inside enemy lines to bring one paratrooper home—appear Herculean at the time.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Back when blockbusters could be about more than superheroes and space wizards, the picture was a tremendous blockbuster smash, grossing $482 million worldwide. Most traditional Oscar watchers were certain that Spielberg would win his second Best Picture Oscar.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>On Oscar night, however, Spielberg won Best Director (his second after Schindler's List), while John Madden's Shakespeare in Love surprised audiences by winning Best Picture, Best Actress, Best Supporting Actress, Best Original Screenplay, and Best Score... the latter two also at the expense of Saving Private Ryan.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Shakespeare in Love is a fascinating film in and of itself, simply a backstage dramedy with literary credentials. The film puts insider Hollywood comedy into an Elizabethan setting while also delivering a beautiful romance between old Will and his own Juliet (or Twelfth Night's Violet, depending on the moment). It's a nice film, but it wasn't the type of film that won Best Picture until 1998. In reality, most of the major winners of the 1990s were huge studio blockbusters: Titanic narrowly defeated L.A. Confidential. The year before, Confidential defeated Sense and Sensibility; the year before that, Forrest Gump defeated Quentin Tarantino's forerunner, Pulp Fiction.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>That latter case of box office success trumps critical acclaim was perhaps the most significant in 1999, as a conventional, feel-good Tom Hanks vehicle not only defeated a critical darling, but also a film produced by Miramax Films, a then-specialty arm of Disney that was founded (and still runs) as an indie distributor by Bob and Harvey Weinstein. You've probably heard of the latter.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Harvey Weinstein reigned in Hollywood with impunity before becoming the notoriously reviled character of our post-#MeToo age, which resulted in his sentence to 23 years in jail after being convicted of one crime of sexual assault in the first degree and one count of rape in the third degree. And the Oscar stage was his royal chamber. Unlike other studios, Weinstein's has made accumulating Oscars a central part of its release strategy, gaining status and attention through award victories and converting it into late box office revenue. The procedure changed the definition of a \"Oscar Movie\": they were lower-budget, less well-known, and frequently greenlit with (if not scripted with) Academy voters' predetermined tastes in mind.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The victory of Shakespeare in Love against Saving Private Ryan marked the beginning of this major change.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Weinstein-produced comedy had a relatively cold welcome when it initially aired for Academy voters in December 1998, indicating that it would have a minor effect on the year's Oscar campaign. Weinstein's groundbreaking Oscar campaign for that film, however, would become his \"bully masterpiece,\" as described by Rebecca Keegan and Nicole Sperling's in-depth investigation in Vanity Fair.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52095920580_6ed1cb4cd5_k.jpg\" alt=\"Saving Private Ryan Best Picture Oscars\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Oscar campaigns were often a pleasant, good old guys affair prior to Shakespeare in Love's triumph. Of course, there would be industry screenings for Academy voters and guild members, as well as advertisements in trade publications with \"For Your Consideration\" pullout ads. Weinstein, on the other hand, almost developed the months-long Oscar campaign that starts in September and concludes in February.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Previously, a filmmaker or actor could have promoted a picture by appearing on talk programs ahead of its release week and performing a weekend of junket interviews. After Shakespeare in Love, though, showing up to movies, engaging in innumerable Q&As, and glad-handing at parties with Oscar voters became an almost weekly necessity. In fact, Academy members were chastised in 1998 for attending Weinstein's \"Welcome to America\" dinner at New York's luxury Elaine's restaurant, which was held in honor of British Shakespeare in Love director John Madden.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>One publicist told Vanity Fair, “It all began with Harvey. I don’t remember ever feeling pressure like that from other studios. He was like, ‘Can you do these radio call-ins all morning?’ He calls the clients directly and guilts them. He really is a beast.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Of course, there was considerable pushback to this very unabashed schmoozing back in 1999. The director of Saving Private Ryan and a Hollywood great who didn't feel the need to effectively beg for awards was among the naysayers.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Meanwhile, Miramax began a rumor campaign claiming that everything wonderful about Saving Private Ryan happened in the first 15-20 minutes on the Normandy beaches, and the rest was emotional nonsense. It was successful. Spielberg and Weinstein did not campaign like it was Monday before election day.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While Weinstein is no longer alive, Shakespeare's crass lessons from Love's victory against Saving Private Ryan are not. The Venice Film Festival and the Toronto International Film Festival serve as unofficial clearinghouses for studios and distributors to present their most award-friendly commodities beginning in early September. Then, between October and December, each picture is released, creating months-long releases that never truly finish until Oscar night.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>This system has created an environment where Oscar movies are often little-seen limited releases, and mainstream populist films are more concerned with superpowers than prestige, thanks to corporate studio interests leaning ever more heavily on \"four-quadrant\" blockbusters that are built on franchises. While the types of films nominated for Best Picture appear to be changing over time—from more diversity among the winners like Moonlight and Parasite to even superhero films like Black Panther and Joker now receiving nominations—the widely held belief that Oscar films and popular films are mutually exclusive remains unchanged.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In other words, studios no longer create films like Saving Private Ryan, and what makes large money isn't always the sort of picture that will end up on \"Best of the Year\" lists in December. Even if there are exceptions to the trend, such as when studios let auteurs create Dunkirk or 1917, the filmmakers will still be stuck in “the mud” for months.</p>\n                </div>\n                "]},"reco":[{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."},{"id":"752f6e9c-cfc6-413b-af02-bbae594c1c78","date":"Jul 21, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52231320065_743420415e_o.png","title":"The Reason Why Game of Thrones Spinoff Bloodmoon Was Canceled","tags":"tv news","excerpt":"The original concept for a Game of Thrones spinoff from HBO was bold and unique but maybe too much."},{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","title":"Best Korean Horror Films That You Should Watch","tags":"movie news","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category."}]},"__N_SSG":true}