{"pageProps":{"article":{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","excerpt":"And why one of the few films that scares him is 'The Thing.’","keywords":"Quentin Tarantino Reservoir Dogs","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Quentin Tarantino described why John Carpenter's The Thing is one of the few films that has ever terrified him, and how it helped him establish the appropriate tone for Reservoir Dogs on The Late Show with Stephen Colbert.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino's admiration for Carpenter's The Thing was never hidden. On The Hateful Eight, the filmmaker collaborated with Ennio Morricone, the composer of The Thing, even using some cues from the horror classic in the cold Western. The Thing, on the other hand, appears to have influenced Tarantino's earlier film Reservoir Dogs. And it's all because Tarantino's terrified reaction to Carpenter's masterwork is one of the few.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino claims to be a \"big horror movie fan\" who doesn't get terrified easily. \"I respond to suspense, I respond to that – oh what’s gonna happen next, and I can jump by a ‘boo’ scare – but that’s not really terror.\" Tarantino says. The Thing, on the other hand, terrified Tarantino. That's why the filmmaker wanted to \"bring it under the microscope\" and figure out what makes Carpenter's picture so terrifying.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52086174314_400917bbb6_o.jpg\" alt=\"Quentin Tarantino Reservoir Dogs\">\n                </div>","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I think the reason [for it being scary] is this. These men are trapped in this situation in this arctic research center, and one or more of them are possibly this Thing that’s going to devour all of them. And no one knows if you are the guy I’ve known forever or you are a Thing. And the movie makes the paranoia of that so palpable, so real, it’s almost like another character in the movie. The sheer paranoia of it. They’re trapped in the Antarctic, in this shelter, and so the paranoia is bouncing off of the four walls… until it has nowhere to go except through the fourth wall into the audience. I started feeling exactly like they felt.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Because the atmosphere of paranoia is exactly what fuels Reservoir Dogs, Tarantino drew heavily on The Thing for inspiration.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“When I started writing Reservoir Dogs, I was like, I need to have that aspect that’s in The Thing. I need to trap these bastards in this warehouse and no one can trust anybody else… and I want the paranoia of what’s going in that warehouse to bounce across the walls and hopefully, like in The Thing, it will go out into the audience.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tarantino has yet to select which of his films will be his final. It might be Kill Bill 3 or something a little more outlandish, like a spaghetti western comedy. While the filmmaker continues to mull about how to say farewell to Hollywood, it's instructive to revisit his earlier work and gain a better understanding of how his iconic pictures came to be.</p>\n                </div>\n                "]},"reco":[{"id":"8839128b-e924-49e6-b633-ced9fd863a18","date":"Jul 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52245483277_a593407ddf_o.png","title":"Doctor Doom May Appear In The MCU Before The Fantastic Four Movie","tags":"movie news","excerpt":"On November 28, 2024, MCU Fantastic Four film will be released, but Doctor Doom could make his appearance much sooner."},{"id":"a7d55ce3-8163-4dd5-80a3-d2f31c9b89b1","date":"Jul 25, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52239396903_e24b96945b_o.png","title":"Is Daredevil: Born Again Going to Be As Dark as the Comics?","tags":"tv news","excerpt":"The speculated fourth season of Daredevil has a title that begs many more questions than it answers."},{"id":"752f6e9c-cfc6-413b-af02-bbae594c1c78","date":"Jul 21, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52231320065_743420415e_o.png","title":"The Reason Why Game of Thrones Spinoff Bloodmoon Was Canceled","tags":"tv news","excerpt":"The original concept for a Game of Thrones spinoff from HBO was bold and unique but maybe too much."},{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","title":"Best Korean Horror Films That You Should Watch","tags":"movie news","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category."}]},"__N_SSG":true}