{"pageProps":{"article":{"id":"0b1f2130-832a-414e-9277-722c96bc52a9","date":"Mar 22, 2022","author":"Nick Carver","title":"The Sequel To 'godzilla Vs. Kong' Will Begin Filming In Australia This Year","excerpt":"'Godzilla vs. Kong' was also shot in Queensland, Australia in 2021.","keywords":"monster universe, kong, godzilla","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51954465213_c3c845a0e3_o.png","content":["<pre class='ArticleBody_text__ePgSJ'>According to government agency Screen Queensland, the now-confirmed sequel to Godzilla vs. Kong will shoot later this year in Queensland, Australia. According to State Premier Annastacia Palaszczuk, the film will be shot in a number of sites across the Gold Coast and the southeast.</pre>","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>The production is expected to inject more than double the $36.5 million that Godzilla Vs Kong brought to the state and is a welcome boost to our economy as we recover from the impacts of the global pandemic and southeast Queensland flooding events. These types of productions benefit our screen industry, deliver local jobs and provide a welcome boost to our small businesses and communities in and around our production sites.</p>\n                </div>\n                ","<pre class='ArticleBody_text__ePgSJ'>The plot of this new film is being kept under wraps for the time being, but it will be the fifth installment in Legendary's new MonsterVerse franchise. \"The clear starting point we teed up (in GVK ), exploring Hollow Earth, I think there is a lot more to do there. This is a pre-history of Planet Earth, where all the titans come from. We tee up some mystery in this film, things I want to see resolved and explored and pushed to the next level,\" Godzilla vs. Kong director Adam Wingard told Deadline</pre>","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://ca-times.brightspotcdn.com/dims4/default/15b041e/2147483647/strip/true/crop/3060x2040+518+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0d%2F9f%2F8ecdde804e81a4979c549d78a4c2%2Fla-photos-handouts-la-et-godzilla-vs-kong-movie-133.JPG\" alt=\"monster universe, kong, godzilla\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>According to Screen Queensland, the development of this Godzilla vs. Kong sequel will bring a considerable boost to the Australian economy. The film's production is estimated to generate $79.2 million ($58.6 million) in revenue for the region, as well as 505 jobs for eligible residents. Additionally, 750 local residents will have the opportunity to participate as extras in the film. The first Godzilla vs. Kong film was also shot in Australia, which helped bolster the country's economy at the time. Godzilla vs. Kong was also shot on the Gold Coast, while Godzilla: King of Monsters took place in Atlanta, Georgia.</pre>"]},"reco":[{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","tags":"tv news","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium."},{"id":"9d5ca4b8-c628-4586-a800-ea074863184d","date":"Mar 28, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/51965763342_3e42506d42_c.jpg","title":"Will Smith Smacking Chris Rock At The Oscars In 2022 Appears To Have Jaden Smith's Support","tags":"movie news","excerpt":"Will Smith struck Chris Rock after the latter's Jada Pinkett Smith joke at the 2022 Oscars, prompting Jaden Smith to express his support for his father."},{"id":"d01af9b7-84fe-4724-94b5-cfeacf781686","date":"Mar 28, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51966817133_c39a87085b_c.jpg","title":"Oscar Isaac Compares Joining The Marvel Cinematic Universe As Moon Knight To Star Wars And Dune","tags":"tv news","excerpt":"Oscar Isaac compares working on Star Wars and last year's Dune to joining the Marvel Cinematic Universe as Steven Grant in Moon Knight."},{"id":"71995c14-eccf-4eb4-8fee-7425409a94c0","date":"Mar 23, 2022","author":"Kohei Watanabe","thumbnail":"https://live.staticflickr.com/65535/51956013878_29e059cdb5_c.jpg","title":"Barcelona Footballer Pays Tribute To Goku From Dragon Ball Z","tags":"anime news","excerpt":"During a match against Real Madrid, FC Barcelona footballer Pierre-Emerick Aubameyang shows off his Dragon Ball fandom."}]},"__N_SSG":true}