{"pageProps":{"article":{"id":"0b1f2130-832a-414e-9277-722c96bc52a9","date":"Mar 22, 2022","author":"Nick Carver","title":"The Sequel To 'godzilla Vs. Kong' Will Begin Filming In Australia This Year","excerpt":"'Godzilla vs. Kong' was also shot in Queensland, Australia in 2021.","keywords":"monster universe, kong, godzilla","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51954465213_c3c845a0e3_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to government agency Screen Queensland, the now-confirmed sequel to Godzilla vs. Kong will shoot later this year in Queensland, Australia. According to State Premier Annastacia Palaszczuk, the film will be shot in a number of sites across the Gold Coast and the southeast.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>The production is expected to inject more than double the $36.5 million that Godzilla Vs Kong brought to the state and is a welcome boost to our economy as we recover from the impacts of the global pandemic and southeast Queensland flooding events. These types of productions benefit our screen industry, deliver local jobs and provide a welcome boost to our small businesses and communities in and around our production sites.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The plot of this new film is being kept under wraps for the time being, but it will be the fifth installment in Legendary's new MonsterVerse franchise. \"The clear starting point we teed up (in GVK ), exploring Hollow Earth, I think there is a lot more to do there. This is a pre-history of Planet Earth, where all the titans come from. We tee up some mystery in this film, things I want to see resolved and explored and pushed to the next level,\" Godzilla vs. Kong director Adam Wingard told Deadline</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://ca-times.brightspotcdn.com/dims4/default/15b041e/2147483647/strip/true/crop/3060x2040+518+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0d%2F9f%2F8ecdde804e81a4979c549d78a4c2%2Fla-photos-handouts-la-et-godzilla-vs-kong-movie-133.JPG\" alt=\"monster universe, kong, godzilla\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to Screen Queensland, the development of this Godzilla vs. Kong sequel will bring a considerable boost to the Australian economy. The film's production is estimated to generate $79.2 million ($58.6 million) in revenue for the region, as well as 505 jobs for eligible residents. Additionally, 750 local residents will have the opportunity to participate as extras in the film. The first Godzilla vs. Kong film was also shot in Australia, which helped bolster the country's economy at the time. Godzilla vs. Kong was also shot on the Gold Coast, while Godzilla: King of Monsters took place in Atlanta, Georgia.</p>\n                </div>\n                "]},"reco":[{"id":"4d13c42f-a764-4383-b22f-42f0adc6a026","date":"Apr 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52021844280_1c1bffcb35_c.jpg","title":"Casting What-Ifs: Every Actor That Came Close To Playing Captain Jack Sparrow","tags":"movie news","excerpt":"In the Pirates of the Caribbean franchise, Johnny Depp played Jack Sparrow, but who else came close to captaining the Black Pearl?"},{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","tags":"tv news","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more."},{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."}]},"__N_SSG":true}