{"pageProps":{"article":{"id":"4b4d9d1e-d36f-4d42-a371-d5be789313a8","date":"Apr 7, 2022","author":"Nick Carver","title":"The Director of Avengers: Endgame Explains Why Marvel Movies Have So Much Humor","excerpt":"As Kevin Feige is aware of what people appreciate, Joe Russo explains that the secret to Marvel's success is the usage of comedy in their films.","keywords":"mcu, avengers, marvel","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51988471790_f1d8861371_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe Russo, director of Avengers: Endgame, explains why the MCU films are so funny. The MCU is the most profitable film series of all time, with $25.6 billion in worldwide box office receipts, and viewers have gotten engrossed in the characters and universe of these heroes over the last 14 years. The films have become quotable in regular conversation, and the discussion has become one of the most important pieces of shared cultural moments of the twenty-first century.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The MCU's sense of humor began in 2008 with Iron Man, when the picture lacked a full script and had to rely on Robert Downey Jr.'s improv talents, which director Jon Favreau was well equipped for given his comedic background. The Avengers would further define the series, since the script's banter and humor was one of the film's highlights, and future MCU films have attempted to replicate it. The MCU's humorous components have now proven equally as popular with audiences as the action sequences.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51987914126_6784ba6aa9_h.jpg\" alt=\"mcu, avengers, marvel\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Russo explains why the MCU films have so much humour and claims that it is the secret to Marvel's success. Russo confirmed to Deadline through TheDirect that Marvel Studios President Kevin Feige enjoys testing Marvel films to see how fans react to them. Feige wants his audience to have a good time, and one way to do it is through humor.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"Well, Marvel’s secret sauce is that Kevin likes the films to be entertaining, right? And entertaining typically involves humor, and I think that Kevin’s very big on testing movies and I think he likes to sit in the test screening and hear the response. So the audience’s laughing, you can hear their response. You can understand, ’Okay, every 2 minutes [they] are getting some enjoyment out of the movie,' and that’s a strong way for him to gauge how the movie will perform with an audience, right? So I think humor is very important to him.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Some criticize the franchise's insistence on humor, believing it often deflates rather serious moments, and others criticize the franchise's inability to take anything seriously, such as mocking Doc Ock's name in Spider-Man: No Way Home. The MCU style of humor has become so popular that it has been imitated by other studios and has now gained a negative reception among some audience members as \"Marvel Humor.” Despite the humor, the MCU has been able to incorporate more lofty themes into their films, such as racial politics in Black Panther, colonialism's devastations and effects on refugees in both Captain Marvel and Thor: Ragnarok, and the complicated nature of children and parents in Shang-Chi and the Legend of the Ten Rings.</p>\n                </div>\n                "]},"reco":[{"id":"4d13c42f-a764-4383-b22f-42f0adc6a026","date":"Apr 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52021844280_1c1bffcb35_c.jpg","title":"Casting What-Ifs: Every Actor That Came Close To Playing Captain Jack Sparrow","tags":"movie news","excerpt":"In the Pirates of the Caribbean franchise, Johnny Depp played Jack Sparrow, but who else came close to captaining the Black Pearl?"},{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","tags":"tv news","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more."},{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."}]},"__N_SSG":true}