{"pageProps":{"article":{"id":"7a18b13f-67ef-48a9-8715-35704015c3f8","date":"Mar 21, 2022","author":"Wallace Bell","title":"The Creator Of The Squid Game Reveals Plans To Bring Back Actor in Season 2 After Character Death","excerpt":"Will there be a second season of Squid Game after it became the surprise Netflix success that blasted through streaming audiences in 2021?","keywords":"squid game, korean, kdrama","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51952077484_727e913025_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following one character's death in the first season, the creator of Squid Game teases a stunning reappearance for Season 2! Squid Game was one of Netflix's quickest and most popular releases in recent months, and it was such a smash that the streaming provider swiftly announced plans for a second season. But one of the biggest concerns that fans have about the show is that, aside from the possibility of a lightning in a bottle success, a second season will be without the majority of the ensemble that made the first season so popular.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/d5921ecd-40e0-4ef2-a840-cb9913c4058f'>Season 2 Of Squid Game Will Have More Games, According To The Creator</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that several of these fan favorites perished during the first season, it appears that they or their performers aren't completely off the table. During an interview with Deadline at the PGA Awards, series creator and director Hwang Dong-hyuk discussed the possibility of returning characters from the second season.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"No, because most of them are dead. I'll try something to bring them back to Season 2.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://www.thesundaily.my/binrepository/lyfe-121021-page-2-sg1-netflix_1944204_20211012112926.jpg\" alt=\"squid game, korean, kdrama\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Let's say maybe she has a twin sister, you'll see,\" Dong-hyuk joked about HoYeon Jung, who plays Kang Sae-byeok on Squid Game (and has gone on to win some major honors for her work in the series). That is, assuming the series continues as an anthology of some sort; but, if it continues the series' main tale after Gi-hun, there may not be a logical method to do so.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In any case, it's evident that the resurrection of Squid Game is still a long way off. Dong-hyuk even told Deadline that he hasn't even begun scripting the sequel yet. \"There will be more great games, that's all I can say,\" he said. \"I'm just still brainstorming and collecting the ideas for Season 2. I haven't even started with the writing yet.\" That means it while it may seem difficult to bring back characters right now, that might change as the series progresses!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>What are your thoughts? Do you want to see any of the characters from the Squid Game return in Season 2? Which actors or characters would you like to see more of?</p>\n                </div>\n                "]},"reco":[{"id":"4d13c42f-a764-4383-b22f-42f0adc6a026","date":"Apr 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52021844280_1c1bffcb35_c.jpg","title":"Casting What-Ifs: Every Actor That Came Close To Playing Captain Jack Sparrow","tags":"movie news","excerpt":"In the Pirates of the Caribbean franchise, Johnny Depp played Jack Sparrow, but who else came close to captaining the Black Pearl?"},{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","tags":"tv news","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more."},{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."}]},"__N_SSG":true}