{"pageProps":{"article":{"id":"e75ceff2-8f62-4181-a896-291aa4f97a0c","date":"Apr 5, 2022","author":"Wallace Bell","title":"7 Must-Watch K-Dramas Starring Park Seo Joon That You Can Watch On Netflix","excerpt":"Park Seo Joon has resurfaced in the public eye. While the circumstances surrounding this latest attention are not ideal, there is one silver lining: we now have a fresh collection of images of this great actor to view as we give him our best wishes.","keywords":"k-drama, netflix, Park Seo Joon","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51983828334_bd4671a682_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Joon is without a doubt one of today's most in-demand K-drama leads. From his supporting roles in dramas like Dream High 2 and One Warm Word, the 31-year-old actor has come a long way. He continues to win over fangirls' hearts with his bankable acting abilities and obvious charisma as a true Hallyu star adored by many.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Dream High 2</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51982542712_2c053db38d_z.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"Dream High 2,\" as one of Park Seo Joon's debut dramas, is all you'd expect a 2012 idol actor-filled drama to be. Park Seo Joon appears with GOT7's JB as members of the idol band Eden, a well-established group that already enjoy the adulation of innumerable fans, with hopes of making it big in the hard-knock world of entertainment. However, new restrictions for minor performers have landed the band in hot water on several occasions, and adjusting to the new school regimen enforced by these laws isn't easy. This one is high on the list of corny dramas, but it's so great in all of its cheesy grandeur that you can't help but enjoy it.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">What’s Wrong With Secretary Kim</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51983620348_85842a8663_c.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Joon's role as Lee Young Joon, the narcissistic vice chairman of a major corporation, may not seem like the most likely candidate for \"heart-melting male lead,\" but he manages to do just that in the 2018 rom-com \"What's Wrong With Secretary Kim.\" Completely reliant on his hard-working, long-time secretary Kim Mi So (Park Min Young), Park Seo Joon's Lee Young Joon's world is Mi So is ready to leave the corporate world, determined to focus more on herself and what she wants out of life, but Young Joon refuses to let her go. Young Joon eventually finds himself falling for his soon-to-be-former secretary, despite his best efforts to keep her by his side. Luckily for him, she's starting to reciprocate his affections, which means we get to witness their feelings grow while our own hearts turn to goo as lucky spectators.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">She Was Pretty</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51983838654_646b1c3b2e.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Joon reprises his role as Ji Sung Joon, the gorgeous and successful editor of a renowned fashion magazine who also happens to be the childhood love of Hwang Jung Eum's awkwardly cute Kim Hye Jin in the 2015 rom-com \"She Was Pretty.\" Hye Jin remembers Sung Joon as fondly as he remembers her, despite the fact that time and a complete reversal of their outward appearances have rendered them both unrecognizable to one other. Hye Jin, embarrassed by her appearance, begs her gorgeous friend (Go Jun Hee) to meet with Sung Joon instead, but nothing goes as planned in this rom-com. As the scarlet rope that binds them together drags them closer together, it's hard for Hye Jin and Sung Joon to escape each other's notice. Anyone viewing this drama will undoubtedly feel their heart melt like butter on hot toast due to the chemistry between the two protagonists.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Fight For My Way</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51983563451_f1c7b35546_b.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Joon's transformation from successful editor to down-and-out mixed martial artist Go Dong Man in the 2017 feel-good drama \"Fight For My Way\" warms everyone's hearts. Once a successful taekwondoin, Dong Man had to walk out of the ring as life takes an unexpected turn. Dong Man finds fresh inspiration to re-enter the ring as a mixed martial artist while working as a contract employee in a dead-end job, but the road back to fame isn't simple. Choi Ae Ra (Kim Ji Won), a department store worker who dreams of becoming a television news reporter, is always at his side. The two effortlessly move from long-time friends to lovers, inspiring each other to pursue their aspirations, and if that charming description isn't enough to melt your heart, nothing will.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Hwarang</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51984106555_9c7fe6caaf_c.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>'Hwarang,' another of Seo-masterpieces, Joon's is a period drama. It is a star-studded ensemble cast that includes various K-Pop idols from major bands. It stars BTS' Kim Tae-Hyung (V), Shinee's Choi Min-Ho, and ZE:Park A's Hyung-Sik. Kim Sun-Woo (Park Seo-Joon), Kim Ah-Ro (Go Ara), and Kim Ji-Dwi are the main characters of Hwarang (Park Hyung-Sik). After the death of the King in the fabled Kingdom of Silla, the people are ruled by the Queen. To protect her small kid, she keeps him concealed. However, with the passage of time, the people of the kingdom get increasingly agitated as they wait for their youthful monarch to take over. The Queen, on the other hand, is not yet ready to give up.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_binance__Z4f5r\">\n                <a class='ArticleBody_adsContainer__6XXMm' href='https://www.redbubble.com/i/metal-print/Itaweon-Class-by-HeisenbergPost/106928371.0JXQP' target='_blank'>\n                <img class='ArticleBody_adsImage__Rp6rW' src='https://live.staticflickr.com/65535/51983883271_1e2faf3d86_b.jpg' />\n                </a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Meanwhile, in Silla, there is a harsh caste system in existence, and one man is desperate to break free and rise to new heights. As a result, the Queen created the Hwarang, an elite squad of soldiers entrusted with protecting the country and the future heir. As they work together to complete assignments, the crew begins to connect. They are blissfully ignorant, however, that two members of the gang have major secrets of their own. Hwarang not only received great nominations for its performers, but also won a number of renowned prizes.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Itaewon Class</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51984106540_0a610bd9d1_k.jpg\" alt=\"k-drama, netflix, Park Seo Joon\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Joon, who plays Park Sae Roy in the 2020 webtoon-turned-drama \"Itaewon Class,\" readily illustrates that there's more than one way to melt a heart. Sae Roy, a formerly jailed young man, now runs an Itaewon restaurant/bar on the straight and narrow. Sae Roy is disappointed when he can't get his business off the ground, since he hopes to use it as a method of avenging himself. Jo Yi Seo from Kim Da Mi comes into his life at the perfect time and completely changes his life. While the romantic aspect of this drama spends the majority of its time in the background, it is still present. As the tale develops, your heart will melt on many levels for Sae Roy, but it will melt in a whole new manner once he finally discovers out what his heart has been trying to tell him for a long time.</p>\n                </div>\n                "]},"reco":[{"id":"4d13c42f-a764-4383-b22f-42f0adc6a026","date":"Apr 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52021844280_1c1bffcb35_c.jpg","title":"Casting What-Ifs: Every Actor That Came Close To Playing Captain Jack Sparrow","tags":"movie news","excerpt":"In the Pirates of the Caribbean franchise, Johnny Depp played Jack Sparrow, but who else came close to captaining the Black Pearl?"},{"id":"565c5bdf-8b55-48f4-b7cf-77b659a6f1d8","date":"Apr 21, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52019132086_e3bdd48150_c.jpg","title":"According to the creators of Stranger Things Season 5, fans will be left wanting more","tags":"tv news","excerpt":"According to Matt Duffer, the Netflix show's creator, Stranger Things ending with season 5 will feel a touch premature and leave viewers wanting more."},{"id":"c530afb2-8320-4674-8b39-b048f35eb734","date":"Apr 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52017181691_f759ac5e2c_c.jpg","title":"Johnny Depp claims that he never saw the first Pirates of the Caribbean film","tags":"movie news","excerpt":"Johnny Depp admits during his testimony against Amber Heard that he has never watched Pirates of the Caribbean: The Curse of the Black Pearl."},{"id":"6aaccbb4-6493-42c1-8fc3-ac50461d0c27","date":"Apr 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52014966154_e145713a34_c.jpg","title":"Josh Brolin Is Open To Returning To The Marvel Cinematic Universe As Thanos","tags":"movie news","excerpt":"Josh Brolin talks about his future in the Marvel Cinematic Universe and reveals that if Marvel asks, he is willing to reprise his role as Thanos."}]},"__N_SSG":true}