{"pageProps":{"article":{"id":"5cdc3a65-6dd2-45b1-bacd-81f8e31ae731","date":"Mar 21, 2022","author":"Kevin Miles","title":"The Oscar-nominated Director Of Drive My Car Doesn't Know How To Drive","excerpt":"Despite the film's subject matter, Ryusuke Hamaguchi, the director of Best Picture candidate Drive My Car, has stated that he does not know how to drive.","keywords":"movie, oscar, drive my car","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51950580842_7f2f88ab68_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the subject matter of his film, Ryusuke Hamaguchi, the Oscar-nominated director of Best Picture contender Drive My Car, has confessed that he does not know how to drive. The film, which is based on a short tale by Haruki Murakami of the same name, has been critically and commercially successful, garnering over 50 awards in addition to its Oscar nominations. Drive My Car has been available to HBO Max customers since March 2.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Drive My Car tells the narrative of Ysuke Kafuku, performed by actor and theatrical director Hidetoshi Nishijima. Oto dies of a cerebral hemorrhage shortly after Ysuke discovers his wife's infidelity, prompting Ysuke to undergo a nervous breakdown. Two years later, while directing a multilingual production of Uncle Vanya in Hiroshima, Ysuke is forced by the theater company he works for to be chauffeured by a young woman named Misaki Watari in his 1987 Saab 900. Much of the film's three-hour runtime is spent in Ysuke's car, where they get closer and learn more about one another as she drives him around.</p>\n                </div>\n                ","\n                <div class='ArticleBody_related__oI_Nm'>\n                <p class='ArticleBody_relatedCap__07hkO'>RELATED:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='https://www.themoviebureau.com/article/c8d944af-1b0d-4791-9664-7109dd706711'>'Drive My Car,' an Oscar-nominated film by Ryusuke Hamaguchi, has been added to the Criterion Collection</a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite the fact that a big portion of Drive My Car takes place behind the wheel, Hamaguchi acknowledged in an interview with EW that, despite having a valid driver's license, he is functionally unable to drive. He added that he felt unsafe driving even after passing his test. Having said that, he still enjoys being a passenger in a car.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>I actually am not able to drive. [Laughs] I do possess a license. But in Japan, we have a saying, we call it a \"paper driver.\" Because we're just a driver on paper — we don't actually drive. I do enjoy riding in cars with other people and talking with them. To tell you the truth, I did get a license when I was in my twenties, and I drove about three times, but all three times I had some sort of minor accident. I didn't think I was really suited for driving.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film has gained critical acclaim since its debut for its portrayal of loss, infidelity, and loneliness.\nDrive My Car was the first Japanese film to receive a Best Picture nomination, and Hamaguchi was nominated for Best Director. Despite the fact that neither the picture nor the director are considered the most likely winners in their respective categories, Drive My Car has a chance to repeat the success of Parasite, the first-ever Best Picture winner in a language other than English.\nRegardless of whether it wins or not, its nomination has been hailed as a symbol of the Academy's growing readiness to look beyond the English-speaking world.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The fact that Hamaguchi is unable to drive adds a comic irony to the popularity of Drive My Car.\nHowever, it makes a lot of sense in the context of his professed fondness of riding in other people's cars. The protagonist Ysuke isn't at the wheel for the most of Drive My Car; instead, his driver Misaki is. The poignancy of their chats during those tranquil times on the drive gives the film its dramatic weight. It's probably for the best that Hamaguchi stays in the passenger seat; if Drive My Car, which has been praised for its reflection, had been based on his few actual driving experiences, it would have been a very different - and stressful - picture.</p>\n                </div>\n                "]},"reco":[{"id":"594a7681-075f-455c-b030-a00e9075ac34","date":"Apr 13, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52002373450_050f7aaa9b_c.jpg","title":"Is it Possible for Mission: Impossible to Survive Without Tom Cruise?","tags":"movie news","excerpt":"The Mission Impossible films have been so popular that the espionage franchise may be able to continue without Tom Cruise. But will the franchise be able to pull it off?"},{"id":"119b2778-91fa-49b5-85ed-bb94dab1f369","date":"Apr 13, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52000704142_b5dbf6f77c_c.jpg","title":"Maisie Williams Reveals Whether She'd Consider Returning For A Game Of Thrones Spinoff","tags":"tv news","excerpt":"Maisie Williams, who played Arya Stark in the original series, discusses if she'd consider reprising her role in a potential Game of Thrones spinoff."},{"id":"d3f3a202-4f55-4b37-b4c7-18311b645ee7","date":"Apr 12, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/52000225410_b129da30c7_c.jpg","title":"Karen Gillan Shares Her Funniest Avengers: Endgame Regret","tags":"movie news","excerpt":"Karen Gillan admits her one humorous Avengers: Endgame regret: she didn't take advantage of the opportunity to plug her other significant property."},{"id":"405cd1ef-56c8-494e-a132-c735b50d2f1c","date":"Apr 12, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51999579280_96c97901cf_c.jpg","title":"Moon Knight Cannot Defeat The Mandalorian In A Fight, According To Pedro Pascal","tags":"tv news","excerpt":"Pedro Pascal joins the argument between Moon Knight and The Mandalorian, which was begun by Moon Knight star Oscar Isaac, and claims that his hero will triumph."}]},"__N_SSG":true}