{"pageProps":{"article":{"id":"71995c14-eccf-4eb4-8fee-7425409a94c0","date":"Mar 23, 2022","author":"Kohei Watanabe","title":"Barcelona Footballer Pays Tribute To Goku From Dragon Ball Z","excerpt":"During a match against Real Madrid, FC Barcelona footballer Pierre-Emerick Aubameyang shows off his Dragon Ball fandom.","keywords":"anime, dragonball, goku, kakarot","tags":"anime news","thumbnail":"https://live.staticflickr.com/65535/51956013878_29e059cdb5_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Pierre-Emerick Aubameyang, a professional footballer, celebrated a goal with a posture that Dragon Ball fans will recognize.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to SB Nation, Aubameyang paid tribute to Akira Toriyama's popular anime and manga genre during FC Barcelona's last match against Real Madrid, which Barcelona won 4-0. Aubameyang went to the field's sidelines after scoring a goal, picked up a transparent orange orb, and placed two fingers on his brow, recreating the pose that Dragon Ball protagonist Son Goku strikes when he uses his Instant Transmission ability, which allows him to teleport great distances in the blink of an eye. \"It was a ball from Dragon Ball. With it, you can make a wish. I wanted to win and score a goal for my grandparents, who are gone,\" the player subsequently stated, confirming that it was a conscious homage to the iconic shonen manga.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://pbs.twimg.com/media/FOVS85_WUAIzcCU?format=jpg&name=large\" alt=\"anime, dragonball, goku, kakarot\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>On his personal Twitter account, Aubameyang later tweeted a photo of himself striking the position with a photo of Goku. \"Hello from a finished player,\" the multi-time Premier League top scorer said, mocking critics who claimed his career was gone after leaving Arsenal. Aubameyang's Twitter profile photo has been changed to a portrait of himself drawn in the style of Akira Toriyama's classic painting. The player is well-known for his eye-catching post-goal celebrations, which frequently include a flip. Aubameyang has also done a \"Wakanda Forever\" salute while wearing a Black Panther mask and celebrating a victory.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Goku is taught the Instant Transmission technique by the friendly people of the planet Yardat after crashing there following his planet-destroying battle with Frieza in the original Dragon Ball manga and the Dragon Ball Z anime. Goku not only exploits his ability to travel throughout the world to surprise opponents, but he has also integrated it into his combat technique, blending it with his famous Kamehameha and Spirit Bomb assaults. The Saiyan warrior most recently employed the technique in the Dragon Ball Super manga's current chapter, where he used it to buy time in his combat with the wish-powered warrior Gas.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Toriyama created Dragon Ball in 1984, and it is now the third best-selling manga of all time, with more than 300 million copies in print worldwide. The ongoing Dragon Ball Super manga, which is still overseen by Toriyama himself and incorporates art by his protégé, Toyotarou, continues Goku's exploits to this day.</p>\n                </div>\n                "]},"reco":[{"id":"b94d8c73-15cf-4437-aa16-4ae8334e3208","date":"May 18, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52081976178_3f0b96e7ac_c.jpg","title":"The Forgotten Pre-Marvel Action Film of Robert Downey Jr.","tags":"movie news","excerpt":"Interest in the United States is surging like a relic from the past. Marshals is a neglected (and substandard) sequel to Harrison Ford's masterpiece The Fugitive, released in 1998. And there's a reason for it: Robert Downey Jr.'s baby face."},{"id":"7f9dfde0-5d4a-43f6-a1c4-b0f626ef7dab","date":"May 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52074724140_d604f27001_o.png","title":"Christopher Walken Is The Excellent Choice for a God Emperor","tags":"movie news","excerpt":"In Dune: Part Two, Christopher Walken has been cast as Padishah Emperor Shaddam IV of House Corrino!"},{"id":"d025cf6d-6367-4c10-ab6b-86af2aadca85","date":"May 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52067827583_cf2c8a5ff2_c.jpg","title":"The Director of Terminator: Salvation Reflects on the Film's Failure","tags":"movie news","excerpt":"Director McG believes he knows why the 2009 picture is frequently ranked at the bottom of Terminator rankings."},{"id":"a2b2cfd5-4af4-4f8f-ab7a-bdce2f968646","date":"May 10, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52062712242_6dc33f1ecb_c.jpg","title":"Ozark: Wendy Byrde Was The Show’s True Villain","tags":"movie news","excerpt":"Wendy Byrde (Laura Linney) is the most vicious and most cruel character in Ozark."}]},"__N_SSG":true}