{"pageProps":{"article":{"id":"a1c35260-c1af-453a-91e7-315cc8437cd0","date":"Apr 23, 2022","author":"Brian Martin","title":"Can You See Him? Best John Cena Movies That You Should Watch","excerpt":"John Cena had a rocky start in the movies, but he has steadily improved since then. These are his most notable works.","keywords":"John Cena movies, john cena wrestling, best john cena movies","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52023832231_d66ffb0386_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>John Cena has wowed fans with his performance in HBO's Peacemaker series. After Cena's character, Peacemaker, was transported to the hospital in The Suicide Squad, the story continued.\nAlthough John Cena is new to television, he has been constantly performing in films for several years.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>John Cena may have begun his career as a WWE superstar and probably the finest wrestler in the company's history, but he has now moved beyond the ring and onto the big screen. John Cena is now a famous movie star, with as many films as he has WWE championships.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">F9: The Fast Saga (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52023832331_47cd519c1e_b.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>You might be curious as to why John Cena's performance in F9: The Fast and Furious Saga is placed so low on our list. To begin with, it's because he doesn't have a major role in this picture.\nBut, more crucially, there may already be too many Fast and Furious films.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>F9: The Fast Saga, on the other hand, centers on the Toretto family, as Dom is forced to confront his past mistakes in order to protect his family. Of course, Dom's forsaken younger brother, played by John Cena himself, is one of the individuals endangering Dom and his family.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Vacation Friends (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024342710_f15df68643_o.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Marcus and Emily, a charming couple ready to get married, are played by Lil Rel Howery and Yvonne Orji in Vacation Friends. When a couple they met on vacation, Ron and Kyla, portrayed by John Cena and Meredith Hagner, turn up unexpectedly, everything is thrown into a loop.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The majority of Letterboxd users were uninterested in this picture, however John Cena's performance has been cited as the film's biggest highlight several times. It's elevated by his charisma and humorous timing, which elevates it above others in the category.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Trainwreck (2015)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024342885_daef354002.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Trainwreck was John Cena's first huge blockbuster film, yet he did not have a main role in it. Still, the nicest thing about John Cena's participation in this picture is that it allowed us to see how terrific he can be in a comedy. And this led to additional comedic jobs for him, despite the fact that someone his size would normally be cast in action films.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In Trainwreck, John Cena has a supporting role. He's entertaining because of his over-the-top performance as a gym fanatic concerned with toning and getting the perfect body. Of course, the best part about him is how outspoken he is about sex and how he delivers it in the most hilarious way imaginable.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Ferdinand (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024342900_27339354f3_c.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film Ferdinand has John Cena in his greatest voice-acting performance, demonstrating his flexibility as an actor. We were able to fully connect with Ferdinand through the voice of one of the most skilled talkers in the history of the WWE, making this one of his greatest and most spectacular voice-acting performances.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Ferdinand is based on a children's novel about a bull who prefers to sniff flowers rather than fight in bullfights. Ferdinand is a kindhearted bull who is both energetic and endearing, and this animated film follows the same theme. This is a fantastic animated picture that both children and adults will enjoy.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Daddy's Home 2 (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024079729_39a8e7a043_b.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When John Cena arrived on his motorbike as the biological father of Mark Whalberg's stepdaughter in Daddy's Home, he had a little role. However, in the sequel, the character was given a larger role. Mark Whalberg and Will Ferrell's characters in Daddy's Home 2 have to cope with their own fathers around the holidays, as well as John Cena, who is also seeking to earn the love of his biological daughter.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In principle, a larger cast sounded like a wonderful idea, but the script couldn't handle all of the extra characters. For a long time, John Cena was cast as a musclehead father with a humorous side, which was his typecast. While he isn't the star of the picture, he has received some acclaim for bringing a lighthearted vibe to the proceedings.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Blockers (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52022789232_7c5f8a1802_k.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Blockers may not have had the same budget as Bumblebee, but it is a fantastic picture that enables you to see John Cena in a more mature position as a parent. In a way, he's in a different position here since you don't generally see him playing an action hero or someone with a lot of muscle. Instead, he's simply a regular suburban father.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this coming-of-age comedy, John Cena plays one of the overprotective parents who reared a young daughter. In the film, Cena's daughter and her pals planned to lose their virginity on prom night. As a result, Cena and the other overprotective parents tried to sabotage the girls' plans by cock-blocking them.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Sisters (2015)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024079594_55d44dffec_b.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Sisters is another film in which John Cena only appears as a supporting character. Despite the fact that he isn't the lead, Cena was able to demonstrate his flexibility as an actor because, before to this picture, he was generally billed in the stereotypical action hero film, much like Dwayne Johnson.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film follows twin sisters Tina Fey and Amy Poehler, who are real-life friends. Given that you already know how talented those women are, it's no surprise that this film takes a comic tone, with the twins hosting a party in protest of their childhood house being sold. Also appearing is John Cena, who plays a drug dealer in a humorous role.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Wall (2017)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024079559_2390622b35_b.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While John Cena has recently focused on comedic parts, The Wall is the clearest illustration of how actors with his physique are often cast in films. Despite the fact that his stature and shape make him ideal for the part of a soldier, The Wall is a fantastic film that is well worth seeing.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this film, John Cena portrays an American sharpshooter. He and the other troops in the film, however, became imprisoned in Iraq. It's an action thriller that may be pretty tense because you never know what will happen next because any character's next move could be their last.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">12 Rounds (2009)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52024342945_c27e1b57bc.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>12 Rounds was one of John Cena's first acting roles, and it was released when he was still the WWE's face of the company. This is also one of the films that best highlighted Cena's acting abilities, despite the fact that he was still developing as an actor at the time.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The film follows Cena's character, Danny Fisher, when he learns that his fiancée has been kidnapped by a scam. Fisher must accomplish 12 distinct challenges to secure her freedom in this gripping drama that will keep you on the tip of your seat.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Suicide Squad (2021)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52023832271_d799b3c66a_c.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>On John Cena's filmography, The Suicide Squad is one of the most recent blockbusters. The Suicide Squad is considered the finest DC live-action picture owing to its over-the-top action and absurd brand of comedy, despite its lackluster box office result due to the COVID-19 epidemic.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker is played by John Cena, who was so good in the part that he was given his own spin-off series. Peacemaker is one of the criminals picked to join Task Force X or the Suicide Squad on a mission to destabilize a dictatorial dictatorship on an island.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Bumblebee (2018)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52023832356_51c804f063_z.jpg\" alt=\"John Cena movies, john cena wrestling, best john cena movies\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When it comes to critical acclaim, John Cena's portrayal as Bumblebee is without a doubt his greatest as a leading man. While the focus is on the iconic Transformers character Bumblebee, Cena is nonetheless one of the principal players in a film about a CGI-created morphing automobile.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In this film, John Cena plays one of the main human characters in a film about a robot. He plays Jack Burns, who ends up assisting Bumblebee despite his initial skepticism about the extraterrestrial robot's goals. In that way, despite the fact that Cena begins the picture as an antagonist, he ends up as an anti-hero in one of his finest action films and his first major blockbuster.</p>\n                </div>\n                "]},"reco":[{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","tags":"movie news","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns."},{"id":"c3227058-4c78-4de4-9869-4cd99efd00b6","date":"May 24, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52095920660_73f9a9855d_c.jpg","title":"How the Oscars Changed Forever by Saving Private Ryan’s Best Picture Loss","tags":"movie news","excerpt":"Saving Private Ryan's loss of the Best Picture Oscar to Shakespeare in Love revolutionized the way the Academy Awards were earned."},{"id":"6827305d-b11e-44da-9c7c-3746dc274bca","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52086874610_0c8116f5f8_c.jpg","title":"8 Best Anne Hathaway Movies That You Should Start Watching","tags":"movie news","excerpt":"Few actresses have the variety of Annie, who has appeared in everything from rom-coms to Oscar-winning musicals."},{"id":"f3a18b76-fab6-40a5-946f-b0c36079bb14","date":"May 20, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52085954343_8b563cb528_o.png","title":"Quentin Tarantino Discusses How John Carpenter's 'The Thing' Influenced the Making of 'Reservoir Dogs’","tags":"movie news","excerpt":"And why one of the few films that scares him is 'The Thing.’"}]},"__N_SSG":true}