{"pageProps":{"article":{"id":"6e189b90-f62c-4134-966e-c905ca32ff22","date":"Apr 2, 2022","author":"Andres Pineda","title":"Lino Brocka Films That You Should Watch","excerpt":"Lino Brocka is a Filipino filmmaker who rose to prominence in the world film community with his documentaries about the dictatorship of Ferdinand Marcos. He is well known for the film Insiang, which earned positive reviews at Cannes.","keywords":"lino brocka, filipino movies, tagalog movies, films","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51975539757_43f130ff4e_o.png","content":["\n                <h2 class=\"ArticleBody_heading__tc5g4\">Insiang (1976)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51976834134_9311ca75c0_b.jpg\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lino Brocka directed the 1976 Philippine drama film Insiang. Mario O'Hara and Lamberto E. Antonio wrote the screenplay, which is based on O'Hara's teleplay of the same name. The film stars Hilda Koronel as the titular figure, a young daughter of a spiteful mother (Mona Lisa), whose much-younger lover (Ruel Vernal) rapes her in the slums of Tondo, Manila. Insiang seeks vengeance after her assault and the betrayal of her own boyfriend (Rez Cortez). The film, which depicts urban poverty, examines themes of betrayal, revenge, and despair.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It is the first Philippine film to be screened at the Cannes Film Festival and to be shot in Tondo.\nInsiang, although being a box office flop, earned positive reviews from reviewers (some of whom rated it as one of Brocka's greatest). Producer Ruby Tiong Tan surrendered the film's rights to the Film Development Committee of the Philippines in 2015 so that the council may explore its restoration with Martin Scorsese's The Film Foundation, a nonprofit dedicated to film preservation.\nThe restored version was chosen for the Cannes Classics section of the 2015 Cannes Film Festival and has since screened at a number of additional film festivals.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Themes of betrayal, revenge, and sorrow are explored in Insiang. \"The film is basically a character study of a young girl growing up in the slums. I wanted to show the violence of the overcrowded neighborhoods; the loss of human dignity caused by the social environment and the ensuing need for change.\" says Lino Brocka. It's been linked to the rape and revenge subgenre. The film's opening scene, which depicts pigs being killed, was \"a thinly veiled depiction of the plight of the Filipinos under the Martial Law regime,\" according to CNN Philippines' Don Jaucian. The slaughterhouse scene has been linked by some observers to the country's poverty.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Manila in the Claws of Light (1975)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51975550897_795dc80854_b.jpg\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Manila in the Claws of Light (Tagalog: Maynila, sa mga Kuko ng Liwanag) is a 1975 Filipino drama film directed by Lino Brocka and based on Edgardo M. Reyes' novel In the Claws of Brightness. Many consider it to be one of the best films ever made in the Philippines. Júlio Madiaga, a young guy from the province of Marinduque, arrives in Manila on a mission to find his beloved Ligaya.\nWhile making preparations for his mission, he must struggle with difficulties such as violence and prostitution in the capital city.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Hilda Koronel, Lou Salvador, Jr., Tommy Abuel, and Rafael Roco, Jr. make their film debuts. Miguel de Leon was in charge of cinematography, and brothers Edgardo and Ike Jarlego were in charge of editing.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_binance__Z4f5r\">\n                <a class='ArticleBody_adsContainer__6XXMm' href='https://accounts.binance.com/en/register?ref=63184390' target='_blank'>\n                <img class='ArticleBody_adsImage__Rp6rW' src='https://pbs.twimg.com/media/FOl1uhuXoAE352F.jpg:large' />\n                </a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Many viewers of The Claws of Light have theorized on the characters' symbolism, which is hinted at in their names. Ligaya Paraiso, for example, is said to reflect Inang Bayan, the Filipino concept of motherland. Her given name, which literally translates to \"joyful paradise,\" is a gesture to Julio's newfound but uncomfortable occupation as a \"woman of pleasure,\" and her given name is a nod to her newfound but unwelcome occupation as a \"lady of pleasure.\"</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Julio Madiaga is seen as a representative of the regional Filipino everyman, scrounging a living in the city's harsh surroundings. His surname is an old version of matiyaga (\"patience\"), a quality that shines through in his hopeful and tireless search for Ligaya.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At the 1976 FAMAS awards, the picture won Best Picture, Best Director, Best Screenplay, Best Cinematography, Best Actor, and Best Supporting Actor.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Claws of Light is one of the few Filipino films that has continuously been ranked among the top 100 films of all time around the world. It is the only film from the Philippines to make the list of 1001 Movies You Must See Before You Die in the book.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It was screened as part of the 2013 Cannes Film Festival's Cannes Classics section.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Tinimbang Ka Ngunit Kulang (1974)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51976863754_38eed3df03_o.png\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lino Brocka directed the 1974 Filipino drama film Weighed But Found Wanting (Filipino: Tinimbang Ka Ngunit Kulang; also known as Human Imperfections). Christopher De Leon (in his first film appearance), Hilda Koronel, Lolita Rodriguez, and Eddie Garcia star in the picture. It earned six honors (including Best Picture) at the 23rd FAMAS Awards in 1975, making it one of Brocka's most noteworthy films.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Tinimbang is the story of a little kid growing up in a tiny town and the strange connection he makes with a leper and the village fool, which Lino Brocka considers his \"first novel\" and his first production for his own film company. Their stories reveal the true nature of hypocrisy in the little town, and the child witnesses and participates in the numerous emotions that pulsate beneath the supposedly peaceful village life - prejudice, cruelty, forgiveness, and even love. Brocka clearly depicts man's limitations as a mortal being in Tinimbang, but he also provides a message of hope for the film, and in the end, he speaks of rebirth and maturity.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Jaguar (1979)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51976663138_7f960a98fc_b.jpg\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lino Brocka directed the Filipino film noir Jaguar in 1979. It was screened in the Cannes Film Festival in 1980. The story is based on the true story of the 1960 \"Brown Derby Shooting,\" as chronicled by Quijano de Manila in his essay \"The Boy Who Wanted to Become Society,\" which was later included in the non-fiction crime collection Reportage on Crime (1977).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Lino Brocka films a film that explores how fruitless and detrimental the goal of becoming wealthy and famous can be for the poor. Jaguar, who is obviously honest, strong, gorgeous, nice, and healthy to the point of not even drinking, is the main medium for this comment, but he does have one major flaw: he was born impoverished. When Jaguar is compared to Direk, Sonny, and his buddies, who have nothing on him except being born affluent, this comment becomes even more pointed, with the latter's attitude, in which he constantly recalls his father whenever he is in trouble, being a prime example of this criticism.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At the same time, Cristy, who comes from a similar background as Jaguar, takes a completely opposite path, with Brocka implying that women, in particular, may f*ck their way to the top, and that women in general can use their attractiveness to succeed in life. Cristy's road, on the other hand, is far from easy, and her attitude toward Jaguar differs from the rest, in a way that at least tempers the aforementioned remark.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Fight for Us (1989)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51975593152_777c63432b_b.jpg\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fight for Us (Filipino: Orapronobis) is a political thriller film directed by Lino Brocka and written by Jose F. Lacaba that was released in 1989 in the Philippines. Phillip Salvador and Dina Bonnevie star in the film. The film was formerly prohibited in the Philippines by President Corazon Aquino because of its subversive theme (Brocka was a member of a progressive organization representing artists). After its out-of-competition premiere at the 1989 Cannes Film Festival, it was exhibited to the Filipino public.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Set in a secluded community in Dolores during the post-Marcos government, the film follows Jimmy Cordero, a political prisoner who has just been released following the fall of the Marcos dictatorship. Following his release from prison, he became involved in human rights work as a result of his revolutionary past. He and his wife's brother once went on a fact-finding mission to Dolores, only to discover the terror that the Orapronobis, a government-backed anti-communist paramilitary group stationed in Dolores, had inflicted on the town's citizens.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Ang Tatay Kong Nanay (1978)</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51976611181_8a79bdb483_o.png\" alt=\"lino brocka, filipino movies, tagalog movies, films\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>My Father, My Mother (Ang Tatay Kong Nanay) is a 1978 comedy-drama film about parenting and homosexuality, and how it is not an issue in raising a child. Lino Brocka directed the film, which was written by Orlando Nadres.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Dennis, his former ward, has left Coring, a gay beautician, with a kid. The child grows up believing Coring is his biological father. Everything appears to be going smoothly until the child's mother appears to claim her son.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nino Muhlach earned a Famas Award for the film in 1979, while Dolphy and Marissa Delgado won awards for Best Actor and Best Supporting Actress, respectively. In 1979, Dolphy was nominated for the Gawad Urian Awards for Best Actor for the second time.</p>\n                </div>\n                "]},"reco":[{"id":"52fb1f69-c802-4d2b-b1ef-6d650023ddd4","date":"Jul 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52211207270_90e58bd2f3_o.png","title":"Moon Knight Season 2: What To Expect","tags":"tv news","excerpt":"Although the MCU series' second season has not yet been announced, creator Jeremy Slater has ambitious intentions if Moon Knight is given a second chance."},{"id":"dffa1745-2c6b-42a3-91a3-b07d7eb3e00e","date":"Jul 11, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52208264963_d3ca84afcb_o.png","title":"Ranking The Craziest Nicolas Cage Performances Ever","tags":"movie news","excerpt":"These performances by Nicolas Cage provide as evidence that he is a unique performer"},{"id":"e238699d-70f7-40a4-a096-a586eb6fd1e7","date":"Jul 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52201616346_be60795aaf_o.png","title":"Stranger Things: The Real-Life Inspiration Behind Eddie Munson","tags":"tv news","excerpt":"Season 4 of Stranger Things' inaccurate charge of Eddie Munson was based on a true story of Satanic fear."},{"id":"4d162734-0f96-436b-9146-ef54a7a695bb","date":"Jun 28, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52181564543_9faa1d67f9_o.png","title":"What has Marvel planned for MCU Phase 5?","tags":"movie news","excerpt":"We'll soon learn about Marvel's plans for Phase 5 of the MCU, but do we already know where things are going?"}]},"__N_SSG":true}