{"pageProps":{"article":{"id":"1d400a42-2c79-4fb8-be48-f5755e647e86","date":"Apr 4, 2022","author":"Nick Carver","title":"6 Actors Who Have Played The Joker","excerpt":"From Cesar Romero in Batman '66 to Joaquin Phoenix, we examine what each of the cinematic Joker performers has given to the character.","keywords":"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51981874143_be14c5c345_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Joker is a scion of chaos, the maestro of malevolence, and a twisting yin to Batman's straight-laced yang; he's a scion of chaos, the maestro of malevolence, and a twisty yin to Batman's straight-laced yang. He's a comic legend who was inspired in part by Conrad Veidt's frightening metamorphosis in the 1928 Expressionist masterpiece The Man Who Laughs, as Bill Finger was inspired to co-create the supervillain. Maybe that's why each return to the big screen is greeted with as much fanfare as any caped or cowled superhero.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Cesar Romero</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51982368630_7daafb4c56_z.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While the Caped Crusader (in a sense) made the leap to the big screen with serials in the 1940s, the Joker didn't follow suit until he had already made an appearance on television. Yes, Batman: The Movie was planned by William Dozier as a method to spark interest in a forthcoming TV series, but owing to financial reluctance at 20th Century Fox to pay for the whole production, Bat-fans couldn't get their Bat-fix until after the first Bat-season was completed in 1966.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Cesar Romero, a prominent character actor and performer who had already donned the make-up in numerous episodes of the show's first season, came back on the big screen to reprise his television role as the Joker. Romero was the son of rich New York socialites of Cuban ancestry (his maternal grandfather was Cuban patriot José Marti) during the golden age of Hollywood. So the self-ascribed appellation of \"the Latin from Manhattan\" was good enough for Tinseltown.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even in white makeup, Romero kept his Latin lover moustache as the Joker, perhaps convinced that no amount of cackling would detract from his signature look. His Joker, on the other hand, was a near-perfect recreation of the purple-suited huckster from the Golden/Silver Age of comics. On both the Batman TV series and its movie spin-off, Romero radiated a youthful sense of fun, more a harmless thief with a clown obsession than a serious threat to Gotham City. Such outrageous antics were most likely inspired by the artwork of Dick Sprang, because Romero's Joker was unmistakably a live-action cartoon.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Romero's Joker looks to be on par with Burgess Meredith's Penguin in the setting of the picture. Most of Batman's rogues, including the Riddler and Catwoman, have joined forces with the two fiends in order to capture global leaders at the United World Organization's Security Council (read: UN). They achieve this by dehydrating them and turning them into multicolored dust mounds. The diplomats are ultimately rehydrated, but Batman and Robin change personalities and bodies, which no one notices.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Jack Nicholson</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981818821_ce9f2e4843_h.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Jack Nicholson was famously cast as the Joker in Tim Burton's dark reworking of the Batman legend, the most appropriate casting possible to the Boomer generation this side of Harrison Ford as President James Badass. Batman was an ambitious blockbuster extravaganza for its day, and owing to its director, it still has a distinct individual personality today, making it an outlier in its then-nascent genre. Burton was presumably given some leeway because he was cast as everyone's top candidate for the part.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Brad Dourif (reportedly Burton's favored candidate), Tim Curry, David Bowie, Willem Dafoe, and, most notably, Robin Williams were among many who circled the part of the Joker in the run-up to Nicholson's selection. In reality, Williams alleged that WB used him as a negotiation point to bring Nicholson's price down—which must have been significant, given that Jack was paid $6 million for playing the Joker (in 1988 dollars), plus a sizable backside on not just Batman but its immediate successors.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_binance__Z4f5r\">\n                <a class='ArticleBody_adsContainer__6XXMm' href='https://www.redbubble.com/i/metal-print/The-Joker-Zine-by-HeisenbergPrint/106818359.0JXQP' target='_blank'>\n                <img class='ArticleBody_adsImage__Rp6rW' src='https://live.staticflickr.com/65535/51981596171_55885500ee_b.jpg' />\n                </a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nonetheless, Batman co-creator Bob Kane, as well as Michael Uslan, the project's initial producer, desired Nicholson (who grabbed up the movie rights for Batman back in 1979). As a result, it's likely that this was supposed to be. Makeup artist Nick Dudman was even pressed to come up with various variations for the Joker's psychotic smile in order to find one that best obscured Nicholson's visage.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nicholson, Burton, and screenwriter Sam Hamm drew their inspiration for the Joker from Alan Moore's The Killing Joke, in which the colorful criminal was a small-time hood who had his skin bleached white by a chemical bath. However, although in the books, this may have been a tragic narrative (the Joker openly confesses he remembers his past differently every time), the film firmly steers the Joker towards Chinatown, clothing the great villain in fedoras and trench coats even before he started bathing in acid.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nicholson is the epitome of a star vehicle, dominating the film with a performance that sees him adapt a character to match his mannerisms and style rather than being buried in it. Even with Jack's characteristic flourishes—and the odd choice of making Joker the murderer of Bruce Wayne's parents—one might argue that this is the most comic book-like of the live-action Jokers. He's vicious, psychotic, and violent, yet he's also cheerful, preoccupied with humor, and reliant on pranks like acid buried in his flower-lapel or firearms that just go \"BANG!\" \" fliers</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Mark Hamill</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981818711_ec30bebd71_z.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Following the end of the Star Wars trilogy, Hamill was cast in the part after nearly a decade of anguish. Despite roles in films such as The Big Red One, a World War II drama, Hollywood was hesitant to hire the typecast actor. He enjoyed more success on Broadway, appearing in plays such as The Elephant Man and Amadeus, although he was never cast in any of the subsequent film versions. In 1984, for example, he lost the Mozart part in the latter to Tom Hulce. By 1990, he was starring in shows like The Flash, where he portrayed the Trickster in a costume that was as ugly as you'd expect. Nonetheless, it led to his landing a role as a voice actor on what is widely considered to be the best American animated series of all time.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As the Joker on Batman: The Animated Series, Hamill quickly rose to prominence as a voice actor, creating a cadence and cackle that would be unfamiliar to Star Wars fans. While the Joker was relatively unthreatening in the early episodes (the show being aimed at children), Hamill laced the character's innate fun with tangible venom, hinting at darker things than the scripts may allow. In the initial run of the program, his Joker never murdered anybody, but his deadly purpose was conveyed via all of the buffoonish characteristics he added to the persona. Plus, he's the only Joker on our list that can genuinely make a good joke... especially one about the gallows!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Hamill rose to fame as the Joker on Batman: The Animated Series, adopting a cadence and cackle that Star Wars fans would never recognize. While the Joker was relatively unthreatening in the early episodes (the show was designed for children), Hamill blended the character's innate fun with tangible venom, hinting at darker things than the scripts may allow. In the initial run of the program, his Joker never murdered anybody, but his dark purpose was shown by the buffoonish characteristics he introduced to the character. He's also the only Joker on our list that can deliver a good gallows joke!</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>When the Joker was introduced in Mask of the Phantasm after the first season, he was able to give his audible alter-ego more depth and danger. Despite the fact that the film primarily focused on a new villain created for the film, the eponymous Phantasm, as well as the origin of how Bruce Wayne became Batman (recall that Christopher Nolan hadn't yet offered his arguably definitive take on the subject), the Joker's sideshow attraction stole everyone else's thunder. After going the opposite of strong for 50 years, the animated version mirrored 1939's World's Fair in Queens, influenced by Burton and Furst's Gotham. Similarly, this version of the Joker was a fedora-wearing bandit who, oh, so many years ago, tagged the incorrect chemical facility.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, unlike Nicholson's Joker, no evident mannerisms are connected with a celebrity shown in the animation (supposedly, animators were inspired by Hamill's physical gestations in the recording studio). Despite the fact that the character is a cartoon, Hamill's voice alone imbues it with a feeling of unpredictability and spontaneous violence. And, thanks to the animated picture, he was able to put his words into action, driving corrupt politicians insane, murdering mob leaders, and laughing his way to hell in his confusing and fiery conclusion.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Heath Ledger</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51980812277_45f0430ce7_b.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Regardless of how much stock you place in comic book realism, Heath Ledger's portrayal of the Joker in 2008's The Dark Knight transcends the genre. Ledger's portrayal of the clown, like any other iconic turn of villainy in movies, is everlasting and still remains in the culture to this day.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Before Ledger was even cast, the Joker was supposed to return to the big screen as the major adversary of Christopher Nolan's second, and ultimately most popular, trilogy. With players as diverse as Robin Williams (again) and Adrien Brody actively pushing for the job, Nolan evidently had Ledger in mind from the start, eager to work with the young and talented actor. In 2003, he courted Ledger in an unsuccessful attempt to get him to portray Batman in Batman Begins.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>During this time, he also made a name for himself on the awards circuit with a moving and startlingly honest portrayal as Ennis Del Mar, a bitter and closeted homosexual man, in Ang Lee's lasting Brokeback Mountain. He didn't win an Oscar that year, but he drew the attention of Hollywood.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>From the outside, this makes his acceptance of the Joker role all the more odd, especially because Ledger has stated that he dislikes most superhero films. But Nolan wasn't simply filming any old superhero film. After redefining Batman as a masked do-gooder for our hazardous post-9/11 times with Batman Begins, Nolan may have fashioned the definitive Bush Years picture about the anxiety and misery that seeped into American society during the start of the War on Terror. And he did it all while wearing a bat costume and a clown costume.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>To a terrible degree, Ledger personified this. Unlike Nicholson, who made the part an extension of his on-screen image, Ledger completely immersed himself in the role. His Joker was damaged by a Glasgow smile chiseled into his face, not by chemicals. And, like The Killing Joke, he has several explanations about how those scars came to be, each one a deception designed to frighten the victims he'll soon carve equally gruesome grins into. This anarchist in a purple suit, perched above that horror show, has green hair that's become stringy from years of not washing. His teeth are as yellow as the school buses he robs, and his make-up was applied quickly, obscuring the actor's innate good features behind a sea of red, white, and craziness.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Filmmakers have remained tight-lipped about how Ledger built this beast after his death, although he reportedly played every take differently and personally recorded the shaky cam terrorist films the Joker sent out to cable news outlets. Nolan opted not to be in the room when Ledger shot the Joker's final video threat to the \"bridge and tunnel throng\" because he was so engrossed in his character's restless and spastic gestures.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Unfortunately, Ledger died before the film was completed. He died of an accidental overdose of prescription medicines on January 22, 2008. Due to sleeplessness, the actor accidentally combined too many sleeping medications. He did not survive to witness the Oscar he received for his performance, despite being a parent and yet just 28 years old. He, on the other hand, earned it. In a medium that has given us Anthony Hopkins' Hannibal Lecter, Louise Fletcher's Nurse Ratched, Malcolm McDowell's Alex DeLarge, Anthony Perkins' Norman Bates, Javier Bardem's Anton Chigurh, and Darth Vader, Ledger took comics' greatest evil and made him just as diabolical and impenetrable. That pantheon includes his Joker.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Joaquin Phoenix</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981818766_d865a0f02d_h.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Joker, played by Joaquin Phoenix, is poised to enter theaters, but he's already caught the public's imagination. Phoenix stars in a deconstructionist piece set in the early 1980s instead of 2019. As the only Joker to receive his own film, Phoenix stars in a deconstructionist piece set in the early 1980s instead of 2019. Returning to Ledger's sloppy self-applied make-up, there is something even more sinister about Phoenix's expression that resembles serial murderer John Wayne Gacy as much as it does the comic book character.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Phoenix does not play the Joker as a showman in this performance, which combines introverted tendencies. Rather, he is a loner from the mid-twentieth century who is attempting to imitate what he perceives to be style. His motions are influenced by the likes of Fred Astaire, Frank Sinatra, and Johnny Carson, the latter of whom is recreated by Robert De Niro as Franklin Murray, a late-night comic in the Carson mold. It's also a nod to De Niro's performance in The King of Comedy. Phoenix's Joker, a gory portrayal of entitled wrath, is frighteningly closer to our real-world monsters than Nolan's supernaturally brilliant anarchist or Nicholson's typical comic book villainy.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The fact that Phoenix is portraying the Joker comes as a bit of a surprise. Phoenix was heavily courted by Marvel Studios for the part of Doctor Strange in 2015. However, the actor walked away, perhaps fearful of a multi-film deal. He's subsequently said something slightly conciliatory about Marvel, adding that \"they keep the fucking business running in some manner,\" but he's still not a fan of the superhero and blockbuster style.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>He was nominated for an Academy Award for his performance, which has led to more popular leading roles in the years thereafter. In M, he was a far more likable co-lead to Mel Gibson. Phoenix got his second Academy Award nomination for his performance as Johnny Cash in James Mangold's Walk the Line, in which he did his own singing (reducing his natural singing voice by an octave). He also expanded his acting resume by focusing on auteurs such as Paul Thomas Anderson, for whom he directed both The Master and Inherent Vice. He drifted toward art house work during this period, even feigning his own retirement from the industry when he pretended to be an out-of-control alcoholic actor who wanted to start a music career as a rapper... it turned out he was only a slightly-in-control actor pretending to be drunk and retiring in order to star in Casey Affleck's bizarre mockumentary, I'm Still Here.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Phoenix has had a varied and diversified career, ranging from backing heavy metal to movie star to more of an artsy performer who enjoys leaning into gravelly muttering. It's also resulted in exquisite works like Lynne Ramsay's You Were Never Really Here. All of this adds to the weird satisfaction of his donning the purple outfit.</p>\n                </div>\n                ","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Jared Leto</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51981818871_a8419dfa2f_b.jpg\" alt=\"joker, dark knight, batman, heath ledger, Cesar Romero, Jack Nicholson, Mark Hamill, Jared Leto, Joaquin Phoenix\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Jared Leto's Joker is as different from Heath Ledger as Heath Ledger was from Jack Nicholson. Director David Ayer and Leto constructed a virile Joker who is overly glamorous and preoccupied with embracing \"thug life\" tropes, just as Nolan's version was averse to \"traditional\" imagery of the Clown Prince of Crime—perhaps even more so, given his bleached skin.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Leto's Joker is just as likely to be found making it rain at the club in Suicide Squad as he is in a funhouse, with comparisons to Al Pacino's Tony Montana from Scarface and James Franco's dimwitted Alien from Spring Breakers. The entire premise of Ayer's film is candy-colored nihilism disguised as a superhero origin narrative trope. However, Joker is just a minor character in the picture, as it features the long-awaited and theatrical debut of Harley Quinn, played by Margot Robbie. Nonetheless, landing Leto for the part so soon after his Oscar win for Dallas Buyers Club was a significant coup.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_binance__Z4f5r\">\n                <a class='ArticleBody_adsContainer__6XXMm' href='https://www.redbubble.com/i/metal-print/The-Joker-Zine-Version-2-by-HeisenbergPrint/106832860.0JXQP' target='_blank'>\n                <img class='ArticleBody_adsImage__Rp6rW' src='https://live.staticflickr.com/65535/51981925661_abe5a2c608_b.jpg' />\n                </a>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Leto's Joker was more methodical than even Ledger's, to doubtful effect. According to reports from the Nolan set, Ledger was not \"in-character\" between takes, but Leto wanted to be the Joker at all times, and he expected his co-stars to respect him as such. Viola Davis, for example, claimed that on her first day on set, Leto had a dead pig dumped on her desk, which terrified her. Similarly, he delivered a live black rat in a giftwrapped box to Margot Robbie, who plays the Joker's lover. He went on to send her and her fellow cast members condoms and anal beads.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Because the Joker is scarcely present in the finished picture, any enthusiasm it may have generated on set is largely subdued. With the exception of Robbie, the Joker has minimal screen time with any of his co-stars as he pursues the titular Squad to reclaim Harley. In fact, despite his tattoos and metal grills, his Mistah J is actually more devoted and loyal to Harley than the comic book or The Animated Series counterparts. In the comics, Joker and Harley are often in an abusive relationship, with him seemingly unconcerned about what happens to her. He famously pushed her out a window and placed her in the hospital when she captured Batman on her own, because only he was permitted to kill the Batman. However, in the film, he is determined to reclaim Harley. When he's not on the hunt, he's hanging out with mobsters in tuxedos and going to strip joints to collect his ten percent. He is, without a doubt, the most narrow-minded Joker ever shown on film, even if he is presented in the broadest sense.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>If Leto is given another shot, he should get those tattoos removed and be given more work, because he does exude an animalistic energy, slithering around the other actors like a shark determining who to attack. That, however, may be a misnomer because his performance is so wide that it lacks any bite.</p>\n                </div>\n                "]},"reco":[{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"},{"id":"2d2a043a-6744-4343-b320-79dc5ca864c6","date":"Aug 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52280227358_0d847987e5_o.png","title":"Movie Review: Molly’s Game","tags":"movie news","excerpt":"Molly's Game, Aaron Sorkin's first film as a filmmaker, has a lot to chew on. Here is our analysis."}]},"__N_SSG":true}