{"pageProps":{"article":{"id":"9aeaa841-f8d6-416f-b890-edd687d3e53a","date":"Jun 15, 2022","author":"Brian Martin","title":"Why Is The Wire Still Relevant After 14 Years?","excerpt":"The Wire is still one of the most important and recognized television series of all time, twenty years later.","keywords":"The Wire 20 years later","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52147119867_4eaed72801_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire is a classic in serial television and an essential archive of American culture, created by David Simon, a former crime reporter for the Baltimore Sun. It's been 10 years since the fifth and final season of Game of Thrones aired on HBO, and Barack Obama has praised it as \"one of the greatest – not just television shows, but pieces of art in the last couple of decades.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Despite its critical success, The Wire garnered little attention, if any, throughout its first season. The show got just mediocre ratings and no major honors over the course of seven years and five seasons. The sluggish pace, slang-filled conversation, and primarily black cast made it opaque to many viewers, and it was dismissed as simply another cop show on the horizon. Why, therefore, has The Wire persisted to attract new viewers throughout the years?</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire was always more than just another cop drama; it was a study of a modern American city and its institutions, both legal and illegal, that perpetuate a cycle of inequity, violence, and corruption. The impact of this discourse has only grown in the last decade, and it continues to educate and instigate debates in the United States about drug policy, policing, and racial relations. The Wire is currently taught in sociology, literature, law, criminal justice, public health, and business courses at over thirty colleges throughout the country. Indeed, it's an influence that hasn't always been welcomed in the halls of power; former Baltimore Mayor Martin O'Malley is said to despise the program \"with a tense passion,\" and residents have frequently criticized the show's bleak portrayal of their city.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire was hardly the only show of its time to elicit such intense feelings. It debuted as part of a much larger trend in American television, a \"Golden Age\" of cable drama marked by a creator-driven approach and intricate, serialized tales. With their prison drama Oz, the first hour-long television serial created by a premium American cable network, HBO pioneered this new style of long-form storytelling in 1997. The Sopranos, a legendary criminal drama that premiered two years later, refined the concept and began a revolution that has paved the way for everything from Six Feet Under to Game Of Thrones, House Of Cards, and The Crown.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire was one of several TV dramas that aired during this time period, but its achievements were unique. The breadth of issues and depth of character development were unlike anything else available at the time, or since. David Simon's portrayal of the Baltimore underworld cast a sympathetic light on aspects of society that are frequently overlooked by popular entertainment, and the complicated truth was never softened with easy answers. It was subtle, complicated narrative, distinguished by shades of grey rather than binary morality, and brave to portray America as it is, rather than as we envision it on film. African Americans, women, queers, drug users, and drug traffickers were all in the vanguard of this Baltimore, and they refused to be defined by the preconceptions of the audience.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52148377664_07f098fdb3_b.jpg\" alt=\"The Wire 20 years later\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Indeed, examining The Wire's portrayal of LGBT people of color reveals that the film industry is still catching up to what television accomplished more than a decade ago. Moonlight, Barry Jenkins' Oscar-winning drama from 2016, was lauded for its sophisticated examination of black male identity and sexuality, although these were themes covered by The Wire over a decade before. Michael K Williams' outstanding portrayal of Omar Little, a gay con artist, shattered all expectations of what a black criminal should look like on television. Sonja Sohn played Kima Greggs, a lesbian narcotics investigator who had to deal with discrimination and personal sacrifice both at home and at work. When asked why he opted to make these characters homosexual, David Simon simply stated, \"Because gay people exist.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>People of color were depicted at every level of society, from politicians to police officers to students, in this manner, The Wire delivered a realistically diverse and varied view of identity in modern America. While Hollywood celebrates the success of blockbuster films featuring people of color this year, it's worth recalling that cable television took similar risks long before it was viable.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, seeing The Wire purely as a study of race is an oversimplification. The program goes to considerable lengths to expose the numerous social strata that choke every business and organization in Baltimore. This is best exemplified in a scene from season one, episode three, \"The Buys,\" in which drug dealer D'Angelo Barksdale tries to teach two of his underlings the principles of chess by comparing each piece to a different aspect of the drug trade. The King, of course, represents the boss, Avon Barksdale, and the Queen, Stringer Bell, his astute enforcer. Similarly, the rook symbolizes a drug storage facility, while the pawns depict warriors on the streets. The boys' attention swiftly rises up the hierarchy when they recognize themselves as the latter. \"How did you end up as King?\" \" one of them inquires. The response is, \"It ain't like that.\" \"The king must remain king.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire swings across Baltimore over the course of five seasons, from street corners to docks to City Hall, yet the same, inflexible power structures characterize every institution. Rather than merit or distinction, seats of authority, such as Mayor or ownership of a drug empire, are awarded based on political convenience and privilege. Corruption permeates all levels, leaving even the lowest-ranking police officer and the most powerful union leader with dirty hands and debts to forces beyond their control. Meanwhile, as street gangs battle in a constant tug of war over blood-soaked territory, government enforcement is hampered by unlikely targets and budgetary constraints. It is a system that is designed to maintain the status quo, ensuring that the monarch will always be the king.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Although some have claimed that this is a fatalist perspective, it does not imply that change is impossible, but rather that if change is genuinely desired, it must occur across society. The West Side's street corners and the halls of government are inextricably intertwined, and none can be altered without the other. Above all, the show contends that if we are going to find answers to the social challenges that continue to plague American society, we must reassess our beliefs about race, power, and justice. Baltimore's drug war is still a never-ending fight of attrition ten years later, and the city's murder rate is at an all-time high. The Wire may not have all of the solutions to this disaster, but it does point us in the right direction.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The most apparent consequence of The Wire today, however, may not be its social or political ramifications, but rather the acting careers it created on both the big and small screens. Idris Elba, a Hackney native, garnered critical praise for his portrayal as wily drug kingpin Stringer Bell in Prometheus, Pacific Rim, and the Marvel Cinematic Universe, and has since become a frequent presence in blockbusters such as Prometheus, Pacific Rim, and the Marvel Cinematic Universe. Meanwhile, with blockbuster performances in Fruitvale Station, Creed, and Black Panther, Michael B Jordan has quickly established himself as one of Hollywood's most fascinating leading men. Jordan, who was only a teenager when he first debuted on The Wire, had a compelling presence as the tragically naive heroin dealer Wallace.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52148633315_7d7df6c7db_c.jpg\" alt=\"The Wire 20 years later\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Stars from The Wire have been in more contemporary television milestones in addition to big films. From season three onwards, Aiden Gillen, who portrayed ambitious politician Tommy Carcetti, swapped the hallways of Baltimore City Hall for those of King's Landing. His portrayal of the evil Petyr \"Littlefinger\" Baelish in Game Of Thrones catapulted him to new levels of fame, yet he still makes time to participate in small films like the lovely 2016 comedy Sing Street. And, of course, there's Dominic West, who played maverick investigator Jimmy McNulty on The Wire and is now starring with Ruth Wilson in Showtime's The Affair.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, among these success stories, there are members of The Wire's cast who have struggled to capitalize on their fame. Michael K Williams played Omar Little, the show's most intriguing character, and was similarly impressive as Chalky White in HBO's Prohibition-era thriller Boardwalk Empire. Despite this, he has been primarily relegated to supporting roles and walk-on appearances in recent mediocrities such as Robocop, Ghostbusters, and Assassin's Creed, instead of securing the major roles he clearly deserves. Clarke Peters, who played Detective Lester Freamon on The Wire for five seasons, has had a similarly poor journey. Blink-and-you'll-miss-him roles in 2014's John Wick and this year's Oscar contender Three Billboards Outside Ebbing, Missouri are highlights, but he's most commonly seen straddling numerous TV series (including, inexplicably, British detective dramas Death In Paradise and Midsomer Murders).</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Wire's legacy has been inconsistent, much like the careers of its different performers. Others have condemned David Simon for an excessively cynical view on a genuinely varied and dynamic city, while some have complimented him for starting candid talks about race and policing in modern America. Whatever one's opinion, the program has left an indelible effect on American society and established a standard against which other crime dramas must be compared. Unfortunately, its potency has been bolstered by the reality that there are still more lessons to be learnt. \"The poisonous combination of drugs, weapons, and joblessness captured by The Wire in 2002 still continues,\" David Smith noted in the Guardian in 2016, while \"progress is brutally unequal.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>As The Wire came to a close 14 years ago, the show's most hopeful fans must have believed that the divided society it had represented was finally coming to an end. Barack Obama, the country's first African-American president, came into office with a promise of change and, above all, hope. The Wire still feels depressingly relevant today, in the wake of Freddie Gray, Black Lives Matter, Donald Trump, and so much else.</p>\n                </div>\n                "]},"reco":[{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","tags":"tv news","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood."},{"id":"6006b928-df17-4339-83be-48c556f130b6","date":"Aug 17, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52291503484_5255d8337d_o.png","title":"Netflix And Chill With Park Seo-joon: Here Are All His Shows And Movies That You Can Watch On Netflix!","tags":"movie news","excerpt":"The romantic comedy king of Korea has arrived"},{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","tags":"movie news","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’"},{"id":"2d2a043a-6744-4343-b320-79dc5ca864c6","date":"Aug 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52280227358_0d847987e5_o.png","title":"Movie Review: Molly’s Game","tags":"movie news","excerpt":"Molly's Game, Aaron Sorkin's first film as a filmmaker, has a lot to chew on. Here is our analysis."}]},"__N_SSG":true}