{"pageProps":{"article":{"id":"0e10ab54-d010-4490-a9c2-e4084b5d2620","date":"May 31, 2022","author":"Brian Martin","title":"Why Is Christopher Nolan’s Film The Prestige Is Underrated?","excerpt":"Science fiction is concerned with the future. What will the technological advancements of the future decades look like? What will humanity's relationship with new technologies be like? And how far will we go to accomplish and capitalize on such breakthroughs? The Prestige, a film by Christopher Nolan released in 2006, plays with these great concerns.","keywords":"The Prestige Christopher Nolan","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52111534808_e9e865c70d_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The Prestige employs magic to deliver a very human cautionary story about how the only thing that corrupts more than power is the pride that frequently motivates man's pursuit of it.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Two competitive London magicians whose various obsessions with the illusionist's tradecraft dominate their lives both on and offstage are at the focus of Christopher Nolan's overlooked 2006 masterwork. In ways that make his pleasant, Vegas showman performance appear like a weak front; a mask masking a real, darker self that its bearer is ignorant of, Robert Angier (Hugh Jackman) is a charming and kind magician unaware of how total his desire to be the greatest is. On the other hand, Alfred Borden (Christian Bale) is more concerned with leaving his imprint in a way that can support his wife and daughter than he is with the renown and status that comes with 19th century magic shows. That is, until his rivalry with Angiers evolves into more convoluted territory, complete with a major sci-fi twist involving Tesla (!) and one hell of a climactic magic performance that forever transforms both their lives, as well as the lives of Borden's twin, also played by Bale.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Audiences anticipate Nolan's work to have twists like this, as well as suspense that keeps the plates spinning. But what is surprising here, in all the best ways, is how Nolan grounds all of the spectacular on the backs of human people who, despite their commitment to smoke and mirrors, seem entirely tangible. But the brilliance of Nolan's script for The Prestige — co-written by Nolan and his brother, Jonathan, and based on Christopher Priest's novel — is the level of emotional storytelling the filmmakers employ when all of that smoke and mirrors collapse into one frame, sparking a series of very real and tragic consequences for the men who spend their entire careers cheating such things to the tune of enabling applause.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52111498431_95a67f66ba_k.jpg\" alt=\"The Prestige Christopher Nolan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The trick that both makes and ruins Angier's career is \"The Disappearing Man,\" in which Angier locates the reclusive inventor Tesla and persuades him to use his work with electricity to draw something more than infinite scarves from his sleeve. Despite his doubts, Tesla constructs a \"magic box\" that appears to be more smoke and mirrors at first, albeit highly high-tech. However, Angier quickly discovers that the gadget has the ability to clone and transport its user. As a result, Angier duplicates himself on several occasions, while Borden utilizes his twin to do his own double-crosses. The ladies in Angier and Borden's lives become caught in the middle of this huge, vicious game of one-upmanship. The film's fundamental rivalry begins with the death of Angier's wife (Piper Perabo). Then, an ambitious assistant (Scarlet Johansson) has her heart shattered by both Angier and Borden (and Borden's double), but she maintains enough dignity to leave this dangerous carnival.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The suicide of Borden's wife (Rebecca Hall) is the emotional gut blow that seals Angier and Borden's fate, brought on by the emotional yo-yo her partner and his twin kept him on. Prior to this point, Nolan's Prestige feels like an illusionist's version of The Sting, a protracted con with dark turns along a mainly enjoyable path. But Nolan deftly, deftly turns the screw and pulls at our emotions by demonstrating that even those who wield magic are mortal.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>From here, The Prestige ramps up the slow-burn intensity and completely commits to becoming a 19th-century version of a Twilight Zone feature-length episode. And it is in this dedication that Nolan shines; as good as Batman Begins and The Dark Knight are, they pale in comparison to Nolan's god-tier level of character-first narrative. We never get ahead of the characters, which makes the reveal behind Angier's master deception all the more shocking — and the destiny he suffers all the more tragic. You may say that when Angier first puts himself through the Disappearing Man, the original never acquired the status for which he endangered his life. The real Angier appears to have perished in the process, with his clone emerging victorious and receiving the ovation Angier yearned for but never received. (This reading appears to fit best with Nolan's unrelenting attitude to the story's sad foundations.) After then, all further usage of the Disappearing Man include nothing but copies of copies going in and out. And each night that Angier pulls off the ruse, the curtain falls on a new version of the same man, far from the smiling romantic we initially met.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52111498171_a38fc2d085_z.jpg\" alt=\"The Prestige Christopher Nolan\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Borden survives the ordeal (at least half of him does), but he does not get to go away undamaged.\nBorden is physically and mentally damaged after witnessing his adversary die at the hands of his life's ambition, which Nolan believes is doomed to fail. And loss. That one's dreams must not surpass one's principles and morality, or else inescapable nightmares and disaster would result.\nWhen one's professional hobbies take precedence over life's more significant activities, none can sustain the other.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Nolan is a gifted storyteller, but no other picture on his resume seems as full or as resonant as The Prestige. Nolan's enormous abilities are at their height in these last sequences, with these final surprises. Particularly in terms of emotional narrative. Like an audience member at a magic performance, he ties up all the loose ends in ways that make you want to go back and re-examine what you just saw. You won't believe your eyes, but you will believe how the film's last, frightening picture makes you feel.</p>\n                </div>\n                "]},"reco":[{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","title":"Best Korean Horror Films That You Should Watch","tags":"movie news","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category."},{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","tags":"movie news","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”"},{"id":"752f193e-a990-4687-80d9-2b09f15e536b","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217253121_c911bcc830_o.png","title":"David Fincher’s Zodiac: 15 Years Later","tags":"movie news","excerpt":"Why the Zodiac Killer is still a ghostly presence in our lives years after David Fincher's masterpiece."},{"id":"f604210e-6a8c-4508-9669-4745d39bf7c0","date":"Jul 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52212039877_a813967c89_o.png","title":"How the Marvel Cinematic Universe was influenced by The Dark Knight","tags":"movie news","excerpt":"Although The Dark Knight is often regarded as the pinnacle of superhero movies, did it really have an influence on the more well-known Marvel Cinematic Universe?"}]},"__N_SSG":true}