{"pageProps":{"article":{"id":"e238699d-70f7-40a4-a096-a586eb6fd1e7","date":"Jul 8, 2022","author":"Brian Martin","title":"Stranger Things: The Real-Life Inspiration Behind Eddie Munson","excerpt":"Season 4 of Stranger Things' inaccurate charge of Eddie Munson was based on a true story of Satanic fear.","keywords":"Stranger Things Season 4, Eddie Munson, Netflix Stranger Things","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52201616346_be60795aaf_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Stranger Things' creators, the Duffer Brothers, may be brilliant storytellers, but they freely confess that they were influenced by real-world conspiracies and true crime tales. While longtime viewers may have be aware of how the Hawkins Lab got its start as part of the Montauk Project, other viewers might not be aware that Eddie Munson's fatally misguided suspicions were also based on true events that happened in West Memphis, Arkansas, in 1993.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Three teens known as the West Memphis Three were charged with killing three eight-year-old boys in what the media said was a Satanic sacrifice. Police investigators at the time mistook heavy metal music, which Eddie Munson would have surely appreciated, for \"the music of the devil.\" West Memphis neighbors and the police quickly accused the metal-loving, long-haired teens, who were seen as outsiders by the rest of the Satanic panic-stricken neighborhood, despite the lack of any proof.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The police investigation and trials that led to the conviction of Damien Echols, Jessie Misskelley Jr., and Jason Baldwin on three charges of murder in March 1994 drew heavy criticism in the years that followed the verdict. The case was the focus of the HBO documentary Paradise Lost from 1996 as well as Amy Berg's 2012 film West of Memphis, which Peter Jackson and Echols co-produced.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”When you talk about satanic panic, Damien Echols [has] a tragic story we’ve been obsessed with. I think we saw the HBO documentary Paradise Lost. We were in high school when we first caught those, and then, of course we saw West of Memphis. It seemed like a really great character and a means to explore Satanic panic, and that’s why [Eddie] kind of had tragedy etched all over him.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52201618251_129143568d_b.jpg\" alt=\"Stranger Things Season 4, Eddie Munson, Netflix Stranger Things\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The West Memphis incident is referenced in other places in Stranger Things as well. The guidance counselor at Hawkins High School who was assisting Chrissy and Max, among others, was called Miss Kelley; this was probably a homage to Misskelley Jr. The fact that one of the murder victims had the last name \"Byers\" also seems to match with the season 1 plot of Will Byers' paranormal kidnapping.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Eddie would have likely faced wrongful imprisonment similar to that of Echols and his black-clad friends, who were on death row until the Paradise Lost movies and new DNA evidence helped in their release in 2011. Despite Eddie's heroic moment in the Stranger Things finale, the Hawkins townspeople still believed he was responsible for Chrissy's death, and he would have likely faced a similar fate. The men maintain their innocence, but because of the Alford plea agreement, the court still views them as having committed the crimes. Despite Echols, Misskelley, and Baldwin asking the state of Arkansas to do additional DNA testing, the true killer has never been found.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”Even had he survived the season, you know it wouldn’t have ended well for him. He would have been demonized and blamed for all this. The minute that Chrissy died in his trailer, it was the end for a character like that. He either ends up dead or in jail, and that’s the tragedy ultimately of Eddie Munson. There was nothing really our kids would have been able to do for him.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Eddie may not have rolled a natural 20 in his battle against Vecna the way the Hellfire Club did in his Dungeons & Dragons campaign, but he made his perfect roll with Stranger Things viewers at the end of an exciting season. At least Eddie went out rocking hard to the metal sounds of Metallica's \"Master of Puppets.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_relatedNext__4ybLJ'>\n                <p class='ArticleBody_relatedCap__07hkO'>READ NEXT:</p>\n                <a class='ArticleBody_relatedTitle__uyeq1' href='565c5bdf-8b55-48f4-b7cf-77b659a6f1d8'>According to the creators of Stranger Things Season 5, fans will be left wanting more</a>\n                </div>\n                "]},"reco":[{"id":"9a6591fc-ad8b-4b29-9122-3ecb7f3f955a","date":"Jul 19, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52226487424_7ec3187363_o.png","title":"Best Korean Horror Films That You Should Watch","tags":"movie news","excerpt":"Since decades, South Korea has produced excellent motion pictures and television shows, particularly in the horror category."},{"id":"b21195fa-f5aa-476d-9b96-1b88d1231aed","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217394266_7172bf92d7_o.png","title":"The Russo Brothers Reveal Their Favorite Marvel Phase 4 Movie","tags":"movie news","excerpt":"The co-director of the blockbuster Avengers: Endgame, Joe Russo, reveals which of Marvel's Phase 4 films he thinks is “pitch-perfect.”"},{"id":"752f193e-a990-4687-80d9-2b09f15e536b","date":"Jul 15, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52217253121_c911bcc830_o.png","title":"David Fincher’s Zodiac: 15 Years Later","tags":"movie news","excerpt":"Why the Zodiac Killer is still a ghostly presence in our lives years after David Fincher's masterpiece."},{"id":"f604210e-6a8c-4508-9669-4745d39bf7c0","date":"Jul 13, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52212039877_a813967c89_o.png","title":"How the Marvel Cinematic Universe was influenced by The Dark Knight","tags":"movie news","excerpt":"Although The Dark Knight is often regarded as the pinnacle of superhero movies, did it really have an influence on the more well-known Marvel Cinematic Universe?"}]},"__N_SSG":true}