{"pageProps":{"article":{"id":"00ea2af1-4379-4d41-b68a-1e3176e5be09","date":"Jun 4, 2022","author":"Brian Martin","title":"How Community Prepared The Russo Brothers for Marvel","excerpt":"The Russo Brothers talk about how their work on the cult sitcom Community prepared them for blockbusters like Marvel's Avengers: Endgame.","keywords":"The Russo Brothers community mcu","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52121439835_8627ef6098_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe Russo remembers long days on the set of Community, and how infrequently they ever ended.\nIn retrospect, the entire event was a blur, a frantic marathon in which each episode presented its own race toward a moving finish line. But, more than a decade after his time on the set of that cult sitcom, the director plainly values the experience. While he and his brother Anthony Russo have gone on to larger and better things, including the largest worldwide smash of all time with Marvel Studios' Avengers: Endgame, he still speaks fondly of his time working on Dan Harmon's comedy.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”I remember sleeping in my trailer quite a bit on that show. I was getting three or four hours of sleep a night because I would go from set straight to editorial at two in the morning. Then I would go to sleep in my trailer for four hours, get up, and be back on set at 7 a.m. the next day. And I did that for the better part of two years.” - Joe Russo</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Indeed, before becoming household names as directors of some of Marvel Studios' most popular films—Captain America: The Winter Soldier, Captain America: Civil War, and the last two Avengers films—the Russo Brothers were honing their craft on a sitcom that grew far more ambitious than anyone expected, including the network that greenlit it, NBC. The series struggled in its time, having to balance network sitcom expectations with a desire to change tone, aesthetics, and even genre from episode to episode—in addition to the Russos in the director's chairs and future Rick & Morty co-creator Harmon, it also introduced Donald Glover, Alison Brie, Ken Jeong, and Jim Rash to a wide national audience—and is now fondly remembered for the talent it helped shine an early spotlight on.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe and Anthony were in the forefront of establishing that voice, which began when they collaborated on the Community pilot. Over the next three seasons, they alternated directing responsibilities and helmed numerous episodes of the series, with Joe directing fan favorites \"A Fistful of Paintballs,\" \"For a Few Paintballs More,\" and \"Advanced Dungeons & Dragons.\"</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52121439880_7eafd85ae9_o.jpg\" alt=\"The Russo Brothers community mcu\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It was the second of two comedy masterpieces that the Russos were a part in, having previously directed the pilot and several episodes of Arrested Development. Looking back, Joe readily cites Community's tonal complexity and wide ensemble as useful training for handling the Marvel universe's much larger collection of heroes.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“Arrested Development was a very complicated ensemble show, and I think Community even more so in a lot of ways. It endeavored in 22 minutes to put a little bit more heart into the endings of episodes, which is very difficult to pull off in such short-form storytelling. And I think there were more characters in Community than there were in Arrested Development, ultimately. And so Community was about as difficult as it gets in television because we’re delivering 20 episodes a season, and doing it on a weekly basis, changing genre every week, changing tone every week, and dealing with sometimes 10-plus characters in 22 minutes and trying to stick an emotional landing. Doing that for several years, it hones your ability to handle complex narrative and juggle a lot of pieces while trying to also be efficient and add emotional complexity. So yes, it prepared us in a way that I don’t think anything else could for the volume that we tackle, and it really supports our high-functioning ADD in a wonderful way.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In retrospect, and as he and Anthony prepare to release their latest film—a new action film starring Ryan Gosling, Chris Evans, Ana de Armas, Jessica Henwick, Regé-Jean Page, and Billy Bob Thornton—Joe suggests that Community is the type of experience that young and hungry filmmakers should seek out.</p>\n                </div>\n                "]},"reco":[{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."}]},"__N_SSG":true}