{"pageProps":{"article":{"id":"119b2778-91fa-49b5-85ed-bb94dab1f369","date":"Apr 13, 2022","author":"Nick Carver","title":"Maisie Williams Reveals Whether She'd Consider Returning For A Game Of Thrones Spinoff","excerpt":"Maisie Williams, who played Arya Stark in the original series, discusses if she'd consider reprising her role in a potential Game of Thrones spinoff.","keywords":"game of thrones, arya stark, Maisie Williams","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52000704142_b5dbf6f77c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if most Game of Thrones fans would want to see more of Williams' beloved portrayal in the part, the topic of Arya's return is sure to be divisive among fans. Many fans want a complete redo of Season 8, and any future movie or show using any of the original characters would have to deal with the fallout. Williams' careful consideration of the in-universe context before giving any approval appears to be a wise move. While Arya is perhaps the least contentious choice to bring back, given that her story is largely seen as having lived up to its original promise, Williams' careful consideration of the in-universe context seems like a wise move.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>While the program featured an ensemble cast of characters with linked stories, Williams' Arya Stark was one of the most popular protagonists, with one of the show's most dramatic arcs. Despite her stubborn spirit, which she shared with the other Stark siblings, she was trained as a Faceless One, which she subsequently used to wreak devastation on her family's adversaries. She became one of the show's most accomplished heroines in Season 8, as she was the one who eventually killed the Night King and defeated the White Walker danger.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Williams is now being questioned in a GQ piece if she would consider repeating her part in a future Game of Thrones spinoff project. While she doesn't rule it out completely, she makes it clear that her response is in no way a confirmation, and that no such return is presently in the works. Williams, on the other hand, would be open to an Arya comeback provided it made sense for both her career and the Game of Thrones world.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>I’m not saying it would never happen, but I’m also not saying it in this interview so that everyone goes… [gasps] 'The spin-off! It’s coming!' Because it’s not. It has to be the right time and the right people. It has to be right in the context of all the other spin-offs and the universe of Game of Thrones. [...] It has to be the right time for me.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52001718021_b9d372f54b_c.jpg\" alt=\"game of thrones, arya stark, Maisie Williams\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even if most Game of Thrones fans would want to see more of Williams' beloved portrayal in the part, the subject of Arya's reappearance is sure to divide viewers. Many viewers want a complete redo of Season 8, and any future movie or show returning any of the original characters would have to face with the weight of that criticism. Williams' careful consideration of the in-universe context before giving any approval appears to be a wise move. While Arya is perhaps the least contentious choice to bring back, given that her story is largely seen as having lived up to its original promise, Williams' careful consideration of the in-universe context before giving any approval seems like a wise move.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>However, the anticipation for the impending Game of Thrones spinoff House of the Dragon indicates that fans are eager to return to Westeros. The new series has the advantage of being set a few centuries before the events of its parent program, which means it doesn't have any of the show's narrative baggage and has a genuine chance of recapturing the enchantment that enchanted so many people around the world. Game of Thrones season 8's failure may even work in its advantage, reducing expectations to the point where any amount of success would be welcomed by returning viewers.</p>\n                </div>\n                "]},"reco":[{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."}]},"__N_SSG":true}