{"pageProps":{"article":{"id":"20f21369-01e5-4314-ba58-8357fd692e7a","date":"Aug 22, 2022","author":"Brian Martin","title":"The Heirs of the Dragon: House Of The Dragon Episode 1 Review","excerpt":"The first episode of the television series \"House of the Dragon\" features plenty of dragon blood.","keywords":"House Of The Dragon Episode 1. Game Of Thrones Easter Eggs, Ending Explained, A Song Of Ice And Fire, Daenerys Targaryen","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52302597816_9d2b77723c_o.png","content":["\n                <h2 class=\"ArticleBody_heading__tc5g4\">House of the Dragon is an American fantasy drama television series that is a prequel to the television series Game of Thrones (2011–2019), both based on the A Song of Ice and Fire novels by George R. R. Martin.</h2>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Pure fantasy fiction may be found in the sweeping A Song of Ice and Fire books by George R.R. Martin and the HBO television series that is based on them. There are no dragons, Targaryen dynasty, or country of perpetual winter, despite Martin's occasional borrowing from actual Medieval history.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Even with all the ice zombies and red witches, Game of Thrones' popularity was largely due to how seriously it treated its status as a fictional account of history. Although it wasn't a representation of our past, it might just as well have been. Aegon the Conqueror colonized a region that would later give rise to the country of capitalistic pleasures people currently enjoy, and there is a contemporary King's Landing somewhere out there in the universe.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Let's have a look at the first prequel to Game of Thrones, House of the Dragon. It was adapted from George R. R. Martin's prequel novel Fire & Blood and is told from the viewpoint of Westerosi historian maesters. The pseudo historical fiction aspects of George R.R. Martin's work are highlighted much further in the first episode of this HBO series. \"The Heirs of the Dragon\" might just as easily be a lost pilot of a royal historical drama like The Crown or The Tudors, despite an expanded budget that permits many more shots of CGI dragons.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>And what about that? That's really great.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's difficult to predict how House of the Dragon's debut episode will be received by casual Game of Thrones watchers and those who haven't read the A Song of Ice and Fire books. However, ASOIAF geeks must be content as pigs in dragonshit. Ryan Condal, a close friend and ardent ASOIAF fan, was personally chosen by George R.R. Martin to serve as showrunner for this first post-Thrones project. That is now coming across as a wise, necessary choice rather than the result of writerly arrogance or cronyism. Only a group of devoted devotees, like Condal and co-showrunner Miguel Sapochnik, could make sense of the other history Martin has built since it is so intricate and deep.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"The Heirs of the Dragon\" is in many respects superior since it is a much more concentrated experience, even if the Game of Thrones opener, \"Winter is Coming,\" will probably always have the sentimental edge for most people as it served as their introduction to Westeros. The only other location other than a pre-credit flashback among the ruins of Harrenhal is King's Landing, specifically Viserys I's royal court there.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The first Harrnehal scene is incredibly crucial because it creates the historical backdrop (there we are again talking about history) for the subsequent events. On the Iron Throne, King Jaehaerys I is in his 60th year. Even though \"The Old King\" or \"The Conciliator,\" as he is frequently known, is possibly the greatest ruler Westeros has ever seen, a difficult succession issue has to be resolved close to the end of his rule. There are at least 14 people who believe they are eligible to succeed the monarch, who has lost both of his sons. Enter the Great Council of Harrenhal, where all of Westeros' great lords assemble to discuss and finally decide the matter. The lords of Westeros ultimately choose Viserys, Jaehaerys' fourth son, over Rhaenys, Jaehaerys' third son.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Game of Thrones spends a lot of time thinking about the past. The only thing the lords of Westeros could care about was their own past, despite the grave threat posed by the white walkers just beyond the wall. Who engaged in combat with who? Which home could boast the most valiant acts? What mysterious royal deed, and when, set what precedent? What really counts in a world without a widely read code of laws is precedence. We also witness the horrible precedent of primogeniture being set in this first scene.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The rest of the episode is cast in a gloomy shade by the memory of the Great Council at Harrenhal. Even when viewers are exposed to yet another overwhelming surge of George R.R. Martin characters with muddled names, this offers \"The Heirs of the Dragon\" a helpful feeling of coherence that roots the episode's major themes and narrative. Yes, it's possible that the typical Game of Thrones watcher is still unfamiliar with characters like Viserys I (Paddy Considine), Rhaenyra (Milly Alcock), Daemon (Matt Smith), Alicent (Emily Carey), and Corlys Velaryon (Steve Toussaint). However, they are clear about their opinions on the crucial matter at hand: succession.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52301618582_27154e8f32_b.jpg\" alt=\"House Of The Dragon Episode 1. Game Of Thrones Easter Eggs, Ending Explained, A Song Of Ice And Fire, Daenerys Targaryen\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>At first glance, the Viserys I from this episode appears like a good guy all around. He lacks the political acumen of his ancestor Jaehaerys I, but he also lacks the deranged monster qualities of Daenerys's father Aerys II, commonly known as \"The Mad King.\" The Hand of the King Ser Otto Hightower (Rhys Ifans) and the most outstanding man of his time, Lord Corlys Velaryon, often known as \"The Sea Snake,\" have assembled an extraordinary little council to govern the kingdom. Viserys seems more content to joke around around the Small Council table than to hear Lord Corlys' well-researched comments on military alliances in the east.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Yet, hey! Not awful at all. The Jaehaerys era's tranquility is still present in the realm, and Viserys hasn't yet done anything to disturb it. Viserys also seems to sincerely revere and defer to his beautiful wife, Lady Aemma Targaryen, nee Arryn (Sian Brooke). Even when she severely informs him that the kid she is carrying now will be her last, he pays attention to her. She has endured difficult labors, and she cannot bear to lose any more kids. Of course, the issue is that King Viserys has already pushed Lady Aemma over the point of no return without their knowledge.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The fact that most, if not all, of Martin's characters are fortune's idiots is one of the supreme pleasures of his writing and comprehension of the human condition. Even the most well-intentioned Westerosians frequently have their lives taken over by outside forces like family, honor, and duty, which frequently results in their deaths. If Viserys and Aemma had been modest shopkeepers in Flea Bottom, he could have known that his wife's body had reached its carrying capacity and would not have pressured her into having another child. But he is a monarch, not a shopkeeper. A monarch also requires an heir, especially in light of the Great Council of Harrenhal's predilection for the king's male offspring, which was held just nine years ago.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Viserys's impatience is partly comprehensible and, if we're being really kind, may even be seen as selflessness. We all know that in the Game of Thrones, you either win or you die. For the sake of both his family and the country, Viserys must triumph. All of those choices still result in catastrophe.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Simply put, one of the most distressing things I've ever witnessed on television was Queen Aemma's death during delivery. The program alternates between shots of Aemma lying on her bed, pallid, sweating, and covered in blood, and shots of the agitated knights clashing maces in the jousting tournament. However, there is actually no way to compare the two. The breech delivery of Aemma and following crude C-section are far more intrusive, personal, and horrific. By the way, for our American readers, this could be a good time to contribute to the abortion fund in your state.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Of course, it's all for nothing, as these things sometimes are. Viserys receives his son, but the child passes away shortly after. Rhaenyra questions an indignant Old Valyrian during her mother and brother's conflagrant burial if his son's existence was the happiest period in her father's life. Though Viserys receives a lot of attention in this first episode, which is understandable, it is obvious that Rhaenyra will soon be responsible for leading House of the Dragon. Fortunately, it appears that Milly Alcock, a young actress, is more than capable of handling the role before Emma D'Arcy steps in as the older (albeit maybe not wiser) princess.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's tempting to draw comparisons between Arya Stark and any young female Game of Thrones heroine who questions the patriarchy. Although the fiery and independent Rhaenyra has a lot of Arya in her, she also seems to be very much her own person. Although she enjoys riding her dragon Syrax (and thus constantly smells like a dragon to her parents), she also seems at ease in a court setting. She studies beneath the huge weirwood tree in King's Landing with Alicent, the Hand's daughter, and the two of them love chatting about who is secretly expecting during the jousting competition.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Rhaenyra was frequently referred to as \"The Realm's Delight\" in the Fire & Blood legend because of her upbeat demeanor and regular attendance at her father's side after he designated her as his successor, according to Martin's maesters. Rhaenyra won't be a joy for very long now that her mother is dead and the Iron Throne is weighing heavily on her. But for the time being, it's just great to see someone enjoying fun in this gloomy world. Alcock and Carey have incredible chemistry, which makes Ser Otto's apparent plan to have Alicent wed Rhaenyra's father all the more disturbing. The phrase \"you might wear one of your mother's outfits\" hits you in the belly like pure dragonfire.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Overall, this first episode's acting is excellent, as it should be. Since the program has so far been subtly historical fiction, a lot of the action takes place inwardly as each character struggles with the many paradoxes demanded by their royal titles. In light of this, it is safe to say that Daemon Targaryen, the king's brother, is the House of the Dragon's most intriguing creation to date.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>I'll admit that when Matt Smith was chosen to play the erratic and sometimes vicious Daemon, I did not get the vision. Matt Smith, although being a superb actor, has a kind exterior, which he used to great effect as the Eleventh Doctor. We know Smith is physically capable of playing King's Landing's most corrupt officer thanks to that one flawless scene in Morbius, but can he actually embody someone so effortlessly entitled? It appears that he can, yes.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52301618587_290eb626a5_b.jpg\" alt=\"House Of The Dragon Episode 1. Game Of Thrones Easter Eggs, Ending Explained, A Song Of Ice And Fire, Daenerys Targaryen\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Daemon's sequences as his brother's nemesis (or Iron Throne swordprick) are exciting enough, but Smith truly excels in the jousting action that serves as the episode's midway climax. As he dismounts Gwayne Hightower's horse to embarrass the Hand of the King, Daemon enjoys being the bully. Then, it's quite exciting to see him get his comeuppance right away from the less-famous knight Ser Criston Cole of the Dornish Marchlands (Fabien Frankel). This is quite an introduction to Ser Criston, who will undoubtedly play a significant part in the Wars to Come.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The jousting sequences in general are this episode's strongest moments and the best proof that House of the Dragon has what it takes to match and maybe even top Game of Thrones. Even though I respect the show's commitment to portraying the \"actual\" history of these wildly improbable occurrences, pure historical fiction doesn't always make for compelling visual narrative. Before Game of Thrones became popular and attracted more funding from HBO, the majority of its episodes had a formulaic visual structure that featured well-dressed individuals discussing significant issues in various castle rooms. Those discussions were fascinating, for sure, but they also lacked some of the visual narrative opportunities that television can offer. It appears like House of the Dragon's budget and storytelling are already ahead of the curve of its parent series based on the sastsifying kinetic jousting sequences seen in its very first episode.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The promise that \"The Heir of the Dragon\" will push the boundaries of its \"just the facts, ma'am\" historical approach is also contained in the show's concluding minutes. Viserys informs Rhaenyra of some extremely mind-blowing news. House of the Dragon has now disclosed that Aegon I did not come to Westeros only to conquer it but to rescue the world, with George R.R. Martin's apparent approval. Every new Targaryen king is informed that The Long Night is approaching, and a Targaryen must be in power when it does.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>By the time Daenerys is born, we are aware that the knowledge has been gone. Is it feasible that Rhaenyra's time will bring an end to the royal telephone game? We'll just have to wait and see what the devoted researchers behind House of the Dragon uncover.</p>\n                </div>\n                "]},"reco":[{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."}]},"__N_SSG":true}