{"pageProps":{"article":{"id":"73c4f89b-1163-4ee9-8669-abeab2a05560","date":"Apr 24, 2022","author":"Alfred Bright","title":"The 'Endgame' Plot Point That Influenced the Series Is Revealed by the 'Loki' Writer","excerpt":"Loki Season 1 is now available on Disney+. Season 2's release date has yet to be confirmed.","keywords":"marvel, mcu, avengers endgame loki, loki variants","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52025734411_9639bb0e74_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>We're now in the second year of Marvel Studios' Disney+ period, and although fans are still debating how the newest episode of Moon Knight will finish, Loki was one of the finest Marvel series of last year.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Fans were doubtful about the outcome of a series based on this mischievous figure. However, out of all the Disney+ series so far, it turned out to be one of the most inventive and emotionally gripping storylines. It turns out that the program's creator and writer, Michael Waldron, was likewise a little unsure about how the show would function at first. While promoting his current effort, Doctor Strange in the Multiverse of Madness, Waldron spoke with The Playlist about how the series came to be and what affected their approach.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I remember I pulled off into a parking garage in Burbank, so Kevin Wright, our producer, could call me. And this is in November before Endgame came out. So he could call me and tell me what happened in Endgame, so I could know. Because I was like, 'How is Loki alive in the show?' How was there even a show? And so he called me, and he was like, 'So, Endgame is a time heist.' And I was like, 'Oh my God.' And it’s perfect.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52025733611_a7316cfaa7_b.jpg\" alt=\"marvel, mcu, avengers endgame loki, loki variants\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"I'm in a parking garage,\" Waldron said, jokingly. 'Somebody's going to shoot me,' I thought. So they had the idea that Loki was going to escape with the Infinity Stone and land at the TVA and run afoul of the TVA. But that was really it.\" With the fundamentals in hand, Waldron discovered he had a lot of room to work with when creating Loki.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“What that meant, what kind of adventure he went on, even what the TVA was, as an entity within the MCU and how we would adapt that from the comics, were all up for grabs. And so that’s when I came in and kind of pitched this Blade Runner-esque story about Loki being pulled in by the TVA to catch a variant of himself.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>He went into further detail about Kang's role in the show.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“He Who Remains is just kind of an old creepy guy in the comics, and I pushed and Marvel was very receptive to it, the idea, this should be a variant of Kang. Because I knew Kang was coming down the pipe as a villain in the MCU and it just felt too delicious to not have him intertwined in our time travel story somehow.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's fascinating to see how the events of Endgame set the way for Loki, and how the multiverse has essentially superseded the concept of time travel in the Marvel Cinematic Universe. Marvel is known for being ten steps ahead of the competition, and knowing how early Kang was considered for the role of MCU's new big evil should pique any fan's interest in the franchise's future. Endgame and Loki may seem like a long time ago, but it's always wonderful to be reminded that their ramifications can still be felt in the MCU today. The universe is virtually destroyed as a result of the events in Spider-Man: No Way Home, causing complications for characters like Doctor Strange.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>It's amazing to hear Waldron's firsthand account of working on some of Phase 4's best (and most anticipated) Marvel material. The multiverse boat would have sunk by now if it hadn't been for writers like Waldron.</p>\n                </div>\n                "]},"reco":[{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."}]},"__N_SSG":true}