{"pageProps":{"article":{"id":"784fda23-c9d9-41ee-b563-d84cd7ceb0b6","date":"Aug 15, 2022","author":"Brian Martin","title":"Park Seo Jun discusses his involvement with the MCU, his relationships with BTS’s V and the rest of the “Wooga Squad,” and the social and economic themes that influenced his TV successes Itaewon Class","excerpt":"Park Seo Jun: ‘I actually couldn’t believe Marvel wanted to speak to me’","keywords":"Park Seo Jun MCU, Park Seo Jun Itaewon Class, Park Seo Jun Marvel","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/52287305098_e1a05b3c74_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A brief exchange between wealthy student Min-hyuk and his friend Ki-woo in an early scene in Bong Joon-multi-Oscar-winning ho's film Parasite turns to be a pivotal moment. \"Help a wealthy child. The scooter-riding Min-hyuk informs the poor Ki-woo, who lives in a semi-basement house with his family, \"It pays well. Additionally, Min-hyuk serves as a link between the two worlds and initiates the story of the movie when he gives Ki-woo the chance to take over his position as a tutor for the wealthy Park family.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park Seo Jun plays Min-hyuk, and despite his brief presence in Parasite, it will have been the first time most overseas viewers had seen him well. However, Park is well-known in South Korea as a result of a number of popular local TV shows, notably romantic comedies like She Was Pretty and Fight for My Way, as well as the Netflix sensation Itaewon Class. As the third South Korean actor to join the MCU, he will now have a greater worldwide reputation thanks to the news that he would be acting in Captain Marvel 2: The Marvels alongside Brie Larson, Iman Vellani, and Zawe Ashton.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>“When I first heard that the Marvel Cinematic Universe wanted to speak with me, I couldn’t believe it. I actually couldn’t believe it,” says Park. Regarding the specifics, he chooses to keep silent. He smiles, seeming a little frazzled, “I’m just trying to be careful with Marvel-related questions.”\nBeing pledged to secrecy by the MCU stars is not surprising. “I’m not someone who has a fear of challenges, but whether I am filming in South Korea or abroad, everything is a challenge for me. So, I did feel some nerves at first. But everyone was so helpful and welcoming that I was able to find my feet really quickly.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park is in Seoul on the day we chat, having recently returned from filming in London. He is eager to begin speaking before his LA-based management joins the conversation to monitor any secret Marvel material since he appears animated in a green bomber jacket and a denim shirt.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>“I didn’t come from a wealthy family and we had to move around a lot as a result, but I was able to meet a lot of different people at school and that made me more mature. Some of my earliest memories from childhood are of me just trying to find my way, instead of memories of being happy all the time.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In Park's subsequent works, the issues of Korean social inequity and financial hardship that Parasite so eloquently revealed are also explored. In the 2017 television series Fight for My Way, Park portrayed Ko Dong-man, a taekwondo competitor who was forced to give up his Olympic aspirations due to mounting debt from his family and his sister's traumatic operation. Dong-man gives up on his goal and works as a pest control technician.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”People in their 20s in South Korea are actually having a lot of difficulties, when it comes to just living in general. During my early days of acting, it was very difficult for me. In your 20s you have to work really hard but also be careful with everything. Life, love, career, passion – everything. Fight for My Way was one of the best dramas that could possibly portray these feelings. I could connect with Dong-man. At times, he failed and got frustrated with himself but he endured and showed up for himself. Among all the young people who were struggling, I got to express one young person’s hardships.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Park portrays an ex-convict in Itaewon Class. Although it appears to be a tale about vengeance and retribution, it actually makes a pointed societal criticism on how the wealthy misuse their position of power. Instant success followed.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”Itaewon Class appeared in the midst of the Korean movies and drama boom, and I got to make a lot of international fans”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The actor thinks it was just a matter of time until people began to take notice of Korean cinema and television. He claims that the Korean entertainment business offered something fresh, and that Netflix and other streaming services allowed worldwide viewers access to these ventures.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”I personally feel that South Korea has been making a lot of effort and spending a lot of time creating good quality films and series, but it’s always been a bit of a hidden gem. There are a lot of good films and dramas and I want them to be recognised. I feel proud that I am able to contribute to this Korean boom.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>In addition, Park is a member of the friendship group Wooga Squad, which also includes actors Choi Woo-Shik (who played Ki-woo in Parasite), V from BTS, Park Hyung-sik, and Peakboy. They seem to support him in managing the immense strain Korean actors and \"idols\" are under.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”They are really good friends to me and very comforting. Not only do we share the same values, thoughts and perspectives on things but we are in similar industries, and so we are able to share advice. We try to comfort each other as human beings, because what I am going through could be something that the others might go through in the future.”</p>\n                </div>\n                "]},"reco":[{"id":"2cf6eba9-2f91-4424-8297-8a231d8b1875","date":"Sep 12, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52352016370_445e021036_o.png","title":"Can MCU's Secret Invasion Bring Back SHIELD?","tags":"tv news","excerpt":"Since Agents of SHIELD came to an end, SHIELD has not received much attention. Does Secret Invasion intend to alter that?"},{"id":"71e2e909-149f-448e-9bd8-0312cc7ca72a","date":"Sep 8, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52342497138_4136ec24ba_o.png","title":"The Hood May Be The Next Major Street-level Villain In The MCU","tags":"tv news","excerpt":"Marvel is getting ready to reintroduce major street-level antagonists like Kingpin to the MCU, but there's a new figure in the wings who may usurp all the authority and glory."},{"id":"7ae72d68-b434-4918-811e-1ec3433764bd","date":"Sep 5, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52334222037_68cfacf76f_o.png","title":"Wonder Man is about to make the MCU really weird","tags":"tv news","excerpt":"We now have additional information about what to anticipate from Marvel's Wonder Man series on Disney+ thanks to Ben Kingsley's confirmed return as Trevor Slattery."},{"id":"7ae9d477-fc9f-404d-a04c-775138154a2c","date":"Aug 26, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52312214911_60f6983b77_o.png","title":"10 Best Tom Holland Movies That You Should Watch","tags":"movie news","excerpt":"Over the years, Tom Holland has acted in a variety of unusual productions, from modest family dramas to one of the most successful superhero franchises ever."}]},"__N_SSG":true}