{"pageProps":{"article":{"id":"4485bf95-ab7a-4e8a-ae86-18d24b4bf297","date":"Apr 6, 2022","author":"Wallace Bell","title":"Time-Travel TV Shows That You Must Start Watching","excerpt":"Time travel is a popular subject in many forms of entertainment, from novels to movies. However, time travel has recently been a popular TV topic.","keywords":"series, tv shows, time travel","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51986899144_f2db0f747f_c.jpg","content":["<pre class='ArticleBody_text__ePgSJ'>Time travel is a gimmick that will never go out of style. Humans are fascinated by the prospect of traveling back in time, exploring the future, and discovering a new present. Any media that includes time travel allows us to fantasize about what may have been. The new Disney+ spin-off Loki returns to this topic, but the program does not go as far as one might imagine in terms of time travel.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">12 Monkeys</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986881369_bd61f827c0_b.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>The critically acclaimed 1995 film 12 Monkeys is still regarded as a science-fiction masterpiece today, so a television version was an unexpected decision. However, in 2015, Syfy aired a reboot of the series, and while it didn't get universal acclaim like its predecessor, 12 Monkeys is captivating from beginning to end. Katarina Jones (Barbara Sukowa) sends time traveler James Cole (Aaron Stanford) back in time to retrieve Dr. Cassandra Railly (Amanda Schull), who may be able to halt a future pandemic from spreading. As they are pursued by a strange gang known as the Army of the 12 Monkeys, they forge an odd alliance. Along the road, the two make allies and foes who will aid and obstruct their objective.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Doctor Who</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51985584877_968b30ffae_b.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>When it comes to time travel and television, Doctor Who is perhaps the most well-known brand in the genre, since the time travel series has been running for 13 seasons and is still going strong.</pre>","<pre class='ArticleBody_text__ePgSJ'>Doctor Who, which airs on BBC One in the United Kingdom, follows Time Lord aka The Doctor and his companions as they travel across time to prevent evil forces from altering history and harming innocent people.</pre>","<pre class='ArticleBody_text__ePgSJ'>The Time Lord may morph into a new body and continue rescuing the planet if he is injured beyond recovery. As a result, The Doctor has been performed by 13 different actors.</pre>","<pre class='ArticleBody_text__ePgSJ'>Doctor Who is not only ingrained in the fabric of British popular culture, but it has also made its way into the hearts of countless people throughout the globe.</pre>","<pre class='ArticleBody_text__ePgSJ'>It has spawned several spin-offs in the shape of television episodes, comic comics, films, and novels, to mention a few. But, more importantly, it has now established itself as an industry standard for both science-fiction and time-travel television series.</pre>","<pre class='ArticleBody_text__ePgSJ'>It's no surprise that Doctor Who has remained popular despite several cast changes and storyline twists.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Continuum</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51987146875_d768d547b9_c.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Kiera Cameron (Rachel Nichols) is a police officer from the future who is stuck in the present in Continuum. When she meets a juvenile prodigy, the two form an unexpected alliance that will aid them in stopping vicious assassins who have traveled from the future to the past. Continuum could have easily slipped into the same tired police procedural cliches we've seen a million times before. However, the future setting and a diverse cast of characters and relationships made this show stand out. Kiera is an intriguing protagonist. She's excellent at her work, but she's also a person who has outlived her usefulness. She's working on cases at the same time, unable to accomplish the one thing she really wants to do: return to her own time and life.</pre>","<pre class='ArticleBody_text__ePgSJ'>As the series progresses, Kiera's trusted tech companion, Alec (Erik Knudsen), has surprise plot arcs. Carlos Fonnegra (Victor Webster), Kiera's fellow detective, is significantly more complex than one might think. Carlos is first thrilled to have a capable companion like Kiera, but he soon becomes suspicious when Kiera appears to be too good to be true. In this program, the villains are equally as interesting as the protagonists, capable of foiling Kiera's plans while still having their own stories to tell. Continuum, which stars a who's who of Canadian performers, is one of the few episodes to be filmed and set in Vancouver, British Columbia, Canada, which helped it become a popular with Canadian fans.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Timeless</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51985584792_4cb3ef9af8_k.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>NBC's Timeless is another time travel TV show that has already become a cult classic and is appreciated by people all around the world. And, despite the drama that has surrounded this program, it is still time travel at its finest. Timeless, starring Malcolm Barrett, Matt Lanter, and Abigail Spencer as Rufus, Wyatt, and Lucy, follows the three as they journey across time to stop their enemies from changing history.</pre>","<pre class='ArticleBody_text__ePgSJ'>But, as it turns out, the conspiracy is more complicated than simply altering history. Our trio is hunting people who are going through time to bring down a terrifying and all-powerful organization. The same one that assisted in the construction of Rufus, Wyatt, and Lucy's time machine. Even though Timeless only lasted two seasons (plus a two-hour finale film), you should still see it since it's not only entertaining but also makes you think and desire to learn more about the events depicted in each episode.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Dark</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986881329_197c742efe_b.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Netflix's Dark is for you if you're seeking for a mind-bending, jaw-dropping show. This critically regarded German production is a mix of science fiction and horror. The drama takes place in the little village of Winden and follows numerous families who are all tied in some manner. The plot of the play begins when an apparently content husband and father commits suicide. His son, Jonas Kahnwald (Louis Hofmann), gets dragged into a wormhole and transported to other periods – and subsequently, alternate universes – where he learns the truth about his hometown and personal past. Dark is a captivating television show. You'll never know what's going to happen next.</pre>","<pre class='ArticleBody_text__ePgSJ'>This is suspenseful television at its finest, and one of Netflix's best original programs to date. The casting on this program is fantastic — the plot spans generations, and some of the actors picked to represent the younger and older versions of the characters are so similar in appearance that it's difficult to believe they're not related in real life. The show's biggest value is once again the characters. Some you'll want to defend, while others you'll immediately despise. The show ended after three seasons, so you won't have to deal with any cliffhangers if you watch it all at once.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Outlander</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986880964_2dcdf64232_h.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Want to see another show that successfully blends time travel and historical events? Then you should add Outlander to your list of must-see TV shows! The story begins in the 1940s, when Claire Randall, a battlefield nurse, travels to Inverness, Scotland on her second honeymoon with her husband Frank. Claire comes across the standing stones of Craigh na Dun by chance, and they transfer her to 1743.</pre>","<pre class='ArticleBody_text__ePgSJ'>She must first survive 18th century Scotland in order to return to her own time. And she accomplishes this by joining a band of Clan MacKenzie rebels and marrying one of them, Jamie Fraser. However, she soon falls in love with her new spouse and helps the clan elude the British redcoats who are chasing them. Claire jumps back and forth between the 20th and 18th centuries and her two families as she encounters two pregnancies, wars, and much more throughout the five seasons of Outlander that are now available (with the sixth coming shortly). Claire, on the other hand, finally finds her way back to Jamie.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Erased</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986881244_0fe5c44334_w.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Kei Sanbe's manga series Erased is written and illustrated in Japanese. Netflix converted the series into a live-action show, with an anime adaptation also available. As a result, this is a two-for-one entry. Satoru Fujinuma, who possesses the power to go into his past, is the protagonist of Erased. When tragedy strikes, Satoru must travel back in time to prevent the murders and kidnappings of his classmates. The anime and live-action productions are both fascinating to watch. The characters are just ordinary individuals trying to right their wrongs, which is what makes them so intriguing to watch. Noriko Eguchi, who portrays the mother in the live-action production, does a fantastic job in the part.</pre>","<pre class='ArticleBody_text__ePgSJ'>The major murder mystery will have you on the edge of your seat, especially the historical tale, when the protagonists are all youngsters attempting to keep each other safe. The Japanese setting is also a nice change of pace from most other programs. Because the series is character-driven, you get a sense of what it would be like to live with these folks. The event also includes non-sushi Japanese food, which is fantastic to behold. The series might have easily been adapted for several seasons, but the showrunners stayed true to the original manga's plot and completed the arc in one season.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">The Umbrella Academy</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51987146480_e1ca40b032_k.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>The Umbrella Academy, a Netflix original, adds to the list. On October 1, 1989, 43 babies were delivered to unwitting mothers despite the fact that they had not been pregnant the day before. The Hargreeve siblings were reared together and taught in their individual powers until their connection frayed as adults and they drifted apart.</pre>","<pre class='ArticleBody_text__ePgSJ'>The death of their adoptive father – and, of course, the prospect of the end of the world – brings them back together as adults. They are compelled to travel back in time, but they wind up in separate eras and locations, and they must reunite to prevent the nuclear holocaust.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">DC’s Legends of Tomorrow</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51987146765_b0da2df9cc_b.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>A mysterious individual gathers a group of heroes, stating that they are \"legends\" who must preserve the chronology. DC's Legends of Tomorrow is a spin-off from a number of CWVerse series. This program, unlike the others in the CWVerse, isn't explicitly based on a comic book series, but it does feature some comic book characters as members of the team. The program took a while to find its foothold, and by the conclusion of the first season, some of the primary cast members had gone. However, DC's Legends of Tomorrow has regained its stride since then. With a cast of people that are both irreverent and devoted, the program is at ease being quirky and campy.</pre>","<pre class='ArticleBody_text__ePgSJ'>They are the quintessential heroes — in other words, total catastrophes who sabotage every operation they undertake yet manage to solve it in the end. The show is known for its varied cast (which has gotten better with each season), gay themes, and the endearing primary relationship between co-captains Sara Lance (Caity Lotz) and Ava Sharpe (Sarah Paulson) (Jess Macallan). There's also a lot of time travel involved. In practically every episode, the squad travels across time, and they must dress appropriately if they are going off-ship. The Legends know how to look nice while fighting bad guys, whether they're humans, gods, or aliens.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Fringe</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986881054_4c58e8f146.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Parallel worlds, superhuman talents, bioengineering, apocalypse prophesies, and, of course, time travel all featured prominently in Fox's Fringe series. The term comes from fringe science, a field of research that deals with scientific hypotheses that are fraught with suspicion or have previously been disproven.</pre>","<pre class='ArticleBody_text__ePgSJ'>Special Agent Olivia Dunham is tasked to manage the FBI's Fringe Division, which is led by Peter Bishop and his father Walter, in Fringe. To investigate the inexplicable, the team combines fringe science with Olivia's expertise in investigative tactics. They uncover a greater mystery involving parallel universes and different timelines in the process.</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">11.22.63</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986881374_67652dbe5d_b.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>When Stephen King is engaged with a project, you know it'll be fantastic. The eight-episode Hulu miniseries 11.22.63 is a science fiction thriller unlike any other, based on King's novel 11/22/63. 11.22.63 follows Jake Epping, an English teacher from Maine, who is played by James Franco.</pre>","<pre class='ArticleBody_text__ePgSJ'>His closest buddy Al shows him a time machine and begs him to take up the mission he's been working on: traveling to the 1960s and preventing President John F. Kennedy's killing. Will Jake be able to change a history that refuses to change?</pre>","\n                <h2 class=\"ArticleBody_heading__tc5g4\">Loki</h2>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51986880904_5b17d36da0_h.jpg\" alt=\"series, tv shows, time travel\">\n                </div>","<pre class='ArticleBody_text__ePgSJ'>Yes, the Marvel Cinematic Universe is one of our generation's greatest gifts to film. The MCU has now extended even further into the television medium, with a few programs to go along with it! Loki is one of them, and it's about the God of Thunder's mischievous adopted brother.</pre>","<pre class='ArticleBody_text__ePgSJ'>Loki unwittingly establishes another timeline that begins in 2012 after the events of Avengers: Endgame, specifically his theft of the Tesseract, making him a \"time variation\" version of himself. Loki is offered two options when faced by the authorities: accept punishment and cease to exist, or go through time to remedy his own mess and the menace that has arisen.</pre>"]},"reco":[{"id":"405cd1ef-56c8-494e-a132-c735b50d2f1c","date":"Apr 12, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51999579280_96c97901cf_c.jpg","title":"Moon Knight Cannot Defeat The Mandalorian In A Fight, According To Pedro Pascal","tags":"tv news","excerpt":"Pedro Pascal joins the argument between Moon Knight and The Mandalorian, which was begun by Moon Knight star Oscar Isaac, and claims that his hero will triumph."},{"id":"062db741-dc24-4805-b849-f08c8a9941db","date":"Apr 11, 2022","author":"Nick Carver","thumbnail":"https://live.staticflickr.com/65535/51997352443_38d85dc031_c.jpg","title":"The Reunion of Doc Ock and Maguire in Spider-Man Made Alfred Molina Cry","tags":"movie news","excerpt":"Alfred Molina, who featured with Tobey Maguire in Spider-Man 2, says that his reunion with Tobey Maguire, who he co-starred with in Spider-Man 2, made him weep."},{"id":"34e061d6-e747-4446-87b6-9e6618fbf51e","date":"Apr 11, 2022","author":"Andres Pineda","thumbnail":"https://live.staticflickr.com/65535/51997523665_55c2a0f398_c.jpg","title":"The Best Filipino Movies That You Need To Watch","tags":"movie news","excerpt":"In this article, we look into Filipino films and cinema, which is undoubtedly one of Southeast Asia's most underrated businesses."},{"id":"6d8df57f-04ce-496f-b891-06c8208020ec","date":"Apr 11, 2022","author":"Wallace Bell","thumbnail":"https://live.staticflickr.com/65535/51997038444_e1d6e422c3_c.jpg","title":"Season 4 Of Stranger Things Is Similar To Game Of Thrones, According To The Creators","tags":"tv news","excerpt":"While discussing Stranger Things season 4, the Duffer Brothers make a comparison between the Netflix series and Game of Thrones."}]},"__N_SSG":true}