{"pageProps":{"article":{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens.","keywords":"from season 2, from renewed for another season","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The smash new series From, the spooky invention of Crater's John Griffin, has been renewed by EPIX, MGM's premium satellite and cable network. Set in a secret village that confines everyone who enters — think Lost, which is also produced by series creators Jack Bender and Jeff Pinkner — the show has become one of the network's most popular original programs, with a 94 percent Rotten Tomatoes score. The series has also been well received by audiences, with an overall score of 87 percent based on over one hundred individual ratings.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>\"In Season 2, hidden truths about the nature and terrifying origins of the town begin to emerge, even as life for its residents is plunged into chaos by the arrival of mysterious newcomers,\" according to a press statement. According to the press announcement, filming will begin this summer in Halifax, Nova Scotia, with an air date set for 2023. Fans will undoubtedly be anxious to return to the action as soon as possible, given that the renewal news comes only two weeks after the Season 1 conclusion.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>According to the press release, \"current performance metrics suggest that the entire series is on course to be EPIX's second most-watched original after Emmy-winning series Godfather of Harlem, executive produced by and starring Forest Whitaker.”</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>”The first season of From mystified, enthralled, and terrified fans and critics alike with its haunting world, vivid characters and thrilling scares. We have been delighted by the social conversation generated by the From community and can't wait to unravel more of this mysterious story with our passionate fans in season two” -Michael Wright, president of EPIX</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/52036525522_a3ca2f73c0_o.jpg\" alt=\"from season 2, from renewed for another season\">\n                </div>","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"On behalf of the producers, writers, our insanely talented cast and crew,we are thrilled and grateful to both EPIX and our audience for the opportunity to continue exploring the world of From.\" -Jeff Pinkner, executive producer</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>EPIX Studios and MGM International Television Productions collaborated on From. Josh Appelbaum, André Nemec, Scott Rosenberg from Midnight Radio, Anthony & Joe Russo, Mike Larocca from AGBO, and Lindsay Dunn serve as executive producers with Pinkner, Griffin, and Bender.\nAdrienne Erickson of Midnight Radio acts as co-executive producer.</p>\n                </div>\n                "]},"reco":[{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","tags":"movie news","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."},{"id":"2e33995d-5372-4e32-8d02-dcddba685d49","date":"Apr 26, 2022","author":"Nikko Russell","thumbnail":"https://live.staticflickr.com/65535/52029991277_a0d614e541_c.jpg","title":"Best Barry Keoghan Movies That You Should Watch","tags":"movie news","excerpt":"Barry Keoghan's career is only getting started, with films like 'Dunkirk' and 'Calm with Horses.’"}]},"__N_SSG":true}