{"pageProps":{"article":{"id":"4b4d9d1e-d36f-4d42-a371-d5be789313a8","date":"Apr 7, 2022","author":"Nick Carver","title":"The Director of Avengers: Endgame Explains Why Marvel Movies Have So Much Humor","excerpt":"As Kevin Feige is aware of what people appreciate, Joe Russo explains that the secret to Marvel's success is the usage of comedy in their films.","keywords":"mcu, avengers, marvel","tags":"movie news","thumbnail":"https://live.staticflickr.com/65535/51988471790_f1d8861371_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Joe Russo, director of Avengers: Endgame, explains why the MCU films are so funny. The MCU is the most profitable film series of all time, with $25.6 billion in worldwide box office receipts, and viewers have gotten engrossed in the characters and universe of these heroes over the last 14 years. The films have become quotable in regular conversation, and the discussion has become one of the most important pieces of shared cultural moments of the twenty-first century.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>The MCU's sense of humor began in 2008 with Iron Man, when the picture lacked a full script and had to rely on Robert Downey Jr.'s improv talents, which director Jon Favreau was well equipped for given his comedic background. The Avengers would further define the series, since the script's banter and humor was one of the film's highlights, and future MCU films have attempted to replicate it. The MCU's humorous components have now proven equally as popular with audiences as the action sequences.</p>\n                </div>\n                ","\n                <div class='ArticleBody_imageContainer__ktXae'>\n                <img src=\"https://live.staticflickr.com/65535/51987914126_6784ba6aa9_h.jpg\" alt=\"mcu, avengers, marvel\">\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Russo explains why the MCU films have so much humour and claims that it is the secret to Marvel's success. Russo confirmed to Deadline through TheDirect that Marvel Studios President Kevin Feige enjoys testing Marvel films to see how fans react to them. Feige wants his audience to have a good time, and one way to do it is through humor.</p>\n                </div>\n                ","\n                <div class='ArticleBody_quote__9rdnr'>\n                <p>\"Well, Marvel’s secret sauce is that Kevin likes the films to be entertaining, right? And entertaining typically involves humor, and I think that Kevin’s very big on testing movies and I think he likes to sit in the test screening and hear the response. So the audience’s laughing, you can hear their response. You can understand, ’Okay, every 2 minutes [they] are getting some enjoyment out of the movie,' and that’s a strong way for him to gauge how the movie will perform with an audience, right? So I think humor is very important to him.”</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Some criticize the franchise's insistence on humor, believing it often deflates rather serious moments, and others criticize the franchise's inability to take anything seriously, such as mocking Doc Ock's name in Spider-Man: No Way Home. The MCU style of humor has become so popular that it has been imitated by other studios and has now gained a negative reception among some audience members as \"Marvel Humor.” Despite the humor, the MCU has been able to incorporate more lofty themes into their films, such as racial politics in Black Panther, colonialism's devastations and effects on refugees in both Captain Marvel and Thor: Ragnarok, and the complicated nature of children and parents in Shang-Chi and the Legend of the Ten Rings.</p>\n                </div>\n                "]},"reco":[{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","tags":"movie news","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero."},{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","tags":"tv news","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."}]},"__N_SSG":true}