{"pageProps":{"article":{"id":"e9eab11e-50b8-49a6-95ff-6cb609eae058","date":"Mar 28, 2022","author":"Wallace Bell","title":"James Gunn Reacts to Peacemaker's Intro Dance Being Recreated At a Talent Show","excerpt":"James Gunn reacts to a high-school talent competition that recreates the dance sequence from Peacemaker, claiming that the original was shot in a comparable auditorium.","keywords":"james gunn, peacemaker, dc, dcu","tags":"tv news","thumbnail":"https://live.staticflickr.com/65535/51966787761_74d8f5389c_c.jpg","content":["\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>A videotape of the Peacemaker introduction dance routine being replicated for a high school talent event has prompted director James Gunn to respond. The series, which stars John Cena as the titular hero/antihero, is a direct spinoff from James Gunn's The Suicide Group, and follows the vicious mercenary as he is recruited by Amanda Waller's A.R.G.U.S. to join another black ops squad. They've been tasked with dealing with an extraterrestrial menace in the shape of parasitic butterfly-like organisms who've taken up residence in human bodies.</p>\n                </div>\n                ","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Gunn established the tone for his series with an exhilarating, choreographed introduction dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" Gunn set the tone for his series with an exhilarating, choreographed introductory dance sequence set to Wig Wam's \"Do You Wanna Taste It?\" \"No kidding, we shot the actual opening in a school auditorium not so different from that,\" Gunn said to a tweet showing the sequence being reproduced for a high-school talent competition.</p>\n                </div>\n                ","\n                <div class=\"ArticleBody_twitter__xokII\">\n                <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No kidding, we shot the actual opening in a school auditorium not so different from that. <a href=\"https://twitter.com/hashtag/Peacemaker?src=hash&amp;ref_src=twsrc^tfw\">#Peacemaker</a> <a href=\"https://t.co/S9IsLv8ReU\">https://t.co/S9IsLv8ReU</a></p>— James Gunn (@JamesGunn) <a href=\"https://twitter.com/JamesGunn/status/1507732545470971905?ref_src=twsrc^tfw\">March 26, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n                </div>","\n                <div>\n                <p class='ArticleBody_text__ePgSJ'>Peacemaker has already been renewed for a second season, so fans will be interested to see what happens with the beginning dance sequence as fresh episodes air. Given that several of the characters from the original scene are no longer alive, such as Annie Chang's Detective Sophie Song and Robert Patrick's Auggie Smith, the sequence is likely to be re-choreographed and re-filmed. The launch date for Peacemaker season 2 has yet to be revealed, so fans may have to wait a while to watch more of John Cena's dance moves.</p>\n                </div>\n                "]},"reco":[{"id":"6d03194c-14c9-4e67-af5e-831faf467d32","date":"May 4, 2022","author":"Brian Martin","thumbnail":"https://live.staticflickr.com/65535/52049604360_5f698d8c1f_o.png","title":"Zac Efron Would Seize The Opportunity To Join MCU In The Right Role","tags":"movie news","excerpt":"Zac Efron says he'd \"jump at the opportunity\" to join the Marvel Cinematic Universe after years of fans portraying him as a superhero."},{"id":"00fbaed5-e026-4b38-88dc-8904b3dd6634","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52037561556_58ea308c4a_o.png","title":"Epix Renews Sci-Fi Horror Series ‘From’ for Another Season","tags":"tv news","excerpt":"Epix has renewed its science fiction horror thriller From for a second season, with Harold Perrineau (Lost) reprising his starring role as Boyd Stevens."},{"id":"5cc76569-9baa-46c2-826e-f55cb1001150","date":"Apr 29, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52038019365_a70c89d817_o.png","title":"Why The Joker Should Not Be the Main Villain in The Batman Sequel","tags":"movie news","excerpt":"We discuss why the Joker, played by Barry Keoghan, should not be the major antagonist in Batman 2."},{"id":"82b2ac26-b716-4e41-bc9f-9524274fd9bd","date":"Apr 28, 2022","author":"Alfred Bright","thumbnail":"https://live.staticflickr.com/65535/52035507666_6592e83354_c.jpg","title":"The Mummy (2017) director describes the film as the 'worst failure of my life, personally and professionally’","tags":"movie news","excerpt":"A reboot of The Mummy franchise, Tom Cruise plays the role of US President. Army Sergeant Nick Morton, a lucky soldier who unearths the ancient tomb of an enslaved Egyptian princess by mistake."}]},"__N_SSG":true}